
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяВерсияПодсистемыВЭД = Константы.РЭЙ_НомерВерсииПодсистемыВЭД.Получить();
	
	Если ТекущаяВерсияПодсистемыВЭД = "" Тогда
		Если ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел()) Тогда
			ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
			Константы.РЭЙ_НомерВерсииПодсистемыВЭД.Установить(ОбработкаОбъект.НомерПоследнейВерсии());
		Иначе
			ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
			ОбработкаОбъект.ПервоначальноеЗаполнение();
			ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
		КонецЕсли;
		Элементы.ОписаниеОбновлений.Видимость = Ложь;
	Иначе
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.ВыполнитьОбновление();
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	КонецЕсли;
	
	Элементы.ГруппаПерезапуск.Видимость = Объект.ОбновленоРасширение;
КонецПроцедуры

&НаКлиенте
Процедура Перезапустить(Команда)
	ЗавершитьРаботуСистемы(Ложь, Истина);
КонецПроцедуры
