#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МетодЗавершения = Параметры.МетодЗавершения;
	Элементы.ГруппаСтраницы.Видимость = Ложь;
	Элементы.ГруппаТокен.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОбработкаОповещения = Новый ОписаниеОповещения(МетодЗавершения, ВладелецФормы);
	
	Если Не ЗавершениеРаботы
		 И ОбработкаОповещения <> Неопределено Тогда
		
		ВыполнитьОбработкуОповещения(ОбработкаОповещения, ПараметрыАвторизации);
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВебСодержимоеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия <> Неопределено Тогда		
		
		ПодстрокаПоиска = "#access_token";
		
		href = ДанныеСобытия.href;
		
		НайденнаяПозиция = Найти(href, ПодстрокаПоиска); 
		
		Если НайденнаяПозиция > 0 Тогда
			
			ПараметрыАвторизации = Новый Структура;
		
			СтрокаПараметров = Сред(href, НайденнаяПозиция + 1);
			
			МассивПараметров = СтрРазделить(СтрокаПараметров, "&", Ложь);
			
			Для каждого ОписаниеПараметра Из МассивПараметров Цикл
			
				ИмяИЗначениеПараметра = СтрРазделить(ОписаниеПараметра, "=", Ложь);
				
				Если ИмяИЗначениеПараметра.Количество() > 1 Тогда
					
					ПараметрыАвторизации.Вставить(НРег(ИмяИЗначениеПараметра[0]), ИмяИЗначениеПараметра[1]);
				
				КонецЕсли; 
			
			КонецЦикла;
			
			Закрыть(ПараметрыАвторизации);
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьБраузер(Команда)
	ПерейтиПоНавигационнойСсылке(CRM_DropboxСервер.ПолучитьАдресСтраницыАвторизации());
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТокен(Команда)
	ПараметрыАвторизации = Новый Структура("access_token, account_id, token_type, uid", access_token, account_id, token_type, uid);
	Закрыть(ПараметрыАвторизации);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
	Поз1 = Найти(ПолученнаяСсылка, "access_token=");
	Поз2 = Найти(ПолученнаяСсылка, "&token_type=");
	access_token = СокрЛП(СтрЗаменить(Сред(ПолученнаяСсылка, Поз1, Поз2-Поз1), "access_token=", ""));
	Поз1 = Найти(ПолученнаяСсылка, "token_type=");
	Поз2 = Найти(ПолученнаяСсылка, "&uid=");
	token_type = СокрЛП(СтрЗаменить(Сред(ПолученнаяСсылка, Поз1, Поз2-Поз1), "token_type=", ""));
	Поз1 = Найти(ПолученнаяСсылка, "uid=");
	Поз2 = Найти(ПолученнаяСсылка, "&account_id=");
	uid = СокрЛП(СтрЗаменить(Сред(ПолученнаяСсылка, Поз1, Поз2-Поз1), "uid=", ""));
	Поз1 = Найти(ПолученнаяСсылка, "account_id=");
	account_id = СокрЛП(СтрЗаменить(Сред(ПолученнаяСсылка, Поз1, СтрДлина(ПолученнаяСсылка)-Поз1), "account_id=", ""));
КонецПроцедуры


#КонецОбласти
