#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = НСтр("ru='Установка показателя';en='Setting the metric'")+": "+Данные.Ссылка.Показатель + "/" + Данные.Ссылка.Исполнитель;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПерепровестиУстановкиПоказателейСКратностью() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_УстановкаИспользуемыхПоказателей.Ссылка,
	                      |	CRM_УстановкаИспользуемыхПоказателей.ЗначениеПоказателя,
	                      |	CRM_УстановкаИспользуемыхПоказателей.ЗначениеПоказателяМаксимум,
	                      |	CRM_УстановкаИспользуемыхПоказателей.Показатель.КратностьЗначений КАК КратностьЗначений,
	                      |	CRM_УстановкаИспользуемыхПоказателей.Показатель.ДробнаяЧасть КАК ДробнаяЧасть,
	                      |	CRM_УстановкаИспользуемыхПоказателей.Показатель.ПериодАнализа КАК ПериодАнализа
	                      |ИЗ
	                      |	Документ.CRM_УстановкаИспользуемыхПоказателей КАК CRM_УстановкаИспользуемыхПоказателей
	                      |ГДЕ
	                      |	CRM_УстановкаИспользуемыхПоказателей.Показатель.КратностьЗначений <> ""НеИзменять""
	                      |	И CRM_УстановкаИспользуемыхПоказателей.Проведен");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.CRM_ИспользуемыеКлючевыеПоказатели.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если Выборка.КратностьЗначений = "Тысячи" Тогда	
			КратностьЗначений = 1000; 
		ИначеЕсли Выборка.КратностьЗначений = "Миллионы" Тогда	
			КратностьЗначений = 1000000;	
		КонецЕсли;
		
		Если Выборка.ДробнаяЧасть = "Целое" Тогда
			ДробнаяЧасть = 0;
		ИначеЕсли Выборка.ДробнаяЧасть = "Десятые" Тогда	
			ДробнаяЧасть = 1; 
		ИначеЕсли Выборка.ДробнаяЧасть = "Сотые" Тогда	
			ДробнаяЧасть = 2;	
		ИначеЕсли Выборка.ДробнаяЧасть = "Тысячные" Тогда	
			ДробнаяЧасть = 3;	
		КонецЕсли;
		
		Если Выборка.ПериодАнализа = "Месяц" Тогда
			
			ЗначениеДень = Выборка.ЗначениеПоказателя * КратностьЗначений / НаборЗаписей.Количество();
			ЗначениеМаксимумДень = Выборка.ЗначениеПоказателяМаксимум * КратностьЗначений / НаборЗаписей.Количество();
			
			ОкругленноеДень = Окр(ЗначениеДень, ДробнаяЧасть, 1);
			ОкругленноеМаксимумДень = Окр(ЗначениеМаксимумДень, ДробнаяЧасть, 1);
			
			Разница = ЗначениеДень - ОкругленноеДень;
			РазницаМаксимум = ЗначениеМаксимумДень - ОкругленноеМаксимумДень;
			
			НакопленноеОтклонение = 0;
			НакопленноеМаксимумОтклонение = 0;
			
			СчДней = 0;
			Для Каждого Движение Из НаборЗаписей Цикл
				СчДней = СчДней + 1;
				НакопленноеОтклонение = НакопленноеОтклонение + Разница;
				НакопленноеМаксимумОтклонение = НакопленноеМаксимумОтклонение + РазницаМаксимум;
				
				Если СчДней = НаборЗаписей.Количество() Тогда
					Движение.ЗначениеПоказателя = ОкругленноеДень + НакопленноеОтклонение;
					Движение.ЗначениеПоказателяМаксимум = ОкругленноеМаксимумДень + НакопленноеМаксимумОтклонение;
				Иначе	
					Если НакопленноеОтклонение >= 1 Тогда
						Движение.ЗначениеПоказателя = ОкругленноеДень + 1;
						НакопленноеОтклонение = НакопленноеОтклонение - 1;
					ИначеЕсли НакопленноеОтклонение <= -1 Тогда
						Движение.ЗначениеПоказателя = ОкругленноеДень - 1;
						НакопленноеОтклонение = НакопленноеОтклонение + 1;
					Иначе
						Движение.ЗначениеПоказателя = ОкругленноеДень;
					КонецЕсли;	
					
					Если НакопленноеМаксимумОтклонение >= 1 Тогда
						Движение.ЗначениеПоказателяМаксимум = ОкругленноеМаксимумДень + 1;
						НакопленноеМаксимумОтклонение = НакопленноеМаксимумОтклонение - 1;
					ИначеЕсли НакопленноеМаксимумОтклонение <= -1 Тогда
						Движение.ЗначениеПоказателяМаксимум = ОкругленноеМаксимумДень - 1;
						НакопленноеМаксимумОтклонение = НакопленноеМаксимумОтклонение + 1;
					Иначе
						Движение.ЗначениеПоказателяМаксимум = ОкругленноеМаксимумДень;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		ИначеЕсли Выборка.ПериодАнализа = "День" Тогда
			
			Для Каждого СтрокаДней Из НаборЗаписей Цикл
				Движение.ЗначениеПоказателя = Выборка.ЗначениеПоказателя * КратностьЗначений;
				Движение.ЗначениеПоказателяМаксимум = Выборка.ЗначениеПоказателяМаксимум * КратностьЗначений;
			КонецЦикла;
			
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли