
////////////////////////////////////////////////////////////////////////////////
// НА СЕРВЕРЕ

//******* СОБЫТИЯ НА СЕРВЕРЕ *******

//******* БИЗНЕС-ЛОГИКА НА СЕРВЕРЕ *******

////////////////////////////////////////////////////////////////////////////////
// НА КЛИЕНТЕ

//******* БИЗНЕС-ЛОГИКА НА КЛИЕНТЕ *******

//******* КОМАНДЫ *******

//******* СОБЫТИЯ НА КЛИЕНТЕ *******

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ПоказатьПредупреждение(, "Из этой формы запрещено изменять настройку сроков представления документов валютного контроля
				|Форма настройки сроков находится в меню ""Настройка - Сроки представления документов валютного контроля""!", 60);
				
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ПоказатьПредупреждение(, "Из этой формы запрещено добавлять настройки сроков представления документов валютного контроля
				|Форма настройки сроков находится в меню ""Настройка - Сроки представления документов валютного контроля""!", 60);
				
	Отказ = Истина;
	
КонецПроцедуры
