

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура УстановитьОтборПоДоступнымПодразделениям()
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	СписокДоступныхПодразделений = ПолучитьСписокДоступныхПодразделений();
	ЭлементОтбора.ПравоеЗначение = СписокДоступныхПодразделений;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТолькоДоступные") И Параметры.ТолькоДоступные Тогда
		УстановитьОтборПоДоступнымПодразделениям();
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
