#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Для Каждого ЭлементОтбора Из ЭтотОбъект.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл
		Если	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Этап")
			И	ЭлементОтбора.Использование
			И	ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение)
			И	ЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.ВИерархии Тогда
			//
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			
			ИДПользовательскойНастройки = Неопределено;
			Для Каждого ЭлементОтбораНастройки Из ЭтотОбъект.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
				Если ЭлементОтбораНастройки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Этап") Тогда
					ИДПользовательскойНастройки = ЭлементОтбораНастройки.ИдентификаторПользовательскойНастройки;
					ЭлементОтбораНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ИДПользовательскойНастройки <> Неопределено Тогда
				Для Каждого ЭлементПользовательскойНастройки Из ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
					Если ЭлементПользовательскойНастройки.ИдентификаторПользовательскойНастройки = ИДПользовательскойНастройки Тогда
						ЭлементПользовательскойНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	CRM_ОбщегоНазначенияСервер.ОтчетПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#КонецЕсли