
&НаКлиенте
Перем ИдентификаторОтбораПоВладельцу;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановкаЗначенияОтбора();
	ОбновитьЗаголовок();

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	УстановкаЗначенияОтбора();
	ОбновитьЗаголовок();

КонецПроцедуры
  


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЭлементОтбора = Список.Отбор.ПолучитьОбъектПоИдентификатору(ИдентификаторОтбораПоВладельцу);
	ЭлементОтбора.ПравоеЗначение = Организация;
	
	ОбновитьЗаголовок();	
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ОбновитьЗаголовок()
	ДанныеОбОрганизации = ПолучитьДанныеОбОрганизации(Организация);

	Заголовок = "Список подразделений организации " + ДанныеОбОрганизации.Наименование;			
	Элементы.Список.ПодчиненныеЭлементы.КодПоОКАТО.Видимость = ДанныеОбОрганизации.ЭтоЮрЛицо;
	Элементы.Список.ПодчиненныеЭлементы.КПП.Видимость = ДанныеОбОрганизации.ЭтоЮрЛицо;	
КонецПроцедуры // ОбновитьЗаголовок()

&НаСервереБезКонтекста
Функция ПолучитьДанныеОбОрганизации(парОрганизация)
	Результат = Новый Структура;
	Результат.Вставить("Наименование", парОрганизация.Наименование);
	Результат.Вставить("ЭтоЮрЛицо",	ПарОрганизация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура УстановкаЗначенияОтбора()
	Если Организация.Пустая() Тогда
		Организация = РЭЙ_Универсализация.ПолучитьОсновнуюОрганизацию();		
	КонецЕсли;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Организация;
	ЭлементОтбора.Использование = Истина;
	ИдентификаторОтбораПоВладельцу	= Список.Отбор.ПолучитьИдентификаторПоОбъекту(ЭлементОтбора);	
КонецПроцедуры	
