
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПрограммноеОткрытие") И Параметры.ПрограммноеОткрытие Тогда
		Элементы.СписокВыбратьПрограммно.Видимость	= Истина;		
	Иначе
		Элементы.СписокВыбратьПрограммно.Видимость	= Ложь;
		Элементы.СписокВыбрать.Видимость			= Истина;
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование Тогда
		Если НЕ Параметры.ПараметрыНового = Неопределено Тогда
			Отказ = Истина;
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ПараметрыНового",Параметры.ПараметрыНового);
			ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаОбъекта",ПараметрыФормы,Элементы.Список);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	РезультатВыбора = ПодготовитьРезультатВыбора();
	ОповеститьОВыборе(РезультатВыбора);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодготовитьРезультатВыбора()
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено ИЛИ ВыделенныеСтроки.Количество() <= 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивВыбора = Новый массив;
	
	Для Каждого ЭлементМассива Из ВыделенныеСтроки Цикл
		МассивВыбора.Добавить(ЭлементМассива);
	КонецЦикла;		
	
	Возврат МассивВыбора;
	
КонецФункции	

#КонецОбласти 

