
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СВО.Ссылка КАК Справка,
	|	ВЫБОР
	|		КОГДА СВО.ВалютаДокумента = СВО.КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА СВО.СуммаВВалютеДокумента
	|		ИНАЧЕ СВО.СуммаВВалютеКонтракта
	|	КОНЕЦ КАК Сумма,
	|	СВО.РасчетныйДокумент
	|ПОМЕСТИТЬ АвансовыеСВО
	|ИЗ
	|	Документ.РЭЙ_СправкаОВалютныхОперациях.ВалютныеОперации КАК СВО
	|ГДЕ
	|	СВО.Ссылка.Проведен
	|	И СВО.Ссылка В(&СсылкиСВО)
	|	И СВО.КонтрактВЭД = &КонтрактВЭД
	|	И СВО.ВидВалютнойОперации.ОжидаемыйСрок
	|	И СВО.Ссылка.Дата <= &Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СПД.АвансоваяСправка,
	|	СПД.АвансовыйРасчетныйДокумент,
	|	СУММА(СПД.СуммаАвансаВВалютеКонтракта) КАК Сумма
	|ПОМЕСТИТЬ ЗакрытыеСВО
	|ИЗ
	|	Документ.РЭЙ_СправкаОПодтверждающихДокументах.Авансы КАК СПД
	|ГДЕ
	|	СПД.Ссылка.Проведен
	|	И СПД.Ссылка В(&СсылкиСПД)
	|	И СПД.Ссылка.КонтрактВЭД = &КонтрактВЭД
	|	И СПД.Ссылка.Дата <= &Период
	|	И СПД.Ссылка <> &СсылкаСПД
	|
	|СГРУППИРОВАТЬ ПО
	|	СПД.АвансоваяСправка,
	|	СПД.АвансовыйРасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТекущегоДокумента.АвансоваяСправка,
	|	ДанныеТекущегоДокумента.АвансовыйРасчетныйДокумент,
	|	ДанныеТекущегоДокумента.СуммаАвансаВВалютеКонтракта КАК Сумма
	|ПОМЕСТИТЬ ПредварительныеДанныеТекущегоДокумента
	|ИЗ
	|	&ДанныеТекущегоДокумента КАК ДанныеТекущегоДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныеДанныеТекущегоДокумента.АвансоваяСправка,
	|	ПредварительныеДанныеТекущегоДокумента.АвансовыйРасчетныйДокумент,
	|	СУММА(ПредварительныеДанныеТекущегоДокумента.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ДанныеТекущегоДокумента
	|ИЗ
	|	ПредварительныеДанныеТекущегоДокумента КАК ПредварительныеДанныеТекущегоДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныеДанныеТекущегоДокумента.АвансоваяСправка,
	|	ПредварительныеДанныеТекущегоДокумента.АвансовыйРасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыеСВО.Справка КАК Справка,
	|	АвансовыеСВО.Сумма КАК Аванс,
	|	ЕСТЬNULL(ЗакрытыеСВО.Сумма, 0) + ЕСТЬNULL(ДанныеТекущегоДокумента.Сумма, 0) КАК Зачтено,
	|	АвансовыеСВО.Сумма - ЕСТЬNULL(ЗакрытыеСВО.Сумма, 0) - ЕСТЬNULL(ДанныеТекущегоДокумента.Сумма, 0) КАК НеЗачтено,
	|	АвансовыеСВО.РасчетныйДокумент
	|ПОМЕСТИТЬ ДоступныеАвансы
	|ИЗ
	|	АвансовыеСВО КАК АвансовыеСВО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗакрытыеСВО КАК ЗакрытыеСВО
	|		ПО АвансовыеСВО.Справка = ЗакрытыеСВО.АвансоваяСправка
	|			И АвансовыеСВО.РасчетныйДокумент = ЗакрытыеСВО.АвансовыйРасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеТекущегоДокумента КАК ДанныеТекущегоДокумента
	|		ПО АвансовыеСВО.Справка = ДанныеТекущегоДокумента.АвансоваяСправка
	|			И АвансовыеСВО.РасчетныйДокумент = ДанныеТекущегоДокумента.АвансовыйРасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеАвансы.Справка КАК Справка,
	|	ДоступныеАвансы.Аванс,
	|	ДоступныеАвансы.Зачтено,
	|	ДоступныеАвансы.НеЗачтено,
	|	ДоступныеАвансы.РасчетныйДокумент,
	|	ДоступныеАвансы.Справка.Дата КАК Дата
	|ИЗ
	|	ДоступныеАвансы КАК ДоступныеАвансы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ ПО
	|	Справка";
	
	Период = КонецДня(Параметры.РасчетныйДокумент.Дата);
	Запрос.УстановитьПараметр("КонтрактВЭД", Параметры.КонтрактВЭД);
	Запрос.УстановитьПараметр("ВалютаКонтракта", Параметры.КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("СсылкаСПД", Параметры.СсылкаСПД);
	Запрос.УстановитьПараметр("ДанныеТекущегоДокумента", ПолучитьИзВременногоХранилища(Параметры.ДанныеТекущегоДокумента));
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СсылкиСВО", РЭЙ_СлужебныйСервер.ПолучитьСсылкиНаАктуальныеСВО(, Период));
	Запрос.УстановитьПараметр("СсылкиСПД", РЭЙ_СлужебныйСервер.ПолучитьСсылкиНаАктуальныеСПД(, Период));
	
    ДанныеДерево = РеквизитФормыВЗначение("Данные");

	ДанныеДерево.Строки.Очистить();
	
	ВыборкаСправки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСправки.Следующий() Цикл
		СтрокаСправки = ДанныеДерево.Строки.Добавить();
		СтрокаСправки.Документ = ВыборкаСправки.Справка;
		СтрокаСправки.ПредставлениеДокумента = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(СтрокаСправки.Документ);
		
		ВыборкаРасчетныеДокументы = ВыборкаСправки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРасчетныеДокументы.Следующий() Цикл
			СтрокаРасчетныйДокумент = СтрокаСправки.Строки.Добавить();
			СтрокаРасчетныйДокумент.Документ = ВыборкаРасчетныеДокументы.РасчетныйДокумент;
			СтрокаРасчетныйДокумент.ПредставлениеДокумента = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(СтрокаРасчетныйДокумент.Документ);
			СтрокаРасчетныйДокумент.Аванс = ВыборкаРасчетныеДокументы.Аванс;
			СтрокаРасчетныйДокумент.Зачтено = ВыборкаРасчетныеДокументы.Зачтено;
			СтрокаРасчетныйДокумент.НеЗачтено = ВыборкаРасчетныеДокументы.НеЗачтено;
			СтрокаРасчетныйДокумент.ВалютаКонтракта = Параметры.КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КонецЦикла;
	КонецЦикла;
    ЗначениеВРеквизитФормы(ДанныеДерево, "Данные");
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(Элемент.ТекущиеДанные.Документ) = Тип("ДокументСсылка.РЭЙ_СправкаОВалютныхОперациях") Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать расчетный документ.");
		Возврат;
	КонецЕсли;
	
	СтрокаРодитель = Данные.НайтиПоИдентификатору(ВыбраннаяСтрока).ПолучитьРодителя();
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("Справка", СтрокаРодитель.Документ);
	СтруктураВозврата.Вставить("РасчетныйДокумент", Элемент.ТекущиеДанные.Документ);
	СтруктураВозврата.Вставить("Сумма", Элемент.ТекущиеДанные.НеЗачтено);
	
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры
	