#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных


Перем ЭтоНовый; // Показывает, что был записан новый объект.
                // Используются в обработчике события ПриЗаписи.

#КонецОбласти


#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЪЕКТА
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Если Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.ВнешнийAPI") ИЛИ 
			Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.РучнойВвод") ИЛИ 
			Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.WebService") Тогда
		Иначе
			Если ЗначениеЗаполнено(Ссылка) И ПолучитьФункциональнуюОпцию("CRM_ИспользоватьСквознуюАналитику") Тогда
				GUIDЗадания = Ссылка.УникальныйИдентификатор();
				РегламентноеЗадание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Ключ",GUIDЗадания));
				Если НЕ РегламентноеЗадание = Неопределено Тогда
					РегламентноеЗадание[0].Удалить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли ТребуетсяПроверкаЛицензии() Тогда
		
		Если ЭтоНовый И ПолучитьФункциональнуюОпцию("CRM_ИспользоватьСквознуюАналитику") Тогда
			
			CRM_СистемаСквознойАналитикиСервер.CRM_ПолучитьРегЗаданияПоСценариюЛидогенерация(Ссылка,Сценарий,АдресРасписания);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ТребуетсяПроверкаЛицензии()
	
	Если Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.ВнешнийAPI") ИЛИ 
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.РучнойВвод") ИЛИ
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.WebService") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
		ЭтоНовый = ЭтоНовый();

КонецПроцедуры

#КонецОбласти

#КонецЕсли