#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить предопределенные данные
//
// Параметры:
//  ТолькоФлаг	 - Булево	 - Если Истина, то шаблоны перезаполняются.
//
Процедура ЗаполнитьПредопределенныеДанные(ТолькоФлаг = Ложь) Экспорт
	
	//КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ
	
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблона");
	Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблона;
	Принадлежность	= Метаданные.Документы.КоммерческоеПредложениеКлиенту.ПолноеИмя();
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Назначение"		,Назначение);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.УстановитьПараметр("Принадлежность"	,Принадлежность);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.Назначение = &Назначение
		|	И CRM_ШаблоныАвтотекста.Представление = &Представление
		|	И CRM_ШаблоныАвтотекста.Принадлежность = &Принадлежность";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Представление		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.Принадлежность	= Принадлежность;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.Назначение		= Назначение;
				СпрОбъект.Принадлежность	= Принадлежность;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	Макет		= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблонаЗначениеКолонки");
	Назначение	= Перечисления.CRM_НазначенияАвтотекста.ТегШаблонаЗначениеКолонки;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		ИмяТЧ			= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,6).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Назначение"			,Назначение);
		Запрос.УстановитьПараметр("Представление"		,Представление);
		Запрос.УстановитьПараметр("Принадлежность"		,Принадлежность);
		Запрос.УстановитьПараметр("ИмяТабличнойЧасти"	,ИмяТЧ);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.Назначение = &Назначение
		|	И CRM_ШаблоныАвтотекста.Представление = &Представление
		|	И CRM_ШаблоныАвтотекста.ИмяТабличнойЧасти = &ИмяТабличнойЧасти
		|	И CRM_ШаблоныАвтотекста.Принадлежность = &Принадлежность";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Представление		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.Принадлежность	= Принадлежность;
			СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.Назначение		= Назначение;
				СпрОбъект.Принадлежность	= Принадлежность;
				СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// СОБЫТИЕ
	
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("ТегШаблонаСобытие");
	Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблона;
	Принадлежность	= Метаданные.Документы.УдалитьCRM_Событие.ПолноеИмя();
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Назначение"		,Назначение);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.УстановитьПараметр("Принадлежность"	,Принадлежность);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.Назначение = &Назначение
		|	И CRM_ШаблоныАвтотекста.Представление = &Представление
		|	И CRM_ШаблоныАвтотекста.Принадлежность = &Принадлежность";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Представление	= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.Принадлежность	= Принадлежность;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.Назначение		= Назначение;
				СпрОбъект.Принадлежность	= Принадлежность;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	Макет = Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("ТегШаблонаСобытиеЗначениеКолонки");
	Назначение	= Перечисления.CRM_НазначенияАвтотекста.ТегШаблонаЗначениеКолонки;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		ИмяТЧ			= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,6).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Назначение"			,Назначение);
		Запрос.УстановитьПараметр("Представление"		,Представление);
		Запрос.УстановитьПараметр("Принадлежность"		,Принадлежность);
		Запрос.УстановитьПараметр("ИмяТабличнойЧасти"	,ИмяТЧ);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.Назначение = &Назначение
		|	И CRM_ШаблоныАвтотекста.Представление = &Представление
		|	И CRM_ШаблоныАвтотекста.ИмяТабличнойЧасти = &ИмяТабличнойЧасти
		|	И CRM_ШаблоныАвтотекста.Принадлежность = &Принадлежность";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Представление		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.Принадлежность	= Принадлежность;
			СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.Назначение		= Назначение;
				СпрОбъект.Принадлежность	= Принадлежность;
				СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// АВТОТЕКСТ СМС
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстСМС");
	Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстСМССообщение;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Назначение"		,Назначение);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.Назначение = &Назначение
		|	И CRM_ШаблоныАвтотекста.Представление = &Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Представление		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.Назначение		= Назначение;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// АВТОТЕКСТ ЭЛЕКТРОННОЕ ПИСЬМО
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьма");
	Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстЭлектронноеПисьмо;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		ПредставлениеLAT= СокрЛП(Макет.Область(НомерСтроки,6).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Назначение"		,Назначение);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.Назначение = &Назначение
		|	И CRM_ШаблоныАвтотекста.Представление = &Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Представление		= Представление;
			СпрОбъект.ПредставлениеLAT	= ПредставлениеLAT;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СпрОбъект.ПредставлениеLAT) Тогда
					СпрОбъект.ПредставлениеLAT	= ПредставлениеLAT;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.Назначение		= Назначение;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// АВТОТЕКСТ АНКЕТИРОВАНИЕ
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьмаАнкетирование");
	Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстЭлектронноеПисьмо;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Назначение"		,Назначение);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.Назначение = &Назначение
		|	И CRM_ШаблоныАвтотекста.Представление = &Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Представление		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.Назначение		= Назначение;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// АВТОТЕКСТ ЗАДАЧИ
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЗадачи");
	Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстЗадачаИсполнителя;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Назначение"		,Назначение);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.Назначение = &Назначение
		|	И CRM_ШаблоныАвтотекста.Представление = &Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Представление		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.Назначение		= Назначение;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//
//
Процедура ПолучитьМакетЗаполнитьЗначения(РодительЭлемента, ЭлементСправочника = Неопределено)
	
	Если РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстСМС Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстСМС");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстСМССообщение;
		Принадлежность	= Неопределено;
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстЭлектронногоПисьма Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьма");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстЭлектронноеПисьмо;
		Принадлежность	= Неопределено;
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.КоммерческоеПредложение Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблона");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблона;
		Принадлежность	= Метаданные.Документы.КоммерческоеПредложениеКлиенту.ПолноеИмя();
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.КоммерческоеПредложениеЗначениеКолонок Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблонаЗначениеКолонки");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблонаЗначениеКолонки;
		Принадлежность	= Метаданные.Документы.КоммерческоеПредложениеКлиенту.ПолноеИмя();
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.Событие Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("ТегШаблонаСобытие");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблона;
		Принадлежность	= Метаданные.Документы.УдалитьCRM_Событие.ПолноеИмя();
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.СобытиеЗначениеКолонок Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("ТегШаблонаСобытиеЗначениеКолонки");
		Назначение	= Перечисления.CRM_НазначенияАвтотекста.ТегШаблонаЗначениеКолонки;
		Принадлежность	= Метаданные.Документы.УдалитьCRM_Событие.ПолноеИмя();
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.Анкетирование Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьмаАнкетирование");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстЭлектронноеПисьмо;
		Принадлежность	= Неопределено;
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстЗадачи Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЗадачи");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстЗадачаИсполнителя;
		Принадлежность	= Неопределено;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Если Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблонаЗначениеКолонки Тогда
			Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
			Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
			ИмяТЧ			= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
			Действие		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
			Родитель		= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		Иначе
			
			Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
			Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
			ИмяТЧ			= Неопределено;
			Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
			Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
			
		КонецЕсли;
		
		Если (НЕ ЭлементСправочника = Неопределено) И (НЕ ЭлементСправочника.Представление = Представление) Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Назначение"			,Назначение);
		Запрос.УстановитьПараметр("Представление"		,Представление);
		Запрос.УстановитьПараметр("Принадлежность"		,Принадлежность);
		Запрос.УстановитьПараметр("ИмяТабличнойЧасти"	,ИмяТЧ);
		Запрос.УстановитьПараметр("Родитель"			,РодительЭлемента);
		ТекстЗапроса = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.Назначение = &Назначение
		|	И CRM_ШаблоныАвтотекста.Представление = &Представление
		|	И CRM_ШаблоныАвтотекста.ИзМакета";
		Если НЕ ИмяТЧ = Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И CRM_ШаблоныАвтотекста.ИмяТабличнойЧасти = &ИмяТабличнойЧасти";
		КонецЕсли;
		Если НЕ Принадлежность = Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И CRM_ШаблоныАвтотекста.Принадлежность = &Принадлежность";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	И CRM_ШаблоныАвтотекста.Родитель = &Родитель";
		
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Представление		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.ИзМакета			= Истина;
			Если НЕ Принадлежность = Неопределено Тогда
				СпрОбъект.Принадлежность	= Принадлежность;
			Иначе
				СпрОбъект.Принадлежность	= "";
			КонецЕсли;
			Если НЕ ИмяТЧ = Неопределено Тогда
				СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
			Иначе
				СпрОбъект.ИмяТабличнойЧасти	= "";
			КонецЕсли;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.Назначение		= Назначение;
			СпрОбъект.ИзМакета			= Истина;
			Если НЕ Принадлежность = Неопределено Тогда
				СпрОбъект.Принадлежность	= Принадлежность;
			Иначе
				СпрОбъект.Принадлежность	= "";
			КонецЕсли;
			Если НЕ ИмяТЧ = Неопределено Тогда
				СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
			Иначе
				СпрОбъект.ИмяТабличнойЧасти	= "";
			КонецЕсли;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМакетСформироватьСтруктуруЗначений(РодительЭлемента, ЭлементСправочника)
	
	Если РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстСМС Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстСМС");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстСМССообщение;
		Принадлежность	= Неопределено;
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстЭлектронногоПисьма Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьма");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстЭлектронноеПисьмо;
		Принадлежность	= Неопределено;
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.КоммерческоеПредложение Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("ТегШаблона");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблона;
		Принадлежность	= Метаданные.Документы.КоммерческоеПредложениеКлиенту.ПолноеИмя();
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.КоммерческоеПредложениеЗначениеКолонок Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("ТегШаблонаЗначениеКолонки");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблонаЗначениеКолонки;
		Принадлежность	= Метаданные.Документы.КоммерческоеПредложениеКлиенту.ПолноеИмя();
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.Событие Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("ТегШаблонаСобытие");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблона;
		Принадлежность	= Метаданные.Документы.УдалитьCRM_Событие.ПолноеИмя();
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.СобытиеЗначениеКолонок Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("ТегШаблонаСобытиеЗначениеКолонки");
		Назначение	= Перечисления.CRM_НазначенияАвтотекста.ТегШаблонаЗначениеКолонки;
		Принадлежность	= Метаданные.Документы.УдалитьCRM_Событие.ПолноеИмя();
	
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.Анкетирование Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьмаАнкетирование");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстЭлектронноеПисьмо;
		Принадлежность	= Неопределено;
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстЗадачи Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЗадачи");
		Назначение		= Перечисления.CRM_НазначенияАвтотекста.АвтотекстЗадачаИсполнителя;
		Принадлежность	= Неопределено;
		
	КонецЕсли;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Если Назначение		= Перечисления.CRM_НазначенияАвтотекста.ТегШаблонаЗначениеКолонки Тогда
			Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
			Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
			ИмяТЧ			= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
			Действие		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
			Родитель		= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		Иначе
			Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
			Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
			ИмяТЧ			= Неопределено;
			Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
			Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		КонецЕсли;
		
		Если (НЕ ЭлементСправочника = Неопределено) И (НЕ ЭлементСправочника.Представление = Представление) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураЗначений = Новый Структура;
		СтруктураЗначений.Вставить("Действие",Действие);
		СтруктураЗначений.Вставить("Наименование",Наименование);
		
		Возврат СтруктураЗначений;
	КонецЦикла;
	
КонецФункции

// Процедура - Восстановить значение из макета
//
// Параметры:
//  МассивСтрок	 - Массив - Массив элементов сравочника для заполнения предопределенных элементов.
//
Процедура ВосстановитьЗначениеИзМакета(МассивСтрок) Экспорт
	
	Для Каждого ЭлементСправочника Из МассивСтрок Цикл
		
		Если ЭлементСправочника.Предопределенный Тогда
			ПолучитьМакетЗаполнитьЗначения(ЭлементСправочника);
		ИначеЕсли ЭлементСправочника.Родитель.Предопределенный Тогда
			ПолучитьМакетЗаполнитьЗначения(ЭлементСправочника.Родитель, ЭлементСправочника);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Получить значение из макета
//
// Параметры:
//  ЭлементСправочника	 - Справочник	 - Справочник, для которого нобходимо получить структуру действий.
// 
// Возвращаемое значение:
//  Структура - Структура строк.
//  Действие - Строка - Фрагмент исполняющего кода.
//  Нименование - Строка - Наименование команду.
//
Функция ПолучитьЗначениеИзМакета(ЭлементСправочника) Экспорт
	
	Возврат ПолучитьМакетСформироватьСтруктуруЗначений(ЭлементСправочника.Родитель, ЭлементСправочника);
	
КонецФункции

// Процедура - Удалить устаревшие элементы
//  Помечает на удаление устаревшие шаблоны автотекста.
//
Процедура УдалитьУстаревшиеЭлементы() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ШаблоныАвтотекста.Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
	                      |ГДЕ
	                      |	(CRM_ШаблоныАвтотекста.Представление ПОДОБНО ""%БУХФОН%""
	                      |			ИЛИ CRM_ШаблоныАвтотекста.Представление В (&Представления)
	                      |				И CRM_ШаблоныАвтотекста.Принадлежность = &Принадлежность)");
		
	Запрос.УстановитьПараметр("Принадлежность", Метаданные.Документы.КоммерческоеПредложениеКлиенту.ПолноеИмя());
	Представления = Новый Массив;
	Представления.Добавить("EmailОтвественного");
	Представления.Добавить("ТелефонОтвественного");
	Запрос.УстановитьПараметр("Представления", Представления);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли