
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока)
		И (ЗначениеЗаполнено(Параметры.ТекущаяСтрока.ДокументЗакрытияПС) Или Параметры.ТекущаяСтрока.НеПечататьНомерИДатуПС) Тогда
		ОтборПоСостояниюДокумента = "Все";
	Иначе
		ОтборПоСостояниюДокумента = "Действующие";
	КонецЕсли;
	ОтборПоСостояниюДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСостояниюДокументаПриИзменении(Элемент)
	ОтборПоСостояниюДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПоСостояниюДокументаПриИзмененииНаСервере()
	Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = ОтборПоСостояниюДокумента Тогда
			ЭлементОтбора.Использование = Истина;
		Иначе
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
