
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Параметры.Отбор.Владелец, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьОбменСMSExchange") Тогда
		УчетнаяЗаписьMSExchange = Неопределено;
		Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
			CRM_Владелец = Параметры.Отбор.Владелец;
			УчетнаяЗаписьMSExchange = CRM_MSExchangeВызовСервера.ПолучитьУчетнуюЗаписьMSExchangeПоУчетнойЗаписиЭлектроннойПочты(CRM_Владелец);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(CRM_Владелец) Или Не ЗначениеЗаполнено(УчетнаяЗаписьMSExchange) Или Не ПравоДоступа("Добавление", Метаданные.Справочники.ПапкиЭлектронныхПисем) Тогда
			Элементы.СписокДобавитьПапкиMSExchange.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДобавитьПапкиMSExchange(Команда)
	Если Не ЗначениеЗаполнено(CRM_Владелец) Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьMSExchange = CRM_MSExchangeВызовСервера.ПолучитьУчетнуюЗаписьMSExchangeПоУчетнойЗаписиЭлектроннойПочты(CRM_Владелец);
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьMSExchange) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для учетной записи электронной почты '") + """" + Строка(CRM_Владелец) + """" + Символы.ПС
			+ НСтр("ru='не найдена соответствующая учетная запись MS Exchange!';en='the appropriate login account of MS Exchange is not found!'"));
		//
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПапкиMSExchangeЗавершение", ЭтотОбъект, УчетнаяЗаписьMSExchange);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Текущая структура папок будет дополнена папками из MS Exchange.
	|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПапкиMSExchangeЗавершение(Ответ, УчетнаяЗаписьMSExchange) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СтрОшибка = ДобавитьПапкиMSExchangeНаСервере(УчетнаяЗаписьMSExchange);
		Если ТипЗнч(СтрОшибка) = Тип("Строка") И ЗначениеЗаполнено(СтрОшибка)  Тогда
			ПоказатьПредупреждение(, СтрОшибка);
		КонецЕсли;
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДобавитьПапкиMSExchangeНаСервере(УчетнаяЗаписьMSExchange)
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьMSExchange) Тогда
		Возврат НСтр("ru='Не указана учетная запись MS Exchange!';en='Login account of MS Exchange are not specif!'");
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|	СтруктурыПапокMSExchange.Ссылка
	|ИЗ
	|	Справочник.CRM_СтруктурыПапокMSExchange КАК СтруктурыПапокMSExchange
	|ГДЕ
	|	СтруктурыПапокMSExchange.СерверMSExchange = &СерверMSExchange
	|	И СтруктурыПапокMSExchange.УчетнаяЗапись = &УчетнаяЗапись
	|");
	Запрос.УстановитьПараметр("СерверMSExchange", УчетнаяЗаписьMSExchange.СерверMSExchange);
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗаписьMSExchange);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат НСтр("ru = 'Для учетной записи электронной почты '") + """" + Строка(CRM_Владелец) + """ "
			+ Символы.ПС + НСтр("ru='структура папок MS Exchange еще не была загружена с сервера!';en='the structure of folders of MS Exchange were not load yet from server!'");
		//
	КонецЕсли;
	
	Справочники.CRM_СтруктурыПапокMSExchange.ДобавитьПапкиMSExchangeВСправочникПапкиЭлектронныхПисем(CRM_Владелец, УчетнаяЗаписьMSExchange, УчетнаяЗаписьMSExchange.СерверMSExchange);
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

