
#Область ОписаниеПеременных
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НовыйЗвонок") Тогда	
		Звонок = Параметры.НовыйЗвонок;
	КонецЕсли;
	
	Если Параметры.Свойство("Контакт") Тогда
		Контакт = Параметры.Контакт;
	КонецЕсли;
	
	ПредставлениеКонтакта = Звонок.АбонентПредставление;

	Элементы.ПредставлениеКонтакта.ТолькоПросмотр = ЗначениеЗаполнено(Контакт);
	
	Если Параметры.Свойство("НомерТелефона") Тогда
		НомерТелефона = Параметры.НомерТелефона;
	КонецЕсли;

	ЭтаФорма.Заголовок = Звонок;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ЗначениеЗаполнено(Звонок) Тогда
		Если Модифицированность Тогда
			ЗаписатьИзменения();
		КонецЕсли;	
	КонецЕсли;
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТелефонныйЗвонок(Команда)
	
	Если ЗначениеЗаполнено(Звонок) Тогда
		Если Модифицированность Тогда
			ЗаписатьИзменения();
		КонецЕсли;	
		
		ПараметрыФормы = Новый Структура("Ключ", Звонок);
		ОткрытьФорму("Документ.ТелефонныйЗвонок.Форма.сфпФормаДокумента", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьИзменения()
	
	Если ЗначениеЗаполнено(Звонок) Тогда
		ТекОбъект = Звонок.ПолучитьОбъект();
		
		ЗаписатьОбъект = Ложь;
		
		Если НЕ Элементы.ПредставлениеКонтакта.ТолькоПросмотр И ЗначениеЗаполнено(ПредставлениеКонтакта) Тогда
			Если ТекОбъект.АбонентПредставление <> ПредставлениеКонтакта Тогда
				ТекОбъект.АбонентПредставление = ПредставлениеКонтакта;
				ЗаписатьОбъект = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Комментарий) Тогда
			Если ТекОбъект.Комментарий <> Комментарий Тогда
				ТекОбъект.Комментарий = Комментарий;
				ЗаписатьОбъект = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаписатьОбъект Тогда
			ТекОбъект.Записать();
		КонецЕсли;
	КонецЕсли;

	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеКонтактаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Инициализация
#КонецОбласти