
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.АГ_ПлановыйКоэффициентЗапасов.Записывать = Истина;
	Движения.АГ_ПлановыйКоэффициентЗапасов.Очистить();
	Для Каждого ТекСтрокаКоэффициентыЗапасов Из КоэффициентыЗапасов Цикл
		Движение = Движения.АГ_ПлановыйКоэффициентЗапасов.Добавить();
		Движение.ТипДокумента = ТипДокумента;
		Движение.Склад = Склад;
		Движение.СводнаяНоменклатурнаяГруппа = ТекСтрокаКоэффициентыЗапасов.СводнаяНоменклатурнаяГруппа;
		Движение.Месяц = ТекСтрокаКоэффициентыЗапасов.Месяц;
		Движение.ЗначениеКоэффициента = ТекСтрокаКоэффициентыЗапасов.ЗначениеКоэффициента;
		Движение.ПериодДействия = ПериодДействия;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыПоУмолчанию();
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоУмолчанию()
	
	ТипДокумента = Перечисления.АГ_ТипыДокументаПлановыйКоэффициентЗапасов.Базовый;
	
КонецПроцедуры
	
#КонецОбласти