#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

Процедура СоздатьЭлементыПоУмолчанию() Экспорт
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Не удается связаться'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Не одобрило руководство'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Выбрал конкурента'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Нужна была только консультация'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Не устроила цена'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Не устроило качество обслуживания'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Не устроило качество продукции'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Нецелевой клиент'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Нет денег'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Спам'");
	НовыйЭлемент.Записать();
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли