#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

// Процедура заполнения шаблона для анкетирования при первом старте и обновлении.
//
Процедура CRM_ЗаполнитьШаблонДляАнкетирования() Экспорт
	
	ШаблонРассылкиДляАнкетированияОбъект = Справочники.CRM_ШаблоныРассылки.ШаблонДляАнкетирования.ПолучитьОбъект();
	
	ТекстШаблона = "%УВАЖАЕМЫЙ/УВАЖАЕМАЯ% %ПОЛУЧАТЕЛЬ_ИМЯ_ОТЧЕСТВО%" + "!" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "Предлагаем Вам принять участие в анкетировании, проводимом компанией ""<НАИМЕНОВАНИЕ ОРГАНИЗАЦИИ>"""+ Символы.ПС;
	ТекстШаблона = ТекстШаблона + "Ваше мнение очень важно для нас!" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "Для начала анкетирования Вам необходимо перейти по указанной ниже ссылке и зайти в Личный кабинет." + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "%АДРЕС_WEB_ДОСТУПА%" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "Для входа в Личный кабинет Вам необходимо будет ввести имя пользователя и пароль, указанные ниже:" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "%ИМЯ_РЕСПОНДЕНТА%" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "%ПАРОЛЬ_РЕСПОНДЕНТА%" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "P.S. В случае, если в Вашем web-браузере будут выдаваться сообщения о блокировке "
				  + "активных элементов при входе в Личный кабинет, Вам необходимо добавить в список "
				  + "надежных адресов указанную выше ссылку и перезапустить web-браузер." + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	
	ТекстШаблонаHTML = CRM_ОбщегоНазначенияКлиентСервер.ПреобразоватьТекстВHTML(ТекстШаблона);
	
	ШаблонРассылкиДляАнкетированияОбъект.Текст = ТекстШаблонаHTML;
	
	ШаблонРассылкиДляАнкетированияОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли