
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ CRM_ЛицензированиеСервер.ПодсистемаCRMИспользуется() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно открыть форму настройки. Подсистема 1С:CRM не используется! (см. Персональные настройки пользователя)';en='Unable to open the configuration form. Subsystem 1C: CRM is not used! (see Personal settings of the user)'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().Обработка_CRM_ОбменСMSExchange_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	
	// Устанавливаем доступность кнопку "Выполнить обмен".
	Элементы.ФормаВыполнитьОбмен.Видимость = Пользователи.РолиДоступны("CRM_ОбменСMSOutlook_MSExchange, ПолныеПрава");
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		// Устанавливаем отбор по текущему пользователю.
		СписокУчетныхЗаписей = Новый СписокЗначений;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Пользователь", CRM_ОбщегоНазначенияСервер.ТекущийПользователь());
		Запрос.Текст = "ВЫБРАТЬ
		               |	CRM_УчетныеЗаписиПользователейMSExchange.Ссылка
		               |ИЗ
		               |	Справочник.CRM_УчетныеЗаписиПользователейMSExchange КАК CRM_УчетныеЗаписиПользователейMSExchange
		               |ГДЕ
		               |	НЕ CRM_УчетныеЗаписиПользователейMSExchange.ПометкаУдаления
		               |	И CRM_УчетныеЗаписиПользователейMSExchange.Пользователь = &Пользователь";
		СписокУчетныхЗаписей.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		ОтборПоПользователю						= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоПользователю.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("УчетнаяЗапись");
		ОтборПоПользователю.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборПоПользователю.ПравоеЗначение		= СписокУчетныхЗаписей;
		ОтборПоПользователю.Использование		= Истина;
		ОтборПоПользователю.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;	
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда Возврат; КонецЕсли;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОбменЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Обмен данными может занять продолжительное время.
	|Рекомендуется настроить регламентное задание для обмена данными в настройках системы.
	|
	|Выполнить обмен вручную?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда

		ТекСтрока = Элементы.Список.ТекущаяСтрока;
		ОчиститьСообщения();
		
		Состояние(НСтр("ru='Выполняется подключение к серверу...';en='Connection to serverу are fulfill...'"));
		СтруктураРезультат = ПроверитьПодключениеНаСервере(ТекСтрока);
		
		Если Не СтруктураРезультат.Успешно Тогда
			ПоказатьПредупреждение(, СтруктураРезультат.СообщениеОшибки);
			Возврат;
		КонецЕсли;
		
		Состояние(НСтр("ru='Выполняется обмен данными...';en='The data interchange are fulfill...'"));
		ВыполнитьОбменНаСервере(ТекСтрока);
		Состояние(НСтр("ru='Обмен данными завершен.';en='The data interchange is completed.'"));
		
		Элементы.Список.Обновить();
		СписокПриАктивизацииСтроки(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбновитьИнформацию(ТекДанные)
	Если ТекДанные = Неопределено Тогда
		Элементы.ДекорацияДатаПоследнегоОбменаКонтактов.Заголовок			= "";
		Элементы.ДекорацияДатаПоследнегоОбменаСобытий.Заголовок				= "";
		Элементы.ДекорацияДатаПоследнегоОбменаПочтовыхСообщений.Заголовок	= "";
	Иначе
		Элементы.ДекорацияДатаПоследнегоОбменаКонтактов.Заголовок = НСтр("ru = 'Дата последнего обмена контактами: '") + Формат(Макс(ТекДанные.ДатаПоследнегоОбменаКонтактов1СMSExchange, ТекДанные.ДатаПоследнегоОбменаКонтактовMSExchange1С), "ДФ='dd.MM.yyyy ЧЧ:мм'");
		Элементы.ДекорацияДатаПоследнегоОбменаСобытий.Заголовок = НСтр("ru = 'Дата последнего обмена событиями: '") + Формат(Макс(ТекДанные.ДатаПоследнегоОбменаСобытий1СMSExchange, ТекДанные.ДатаПоследнегоОбменаСобытийMSExchange1С), "ДФ='dd.MM.yyyy ЧЧ:мм'");
		
		Элементы.ДекорацияДатаПоследнегоОбменаПочтовыхСообщений.Заголовок = НСтр("ru = 'Дата последнего обмена почтовыми сообщениями: '") +
				Формат(Макс(	ТекДанные.ДатаПоследнегоОбменаПочтовыхСообщенийВходящие1СMSExchange,
								ТекДанные.ДатаПоследнегоОбменаПочтовыхСообщенийВходящиеMSExchange1С,
								ТекДанные.ДатаПоследнегоОбменаПочтовыхСообщенийОтправленные1СMSExchange,
								ТекДанные.ДатаПоследнегоОбменаПочтовыхСообщенийОтправленныеMSExchange1С), "ДФ='dd.MM.yyyy ЧЧ:мм'");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьИнформацию();
	ТекДанные = Элементы.Список.ТекущиеДанные;
	ОбновитьИнформацию(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.ГруппаИнформация.Видимость Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИнформацию", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ВыполнитьОбменНаСервере(Настройка)
	СтрокаОшибки = "";
	CRM_MSExchangeВызовСервера.СинхронизироватьПоНастройке(Настройка, СтрокаОшибки);
	Если ЗначениеЗаполнено(СтрокаОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьПодключениеНаСервере(Настройка)
	СтруктураПодключения = CRM_MSExchangeСерверЭкспортныеМетоды.СформироватьСтруктуруПодключения(Настройка);
	Возврат CRM_MSExchangeСерверЭкспортныеМетоды.ПроверитьПодключение(СтруктураПодключения);
КонецФункции

#КонецОбласти 
