
#Область ИсточникиПервичногоИнтереса

Процедура CRM_УТ_ИсточникиПервичногоИнтересаПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ИсточникиПервичногоИнтереса") Тогда
		
		Если НЕ ЗначениеЗаполнено(Источник.Отбор.Период.Значение) Тогда
			ТекущаяДата = ТекущаяДата();
			Источник.Отбор.Период.Установить(ТекущаяДата);
			Для каждого Запись из Источник Цикл
				Запись.Период = ТекущаяДата;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ИсточникиПервичногоИнтереса


#Область МеханизмыОбновления

Процедура УстановитьМинимальноДопустимуюВерсию(МинимальноДопустимаяВерсия) Экспорт
	
	Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("ОбщиеМодули", "CRM_УТ_ОбновлениеИнформационнойБазы") Тогда
		МинимальноДопустимаяВерсия = "2.0.19"; // для УТиВсК3
	КонецЕсли;
	
КонецПроцедуры // УстановитьМинимальноДопустимуюВерсию

#КонецОбласти // МеханизмыОбновления
