
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборыПриИзменении()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, 
	"ШаблонПроекта", 
	ОтборШаблонПроекта, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	ЗначениеЗаполнено(ОтборШаблонПроекта));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, 
	"ШаблонЭтапаПроекта", 
	ОтборШаблонЭтапа, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	ЗначениеЗаполнено(ОтборШаблонЭтапа));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборШаблонПроектаПриИзменении(Элемент)
	ОбновитьОтборыПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОтборШаблонПакетаПриИзменении(Элемент)
	ОбновитьОтборыПриИзменении();
КонецПроцедуры
