
////////////////////////////////////////////////////////////////////////////////
// Сфп софт фон про глобальный
//  
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныеПроцедурыИФункции

Процедура сфпПодключитьОбработчикНовыхСообщенийСистемыВзаимодействия() Экспорт
	
	СлужебныйЖурналЗвонков = сфпСофтФонПроСервер.СоздатьОбсуждениеЖурналЗвонков();
	Если СлужебныйЖурналЗвонков <> Неопределено Тогда	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСообщенияОбсуждениеЖурналЗвонков", сфпСофтФонПроКлиент);
		СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(, СлужебныйЖурналЗвонков, ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
