
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("Принадлежность") Тогда
		Если ТипЗнч(Параметры.Принадлежность.ИмяТаблиц) = Тип("Строка") Тогда
			СписокИменТаблиц = Новый СписокЗначений;
			СписокИменТаблиц.Добавить(Параметры.Принадлежность.ИмяТаблиц);
			
		Иначе
			СписокИменТаблиц = Параметры.Принадлежность.ИмяТаблиц;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияКлассификаторовСписок, 
			"Владелец.Принадлежность.ИмяТаблицы", 
			СписокИменТаблиц,
			ВидСравненияКомпоновкиДанных.ВСписке
		);
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов("СправочникСсылка.CRM_ЗначенияКлассификаторов");
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаИзменениеПорядка;
	ПараметрыРазмещения.ПрефиксГрупп = "ЗначенияКлассификаторов";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.CRM_Классификаторы");
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаИзменениеПорядкаКлассификаторов;
	ПараметрыРазмещения.ПрефиксГрупп = "Классификаторы";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьДоступностьКомандПорядка(Элементы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлассификаторыСписок

&НаКлиенте
Процедура КлассификаторыСписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьСодержимоеФормыПриАктивизацииКлассификатора();
	
	УстановитьДоступностьКомандПорядка(Элементы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначенияКлассификаторовСписок

&НаКлиенте
Процедура ЗначенияКлассификаторовСписокПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьКомандПорядка(Элементы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Функция НайтиПолеОтбора(Элементы, ИмяОтбора)
	
	ИскомоеПоле = Неопределено;
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	
	Для каждого ОтборПоле из Элементы Цикл
		
		Если ТипЗнч(ОтборПоле) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") тогда
			ИскомоеПоле = НайтиПолеОтбора(ОтборПоле.Элементы, ИмяОтбора);
		Иначе
			Если ОтборПоле.Использование и ОтборПоле.ЛевоеЗначение = ПолеОтбора тогда
				
				ИскомоеПоле = ОтборПоле;
				
				Прервать;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИскомоеПоле;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриАктивизацииКлассификатора()
	
	Если ТипЗнч(Элементы.КлассификаторыСписок.ТекущаяСтрока) = Тип("ПланВидовХарактеристикСсылка.CRM_Классификаторы") Тогда
		ТекущийКлассификатор = Элементы.КлассификаторыСписок.ТекущаяСтрока;
	Иначе
		ТекущийКлассификатор = Неопределено;
	КонецЕсли;
	
	ИскомоеПолеОтбора = НайтиПолеОтбора(ПолучитьОтборДинамическогоСписка(ЗначенияКлассификаторовСписок).Элементы, "Владелец");
	
	Если ИскомоеПолеОтбора = Неопределено Тогда
		ОтборПоЦели = ПолучитьОтборДинамическогоСписка(ЗначенияКлассификаторовСписок).Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоЦели.Использование = Истина;
		ОтборПоЦели.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ОтборПоЦели.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоЦели.ПравоеЗначение = ТекущийКлассификатор;
		ОтборПоЦели.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	Иначе
		ИскомоеПолеОтбора.Использование = Истина;
		ИскомоеПолеОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ИскомоеПолеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ИскомоеПолеОтбора.ПравоеЗначение = ТекущийКлассификатор;
		ИскомоеПолеОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьДоступностьКомандПорядка(Элементы)
	

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция ПолучитьОтборДинамическогоСписка(Список)
	
	Возврат Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	
КонецФункции

#Область ПроцедурыПодсистемыНастройкаПорядкаЭлементов

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Если СтрНачинаетсяС(Команда.Имя, "ЗначенияКлассификаторов") Тогда
    	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.ЗначенияКлассификаторовСписок);
	Иначе
		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.КлассификаторыСписок);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	Если СтрНачинаетсяС(Контекст.ИмяКомандыВФорме, "ЗначенияКлассификаторов") Тогда
		ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.ЗначенияКлассификаторовСписок, Результат);
	Иначе
		ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.КлассификаторыСписок, Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ЗначенияКлассификаторовСписок);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

