#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
	ТекДата = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	Для н = 0 По Количество() - 1 Цикл
		Строка = Получить(н);
		Если Не ЗначениеЗаполнено(Строка.ДатаПоследнейМодификации) Тогда
			Строка.ДатаПоследнейМодификации = ТекДата;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли