#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксацияОбъектовСобытия.ПроверитьНомерДокументаПоДатеИОрганизации(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ЗаполнитьПунктИнструкцииЦБР();
	
	Если Дата >= Дата(2018,03,01) Тогда
		Если ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_6_1_СнятиеСУчетаКонтракта Тогда
			Если ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_3 
				Или ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_4 Тогда 
				
				ПаспортаСделок.Очистить();
				НоваяСтрока = ПаспортаСделок.Добавить();
				НоваяСтрока.ПаспортСделки = КонтрактВЭД.ПаспортСделки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
				 
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если Константы.РЭЙ_ИспользоватьПрефиксыВНумерацииДокументовВЭД.Получить() Тогда		
		ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ЗаполнитьРеквизитыЗакрытияПаспортаСделки(Истина);
	ЗаполнитьРеквизитыПереводВДругойБанк(Истина);
	ЗаполнитьРеквизитыПереоформленияПаспортаСделки(Истина);
	
	Если ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ПереоформлениеПаспортаСделки Тогда
		ИзменилиСтатус = Ложь;
		Для Каждого СтрокаТЧ Из ПаспортаСделок Цикл
			СтатусЗадачи =  РЭЙ_ЗадачиСервер.ПолучитьСтатусЗадачиЗадачи(СтрокаТЧ.ПаспортСделки);
			
			Если СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСозданию 
				ИЛИ СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеЗавтра
				ИЛИ СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеПослеЗавтра
				ИЛИ СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеСегодня
				ИЛИ СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПросрочена
				Тогда
				
				РЭЙ_ЗадачиСервер.УстановитьСтатусЗадачиВЭД(СтрокаТЧ.ПаспортСделки, "Создана");	
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЗаполнитьРеквизитыЗакрытияПаспортаСделки(Ложь);
	ЗаполнитьРеквизитыПереводВДругойБанк(Ложь);
	ЗаполнитьРеквизитыПереоформленияПаспортаСделки(Ложь);
	
	Если ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ПереоформлениеПаспортаСделки Тогда
		Для Каждого СтрокаТЧ Из ПаспортаСделок Цикл
			РЭЙ_ЗадачиСервер.УстановитьСтатусЗадачиВЭД(СтрокаТЧ.ПаспортСделки, "ПодлежитСозданию")
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Печать

#Область ПечатьАктуальнаяВерсия

Функция Печать2018_ЗаявлениеНаПредоставлениеВБК() Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявление2018_НаПредоставлениеВБК";
	
	Макет = ПолучитьМакет("Заявление2018_НаПредоставлениеВБК");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеНаПредоставлениеВБК.Номер,
	|	ЗаявлениеНаПредоставлениеВБК.Банк.Наименование КАК Банк,
	|	ЗаявлениеНаПредоставлениеВБК.Организация,
	|	ЗаявлениеНаПредоставлениеВБК.Дата,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЗаявлениеНаПредоставлениеВБК.Организация.НаименованиеПолное, 1, 1) = """"
	|			ТОГДА ЗаявлениеНаПредоставлениеВБК.Организация.Наименование
	|		ИНАЧЕ ЗаявлениеНаПредоставлениеВБК.Организация.НаименованиеПолное
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ЗаявлениеНаПредоставлениеВБК.Организация.ИНН КАК ИНН,
	|	ЗаявлениеНаПредоставлениеВБК.Организация.КПП КАК КПП,
	|	ЗаявлениеНаПредоставлениеВБК.Организация.ОГРН КАК ОГРН,
	|	ЗаявлениеНаПредоставлениеВБК.Организация.РЭЙ_ДатаВнесенияВГосРеестр КАК ДатаРегистрации,
	|	ЗаявлениеНаПредоставлениеВБК.ГлавныйБухгалтер,
	|	ЗаявлениеНаПредоставлениеВБК.Руководитель,
	|	ЗаявлениеНаПредоставлениеВБК.УполномоченныйПС,
	|	ЗаявлениеНаПредоставлениеВБК.ТелефонУполномоченногоПС
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС КАК ЗаявлениеНаПредоставлениеВБК
	|ГДЕ
	|	ЗаявлениеНаПредоставлениеВБК.Ссылка = &ТекущийДокумент";
	
	ДанныеДляПечати = Запрос.Выполнить().Выбрать();
	ДанныеДляПечати.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеНаПредоставлениеВБК.ПаспортСделки.НомерПаспортаСделки КАК НомерПаспортаСделки,
	|	ЗаявлениеНаПредоставлениеВБК.ПаспортСделки.Дата КАК ДатаПаспортаСделки,
	|	ЗаявлениеНаПредоставлениеВБК.ПаспортСделки.КонтрактВЭД.КонтрактНомер КАК НомерДоговора,
	|	ЗаявлениеНаПредоставлениеВБК.НомерСтроки КАК НомерСтроки,
	|	ЗаявлениеНаПредоставлениеВБК.ПаспортСделки.КонтрактВЭД КАК КонтрактВЭД
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК ЗаявлениеНаПредоставлениеВБК
	|ГДЕ
	|	ЗаявлениеНаПредоставлениеВБК.Ссылка = &ТекущийДокумент";
	
	ДанныеПаспортовСделки = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка.Параметры.Банк = ДанныеДляПечати.Банк;
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Номер, Истина, Истина);
	
	ДатаДокумента = Формат(ДанныеДляПечати.Дата, "ДФ=ddMMyyyy");
	Для счетчик = 1 По 8 Цикл
		ОбластьШапка.Параметры["ДатаДокумента_"+счетчик] = Сред(ДатаДокумента, счетчик ,1);
	КонецЦикла;
	
	//вывод данных об организации
	ОбластьШапка.Параметры.ОрганизацияНаименование = ДанныеДляПечати.ОрганизацияНаименование;
	//вывод ИНН
	ПечИНН = Лев(СокрЛП(ДанныеДляПечати.ИНН)+"            ",12);
	Для счетчик = 1 По 12 Цикл
		ОбластьШапка.Параметры["ИНН_"+счетчик] = Сред(ПечИНН, счетчик ,1);
	КонецЦикла;
	
	//вывод КПП
	ПечКПП = Лев(СокрЛП(ДанныеДляПечати.КПП)+"            ",9);
	Для счетчик = 1 По 9 Цикл
		ОбластьШапка.Параметры["КПП_"+счетчик] = Сред(ПечКПП, счетчик ,1);
	КонецЦикла;
	
	//вывод ОГРН
	ПечОГРН = ДанныеДляПечати.ОГРН;
	Для счетчик = 1 По 15 Цикл
		ОбластьШапка.Параметры["ОГРН_"+счетчик] = Сред(ПечОГРН, счетчик ,1);
	КонецЦикла;
	
	ПечДатаРегистрации = Формат(ДанныеДляПечати.ДатаРегистрации, "ДФ=dd.MM.yyyy");
	Если ПустаяСтрока(ПечДатаРегистрации) Тогда
		ПечДатаРегистрации = "  .  .    ";
	КонецЕсли;
	Для счетчик = 1 По 10 Цикл
		ОбластьШапка.Параметры["ДатаРегистрации_"+счетчик] = Сред(ПечДатаРегистрации, счетчик ,1);
	КонецЦикла;
	
	ОбластьШапка.Параметры.ОрганизацияПочтовыйАдрес	= ПолучитьФактАдресОрганизации();
	ТабДокумент.Вывести(ОбластьШапка);
	
	Если ДанныеПаспортовСделки.Количество() = 0 Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДокумент.Вывести(ОбластьСтрока);
	Иначе
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Пока ДанныеПаспортовСделки.Следующий() Цикл
			ОбластьСтрока.Параметры.НомерПаспортаСделки = ДанныеПаспортовСделки.НомерПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаПаспортаСделки = ДанныеПаспортовСделки.ДатаПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаКонтракта = РЭЙ_СлужебныйСервер.ПолучитьДатуКонтракта(ДанныеПаспортовСделки.КонтрактВЭД);
			ОбластьСтрока.Параметры.НомерДоговора = СформироватьНомерДоговора(ДанныеПаспортовСделки.НомерДоговора);
			ОбластьСтрока.Параметры.НомерСтроки = ДанныеПаспортовСделки.НомерСтроки;
			
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.ФИОРуководителя = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.Руководитель, ДанныеДляПечати.Дата);
	ОбластьПодвал.Параметры.ФИОБухгалтера   = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.ГлавныйБухгалтер, ДанныеДляПечати.Дата);
	ОбластьПодвал.Параметры.УполномоченныйПС = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.УполномоченныйПС, ДанныеДляПечати.Дата);
	ОбластьПодвал.Параметры.ТелефонУполномоченногоПС = ДанныеДляПечати.ТелефонУполномоченногоПС;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
КонецФункции

Функция Печать2018_ЗаявлениеОСнятииСУчетаКонтрактов() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявление2018_ОСнятииСУчетаКонтрактов";
	
	Макет = ПолучитьМакет("Заявление2018_ОСнятииСУчетаКонтрактов");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеОЗакрытииПС.Номер,
	|	ЗаявлениеОЗакрытииПС.Банк.Наименование КАК Банк,
	|	ЗаявлениеОЗакрытииПС.БанкНовый.Наименование КАК БанкНовый,
	|	ЗаявлениеОЗакрытииПС.ОснованиеЗакрытияПС,
	|	ЗаявлениеОЗакрытииПС.Организация,
	|	ЗаявлениеОЗакрытииПС.Дата,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЗаявлениеОЗакрытииПС.Организация.НаименованиеПолное, 1, 1) = """"
	|			ТОГДА ЗаявлениеОЗакрытииПС.Организация.Наименование
	|		ИНАЧЕ ЗаявлениеОЗакрытииПС.Организация.НаименованиеПолное
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ЗаявлениеОЗакрытииПС.Организация.ИНН КАК ИНН,
	|	ЗаявлениеОЗакрытииПС.Организация.КПП КАК КПП,
	|	ЗаявлениеОЗакрытииПС.Организация.ОГРН КАК ОГРН,
	|	ЗаявлениеОЗакрытииПС.Организация.РЭЙ_ДатаВнесенияВГосРеестр КАК ДатаРегистрации,
	|	ЗаявлениеОЗакрытииПС.ГлавныйБухгалтер,
	|	ЗаявлениеОЗакрытииПС.Руководитель,
	|	ЗаявлениеОЗакрытииПС.УполномоченныйПС,
	|	ЗаявлениеОЗакрытииПС.ТелефонУполномоченногоПС
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС КАК ЗаявлениеОЗакрытииПС
	|ГДЕ
	|	ЗаявлениеОЗакрытииПС.Ссылка = &ТекущийДокумент";
	
	ДанныеДляПечати = Запрос.Выполнить().Выбрать();
	ДанныеДляПечати.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.НомерПаспортаСделки КАК НомерПаспортаСделки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.ДатаПаспортаСделки КАК ДатаПаспортаСделки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.КонтрактВЭД.КонтрактНомер КАК НомерДоговора,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.НомерСтроки КАК НомерСтроки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.КонтрактВЭД КАК КонтрактВЭД
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК РЭЙ_ЗаявлениеВБанкПСПаспортСделки
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.Ссылка = &ТекущийДокумент";
	
	ДанныеПаспортовСделки = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.НомерСтроки,
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.Документ
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ДокументыИныеОснования КАК РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.Ссылка = &ТекущийДокумент";
	
	ДанныеДокументыИныеОснования = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка.Параметры.Банк = ДанныеДляПечати.Банк;	
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Номер, Истина, Истина);
	
	Если ДанныеДляПечати.ОснованиеЗакрытияПС      = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_1 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "переводом контракта (кредитного договора) из банка УК на расчетное обслуживание в другой уполномоченный банк";
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_2 Или ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_2 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "исполнением сторонами всех обязательств по контракту (кредитному договору)";
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_3 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "уступкой резидентом требования по контракту (кредитному договору) другому резиденту либо при переводе долга резидентом на другого резидента";
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_4 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "уступкой резидентом требования по контракту (кредитному договору) нерезиденту либо при переводе долга резидентом на нерезидента";
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_5 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "исполнением (прекращением) обязательств по контракту (кредитному договору) по иным основаниям, не указанным в подпункте 6.1.2 Инструкции от 16.08.2017 №181-И";
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_6 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "прекращением оснований постановки на учет контракта (кредитного договора)";
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_7 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "истечением 90 календарных дней, следующих за указанной в ВБК датой завершения исполнения обязательств по контракту (кредитному договору)";		
	КонецЕсли;
	
	ДатаДокумента = Формат(ДанныеДляПечати.Дата, "ДФ=ddMMyyyy");
	Для счетчик = 1 По 8 Цикл
		ОбластьШапка.Параметры["ДатаДокумента_"+счетчик] = Сред(ДатаДокумента, счетчик ,1);
	КонецЦикла;
	
	//вывод данных об организации
	ОбластьШапка.Параметры.ОрганизацияНаименование = ДанныеДляПечати.ОрганизацияНаименование;
	//вывод ИНН
	ПечИНН = Лев(СокрЛП(ДанныеДляПечати.ИНН)+"            ",12);
	Для счетчик = 1 По 12 Цикл
		ОбластьШапка.Параметры["ИНН_"+счетчик] = Сред(ПечИНН, счетчик ,1);
	КонецЦикла;
	
	//вывод КПП
	ПечКПП = Лев(СокрЛП(ДанныеДляПечати.КПП)+"            ",9);
	Для счетчик = 1 По 9 Цикл
		ОбластьШапка.Параметры["КПП_"+счетчик] = Сред(ПечКПП, счетчик ,1);
	КонецЦикла;
	
	//вывод ОГРН
	ПечОГРН = ДанныеДляПечати.ОГРН;
	Для счетчик = 1 По 15 Цикл
		ОбластьШапка.Параметры["ОГРН_"+счетчик] = Сред(ПечОГРН, счетчик ,1);
	КонецЦикла;
	
	ПечДатаРегистрации = Формат(ДанныеДляПечати.ДатаРегистрации, "ДФ=dd.MM.yyyy");
	Если ПустаяСтрока(ПечДатаРегистрации) Тогда
		ПечДатаРегистрации = "  .  .    ";
	КонецЕсли;
	Для счетчик = 1 По 10 Цикл
		ОбластьШапка.Параметры["ДатаРегистрации_"+счетчик] = Сред(ПечДатаРегистрации, счетчик ,1);
	КонецЦикла;
	
	ОбластьШапка.Параметры.ОрганизацияПочтовыйАдрес	= ПолучитьФактАдресОрганизации();
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	Если ДанныеПаспортовСделки.Количество() = 0 Тогда
		ТабДокумент.Вывести(ОбластьСтрока);
	Иначе
		Пока ДанныеПаспортовСделки.Следующий() Цикл
			ОбластьСтрока.Параметры.НомерПаспортаСделки = ДанныеПаспортовСделки.НомерПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаПаспортаСделки = ДанныеПаспортовСделки.ДатаПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаКонтракта = РЭЙ_СлужебныйСервер.ПолучитьДатуКонтракта(ДанныеПаспортовСделки.КонтрактВЭД);
			ОбластьСтрока.Параметры.НомерДоговора = СформироватьНомерДоговора(ДанныеПаспортовСделки.НомерДоговора);
			ОбластьСтрока.Параметры.НомерСтроки = ДанныеПаспортовСделки.НомерСтроки;
			
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьОснования = Макет.ПолучитьОбласть("Основания");
	ОбластьДокументы = Макет.ПолучитьОбласть("Документы");

	Если ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_1 Тогда
		ОбластьОснования.Параметры.пункт_6_1_1 = "√";		
		ОбластьОснования.Параметры.БанкНовый = ДанныеДляПечати.БанкНовый;
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_2 Тогда
		ОбластьОснования.Параметры.пункт_6_1_2 = "√";		
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_3 Тогда  
		ОбластьОснования.Параметры.пункт_6_1_3 = "√";
		ОбластьОснования.Параметры.РезидентНовый = УступкаТребованияКонтрагент.НаименованиеПолное;
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_4 Тогда
		ОбластьОснования.Параметры.пункт_6_1_4 = "√";		
		ОбластьОснования.Параметры.НерезидентНовый = УступкаТребованияКонтрагент.НаименованиеПолное;
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_5 Тогда
		ОбластьОснования.Параметры.пункт_6_1_5 = "√";		
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_6 Тогда
		ОбластьОснования.Параметры.пункт_6_1_6 = "√";		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьОснования);
	
	Если ДанныеДокументыИныеОснования.Количество() = 0 Тогда
		ТабДокумент.Вывести(ОбластьДокументы);
	Иначе
		Пока ДанныеДокументыИныеОснования.Следующий() Цикл
			ОбластьДокументы.Параметры.НомерСтроки = ДанныеДокументыИныеОснования.НомерСтроки;
			ОбластьДокументы.Параметры.Документ = ДанныеДокументыИныеОснования.Документ;
			ТабДокумент.Вывести(ОбластьДокументы);
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_1_3 Тогда  
		Область = Макет.ПолучитьОбласть("СведенияОНовомРезиденте");
		
		СведенияОНовомРезиденте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(УступкаТребованияКонтрагент, Дата);
		Область.Параметры.Наименование = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОНовомРезиденте, "НаименованиеДляПечатныхФорм,");
		
		АдресаНовогоРезидента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(УступкаТребованияКонтрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, Дата, Ложь);
		Если АдресаНовогоРезидента.Количество() > 0 Тогда
			АдресНовогоРезидента = РаботаСАдресами.АдресВФорматеКЛАДР(АдресаНовогоРезидента[0].ЗначенияПолей);
			Область.Параметры.Регион = АдресНовогоРезидента.Регион;
			Область.Параметры.Район = АдресНовогоРезидента.Район;
			Область.Параметры.Город = АдресНовогоРезидента.Город;
			Область.Параметры.НаселенныйПункт = АдресНовогоРезидента.НаселенныйПункт;
			Область.Параметры.Улица = АдресНовогоРезидента.Улица;
			Область.Параметры.Дом = АдресНовогоРезидента.Дом;
			Область.Параметры.Корпус = АдресНовогоРезидента.Корпус;
			Область.Параметры.Квартира = АдресНовогоРезидента.Квартира;
		КонецЕсли;
		
		//ВывестиЗначениеВКлетки(Область, "ОГРН_", СведенияОНовомРезиденте.ОГРН);
		ВывестиЗначениеВКлетки(Область, "ДатаРегистрации_", Формат(УступкаТребованияКонтрагент.РЭЙ_ДатаВнесенияВГосРеестр, "ДФ=ddMMyyyy"));
		ВывестиЗначениеВКлетки(Область, "ИНН_", СведенияОНовомРезиденте.ИНН);
		ВывестиЗначениеВКлетки(Область, "КПП_", СведенияОНовомРезиденте.КПП);
		
		Если ЗначениеЗаполнено(УступкаТребованияИнойДокументНомер) И ЗначениеЗаполнено(УступкаТребованияИнойДокументДата) Тогда
			Область.Параметры.НомерДокументаУступки = УступкаТребованияИнойДокументНомер;
			ВывестиЗначениеВКлетки(Область, "ДатаДокументаУступки_", Формат(УступкаТребованияИнойДокументДата, "ДФ=ddMMyyyy"));
		Иначе
			Область.Параметры.НомерДокументаУступки = УступкаТребованияДоговор.Номер;
			ВывестиЗначениеВКлетки(Область, "ДатаДокументаУступки_", Формат(УступкаТребованияДоговор.Дата, "ДФ=ddMMyyyy"));
		КонецЕсли;
		ТабДокумент.Вывести(Область);
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.ФИОРуководителя = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.Руководитель, ДанныеДляПечати.Дата);
	Область.Параметры.ФИОБухгалтера   = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.ГлавныйБухгалтер, ДанныеДляПечати.Дата);
	Область.Параметры.УполномоченныйПС = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.УполномоченныйПС, ДанныеДляПечати.Дата);
	Область.Параметры.ТелефонУполномоченногоПС = ДанныеДляПечати.ТелефонУполномоченногоПС;
	ТабДокумент.Вывести(Область);
	
	Возврат ТабДокумент;
КонецФункции

Функция Печать2018_ЗаявлениеОВнесенииИзмененийВРаздел1ВБК() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявление2018_ОВнесенииИзмененийВРаздел1ВБК";
	
	Макет = ПолучитьМакет("Заявление2018_ОВнесенииИзмененийВРаздел1ВБК");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеОПереоформленииПС.Номер,
	|	ЗаявлениеОПереоформленииПС.Банк.Наименование КАК Банк,
	|	ЗаявлениеОПереоформленииПС.ОснованиеПереоформленияПС,
	|	ЗаявлениеОПереоформленииПС.Организация,
	|	ЗаявлениеОПереоформленииПС.Дата,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЗаявлениеОПереоформленииПС.Организация.НаименованиеПолное, 1, 1) = """"
	|			ТОГДА ЗаявлениеОПереоформленииПС.Организация.Наименование
	|		ИНАЧЕ ЗаявлениеОПереоформленииПС.Организация.НаименованиеПолное
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ЗаявлениеОПереоформленииПС.Организация.ИНН КАК ИНН,
	|	ЗаявлениеОПереоформленииПС.Организация.КПП КАК КПП,
	|	ЗаявлениеОПереоформленииПС.Организация.ОГРН КАК ОГРН,
	|	ЗаявлениеОПереоформленииПС.Организация.РЭЙ_ДатаВнесенияВГосРеестр КАК ДатаРегистрации,
	|	ЗаявлениеОПереоформленииПС.ГлавныйБухгалтер,
	|	ЗаявлениеОПереоформленииПС.Руководитель,
	|	ЗаявлениеОПереоформленииПС.УполномоченныйПС,
	|	ЗаявлениеОПереоформленииПС.ТелефонУполномоченногоПС
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС КАК ЗаявлениеОПереоформленииПС
	|ГДЕ
	|	ЗаявлениеОПереоформленииПС.Ссылка = &ТекущийДокумент";
	
	ДанныеДляПечати = Запрос.Выполнить().Выбрать();
	ДанныеДляПечати.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.НомерПаспортаСделки КАК НомерПаспортаСделки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.ДатаПаспортаСделки КАК ДатаПаспортаСделки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.КонтрактВЭД.КонтрактНомер КАК НомерДоговора,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.НомерСтроки КАК НомерСтроки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки КАК ПаспортСделки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.КонтрактВЭД КАК КонтрактВЭД
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК РЭЙ_ЗаявлениеВБанкПСПаспортСделки
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.Ссылка = &ТекущийДокумент";
	
	ДанныеПаспортовСделки = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.НомерСтроки,
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.Документ
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ДокументыИныеОснования КАК РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.Ссылка = &ТекущийДокумент";
	
	ДанныеДокументыИныеОснования = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка.Параметры.Банк = ДанныеДляПечати.Банк;	
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Номер, Истина, Истина);
	
	Если ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт181_6_9 Тогда
		ОбластьШапка.Параметры.ПричинаПереоформления = "внесением изменений в контракт (кредитный договор) либо с продолжением исполнения обязательств без внесения изменений после даты снятия с учета";		
	ИначеЕсли ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт181_7_1 Тогда
		ОбластьШапка.Параметры.ПричинаПереоформления = "внесением изменений или дополнений в контракт (кредитный договор), а также при изменении иных сведений, содержащихся в разделе I ВБК";		
	ИначеЕсли ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт181_7_9 Тогда
		ОбластьШапка.Параметры.ПричинаПереоформления = "продлением контракта (кредитного договора) без подписания дополнений и изменений либо с продолжением его действия до исполнения сторонами обязательств";		
	КонецЕсли;
	
	ДатаДокумента = Формат(ДанныеДляПечати.Дата, "ДФ=ddMMyyyy");
	Для счетчик = 1 По 8 Цикл
		ОбластьШапка.Параметры["ДатаДокумента_"+счетчик] = Сред(ДатаДокумента, счетчик ,1);
	КонецЦикла;
	
	//вывод данных об организации
	ОбластьШапка.Параметры.ОрганизацияНаименование = ДанныеДляПечати.ОрганизацияНаименование;
	//вывод ИНН
	ПечИНН = Лев(СокрЛП(ДанныеДляПечати.ИНН)+"            ",12);
	Для счетчик = 1 По 12 Цикл
		ОбластьШапка.Параметры["ИНН_"+счетчик] = Сред(ПечИНН, счетчик ,1);
	КонецЦикла;
	
	//вывод КПП
	ПечКПП = Лев(СокрЛП(ДанныеДляПечати.КПП)+"            ",9);
	Для счетчик = 1 По 9 Цикл
		ОбластьШапка.Параметры["КПП_"+счетчик] = Сред(ПечКПП, счетчик ,1);
	КонецЦикла;
	
	//вывод ОГРН
	ПечОГРН = ДанныеДляПечати.ОГРН;
	Для счетчик = 1 По 15 Цикл
		ОбластьШапка.Параметры["ОГРН_"+счетчик] = Сред(ПечОГРН, счетчик ,1);
	КонецЦикла;
	
	ПечДатаРегистрации = Формат(ДанныеДляПечати.ДатаРегистрации, "ДФ=dd.MM.yyyy");
	Если ПустаяСтрока(ПечДатаРегистрации) Тогда
		ПечДатаРегистрации = "  .  .    ";
	КонецЕсли;
	Для счетчик = 1 По 10 Цикл
		ОбластьШапка.Параметры["ДатаРегистрации_"+счетчик] = Сред(ПечДатаРегистрации, счетчик ,1);
	КонецЦикла;
	
	ОбластьШапка.Параметры.ОрганизацияПочтовыйАдрес	= ПолучитьФактАдресОрганизации();
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	Если ДанныеПаспортовСделки.Количество() = 0 Тогда
		ТабДокумент.Вывести(ОбластьСтрока);
	Иначе
		Пока ДанныеПаспортовСделки.Следующий() Цикл
			ОбластьСтрока.Параметры.НомерПаспортаСделки = ДанныеПаспортовСделки.НомерПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаПаспортаСделки = ДанныеПаспортовСделки.ДатаПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаКонтракта = РЭЙ_СлужебныйСервер.ПолучитьДатуКонтракта(ДанныеПаспортовСделки.КонтрактВЭД);
			ОбластьСтрока.Параметры.НомерДоговора = СформироватьНомерДоговора(ДанныеПаспортовСделки.НомерДоговора);
			ОбластьСтрока.Параметры.НомерСтроки = ДанныеПаспортовСделки.НомерСтроки;
			
			ТабДокумент.Вывести(ОбластьСтрока);
			
			Если ЗначениеЗаполнено(ДанныеПаспортовСделки.ПаспортСделки) Тогда
				Если Банк.РЭЙ_ВидПредоставленияДокументовПоСделке = 1 Тогда
					РЭЙ_ЗадачиСервер.УстановитьСтатусЗадачиВЭД(ДанныеПаспортовСделки.ПаспортСделки, "Распечатана");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьОснования = Макет.ПолучитьОбласть("Основания");
	ОбластьДокументы = Макет.ПолучитьОбласть("Документы");
	ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
	ОбластьПодвал3 = Макет.ПолучитьОбласть("Подвал3");
	
	Если ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт181_6_9 Тогда
		ОбластьОснования.Параметры.пункт_6_9 = "√";		
	ИначеЕсли ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт181_7_1 Тогда
		ОбластьОснования.Параметры.пункт_7_1 = "√";		
	ИначеЕсли ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт181_7_9 Тогда
		ОбластьОснования.Параметры.пункт_7_9 = "√";		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьОснования);
	
	Если (ДанныеДляПечати.ОснованиеПереоформленияПС <> Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт181_7_9) и (ДанныеДокументыИныеОснования.Количество() > 0)Тогда
		Пока ДанныеДокументыИныеОснования.Следующий() Цикл
			ОбластьДокументы.Параметры.НомерСтроки = ДанныеДокументыИныеОснования.НомерСтроки;
			ОбластьДокументы.Параметры.Документ = ДанныеДокументыИныеОснования.Документ;
			ТабДокумент.Вывести(ОбластьДокументы);
		КонецЦикла;
	Иначе
		ТабДокумент.Вывести(ОбластьДокументы);
	КонецЕсли;
	
	ОбластьПодвал1.Параметры.ФИОРуководителя = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.Руководитель, ДанныеДляПечати.Дата);
	ОбластьПодвал1.Параметры.ФИОБухгалтера   = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.ГлавныйБухгалтер, ДанныеДляПечати.Дата);
	ОбластьПодвал1.Параметры.УполномоченныйПС = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.УполномоченныйПС, ДанныеДляПечати.Дата);
	ОбластьПодвал1.Параметры.ТелефонУполномоченногоПС = ДанныеДляПечати.ТелефонУполномоченногоПС;
	
	ТабДокумент.Вывести(ОбластьПодвал1);
	ТабДокумент.Вывести(ОбластьПодвал3);
	
	Возврат ТабДокумент;
КонецФункции

Функция Печать2018_ЗаявлениеОбИзмененииКодовВидовОпераций() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявление2018_ОбИзмененииКодовВидовОпераций";
	
	Макет = ПолучитьМакет("Заявление2018_ОбИзмененииКодовВидовОпераций");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Номер,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Банк.Наименование КАК Банк,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Организация,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Дата,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(Заявление2018_ОбИзмененииКодовВидовОпераций.Организация.НаименованиеПолное, 1, 1) = """"
	|			ТОГДА Заявление2018_ОбИзмененииКодовВидовОпераций.Организация.Наименование
	|		ИНАЧЕ Заявление2018_ОбИзмененииКодовВидовОпераций.Организация.НаименованиеПолное
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Организация.ИНН КАК ИНН,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Организация.КПП КАК КПП,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Организация.ОГРН КАК ОГРН,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Организация.РЭЙ_ДатаВнесенияВГосРеестр КАК ДатаРегистрации,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.ГлавныйБухгалтер,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Руководитель,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.УполномоченныйПС,
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.ТелефонУполномоченногоПС
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС КАК Заявление2018_ОбИзмененииКодовВидовОпераций
	|ГДЕ
	|	Заявление2018_ОбИзмененииКодовВидовОпераций.Ссылка = &ТекущийДокумент";
	
	ДанныеДляПечати = Запрос.Выполнить().Выбрать();
	ДанныеДляПечати.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеВБанкПС.КонтрактВЭД.ПаспортСделки.НомерПаспортаСделки КАК НомерПаспортаСделки,
	|	ЗаявлениеВБанкПС.КонтрактВЭД.ПаспортСделки.ДатаПаспортаСделки КАК ДатаПаспортаСделки,
	|	ЗаявлениеВБанкПС.КонтрактВЭД.КонтрактНомер КАК НомерДоговора,
	|	1 КАК НомерСтроки,
	|	ЗаявлениеВБанкПС.КонтрактВЭД КАК КонтрактВЭД
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС КАК ЗаявлениеВБанкПС
	|ГДЕ
	|	ЗаявлениеВБанкПС.Ссылка = &ТекущийДокумент";
	
	ДанныеПаспортовСделки = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка.Параметры.Банк = ДанныеДляПечати.Банк;
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Номер, Истина, Истина);
	
	ДатаДокумента = Формат(ДанныеДляПечати.Дата, "ДФ=ddMMyyyy");
	Для счетчик = 1 По 8 Цикл
		ОбластьШапка.Параметры["ДатаДокумента_"+счетчик] = Сред(ДатаДокумента, счетчик ,1);
	КонецЦикла;
	
	//вывод данных об организации
	ОбластьШапка.Параметры.ОрганизацияНаименование = ДанныеДляПечати.ОрганизацияНаименование;
	//вывод ИНН
	ПечИНН = Лев(СокрЛП(ДанныеДляПечати.ИНН)+"            ",12);
	Для счетчик = 1 По 12 Цикл
		ОбластьШапка.Параметры["ИНН_"+счетчик] = Сред(ПечИНН, счетчик ,1);
	КонецЦикла;
	
	//вывод КПП
	ПечКПП = Лев(СокрЛП(ДанныеДляПечати.КПП)+"            ",9);
	Для счетчик = 1 По 9 Цикл
		ОбластьШапка.Параметры["КПП_"+счетчик] = Сред(ПечКПП, счетчик ,1);
	КонецЦикла;
	
	//вывод ОГРН
	ПечОГРН = ДанныеДляПечати.ОГРН;
	Для счетчик = 1 По 15 Цикл
		ОбластьШапка.Параметры["ОГРН_"+счетчик] = Сред(ПечОГРН, счетчик ,1);
	КонецЦикла;
	
	ПечДатаРегистрации = Формат(ДанныеДляПечати.ДатаРегистрации, "ДФ=dd.MM.yyyy");
	Если ПустаяСтрока(ПечДатаРегистрации) Тогда
		ПечДатаРегистрации = "  .  .    ";
	КонецЕсли;
	Для счетчик = 1 По 10 Цикл
		ОбластьШапка.Параметры["ДатаРегистрации_"+счетчик] = Сред(ПечДатаРегистрации, счетчик ,1);
	КонецЦикла;
	
	ОбластьШапка.Параметры.ОрганизацияПочтовыйАдрес	= ПолучитьФактАдресОрганизации();
	ТабДокумент.Вывести(ОбластьШапка);
	
	Если ДанныеПаспортовСделки.Количество() = 0 Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДокумент.Вывести(ОбластьСтрока);
	Иначе
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Пока ДанныеПаспортовСделки.Следующий() Цикл
			ОбластьСтрока.Параметры.НомерПаспортаСделки = ДанныеПаспортовСделки.НомерПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаПаспортаСделки = ДанныеПаспортовСделки.ДатаПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаКонтракта = РЭЙ_СлужебныйСервер.ПолучитьДатуКонтракта(ДанныеПаспортовСделки.КонтрактВЭД);
			ОбластьСтрока.Параметры.НомерДоговора = СформироватьНомерДоговора(ДанныеПаспортовСделки.НомерДоговора);
			ОбластьСтрока.Параметры.НомерСтроки = ДанныеПаспортовСделки.НомерСтроки;
			
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьСтрока = Макет.ПолучитьОбласть("ИзменениеКодовВО_Шапка");
	ТабДокумент.Вывести(ОбластьСтрока);
	
	Если ИзменениеКодовВидовОпераций.Количество() = 0 Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ИзменениеКодовВО_Строка");
		ТабДокумент.Вывести(ОбластьСтрока);
	Иначе
		Для Каждого СтрокаТЧ Из ИзменениеКодовВидовОпераций Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("ИзменениеКодовВО_Строка");
			ОбластьСтрока.Параметры.НомерСтроки = СтрокаТЧ.НомерСтроки;
			ОбластьСтрока.Параметры.КодВОБанка = СтрокаТЧ.КодВОБанка.Код;
			Если ЗначениеЗаполнено(СтрокаТЧ.РасчетныйДокумент) Тогда
				ОбластьСтрока.Параметры.ДокументБанкаУК = СтрокаТЧ.РасчетныйДокумент.НомерВходящегоДокумента + " от " + Формат(СтрокаТЧ.РасчетныйДокумент.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			ОбластьСтрока.Параметры.КодВО = СтрокаТЧ.КодВООрганизации.Код;
			ОбластьСтрока.Параметры.Документ = СтрокаТЧ.Документ;
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.ФИОРуководителя = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.Руководитель, ДанныеДляПечати.Дата);
	ОбластьПодвал.Параметры.ФИОБухгалтера   = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.ГлавныйБухгалтер, ДанныеДляПечати.Дата);
	ОбластьПодвал.Параметры.УполномоченныйПС = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.УполномоченныйПС, ДанныеДляПечати.Дата);
	ОбластьПодвал.Параметры.ТелефонУполномоченногоПС = ДанныеДляПечати.ТелефонУполномоченногоПС;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
КонецФункции

#КонецОбласти

#Область ПечатьУстаревшиеВерсии

Функция Печать2012_ЗаявлениеОЗакрытииПС() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеОЗакрытииПС";
	
	Макет = ПолучитьМакет("ЗаявлениеОЗакрытииПС");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеОЗакрытииПС.Номер,
	|	ЗаявлениеОЗакрытииПС.Банк.Наименование КАК Банк,
	|	ЗаявлениеОЗакрытииПС.БанкНовый.Наименование КАК БанкНовый,
	|	ЗаявлениеОЗакрытииПС.ОснованиеЗакрытияПС,
	|	ЗаявлениеОЗакрытииПС.Организация,
	|	ЗаявлениеОЗакрытииПС.Дата,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЗаявлениеОЗакрытииПС.Организация.НаименованиеПолное, 1, 1) = """"
	|			ТОГДА ЗаявлениеОЗакрытииПС.Организация.Наименование
	|		ИНАЧЕ ЗаявлениеОЗакрытииПС.Организация.НаименованиеПолное
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ЗаявлениеОЗакрытииПС.Организация.ИНН КАК ИНН,
	|	ЗаявлениеОЗакрытииПС.Организация.КПП КАК КПП,
	|	ЗаявлениеОЗакрытииПС.Организация.ОГРН КАК ОГРН,
	|	ЗаявлениеОЗакрытииПС.Организация.РЭЙ_ДатаВнесенияВГосРеестр КАК ДатаРегистрации,
	|	ЗаявлениеОЗакрытииПС.ГлавныйБухгалтер,
	|	ЗаявлениеОЗакрытииПС.Руководитель,
	|	ЗаявлениеОЗакрытииПС.УполномоченныйПС,
	|	ЗаявлениеОЗакрытииПС.ТелефонУполномоченногоПС
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС КАК ЗаявлениеОЗакрытииПС
	|ГДЕ
	|	ЗаявлениеОЗакрытииПС.Ссылка = &ТекущийДокумент";
	
	ДанныеДляПечати = Запрос.Выполнить().Выбрать();
	ДанныеДляПечати.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.НомерПаспортаСделки КАК НомерПаспортаСделки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.Дата КАК ДатаПаспортаСделки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.КонтрактВЭД.КонтрактНомер КАК НомерДоговора,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.КонтрактВЭД.КонтрактДатаПодписания КАК ДатаДоговора,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.НомерСтроки
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК РЭЙ_ЗаявлениеВБанкПСПаспортСделки
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.Ссылка = &ТекущийДокумент";
	
	ДанныеПаспортовСделки = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.НомерСтроки,
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.Документ
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ДокументыИныеОснования КАК РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.Ссылка = &ТекущийДокумент";
	
	ДанныеДокументыИныеОснования = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка.Параметры.Банк = ДанныеДляПечати.Банк;	
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Номер, Истина, Истина);
	
	Если ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_1 Или ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_1 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "переводом контракта (кредитного договора) из банка ПС на расчетное обслуживание в другой уполномоченный банк";		
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_2 Или ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_2 Тогда
		Если ВидИногоОснованияЗакрытия = 1 Тогда
			ОбластьШапка.Параметры.ПричинаЗакрытия = "прекращением обязательств по контракту (кредитному договору) по основаниям, предусмотренным законодательством Российской Федерации";	
		Иначе
			ОбластьШапка.Параметры.ПричинаЗакрытия = "исполнением сторонами всех обязательств по контракту (кредитному договору)";
		КонецЕсли;
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_3 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "уступкой резидентом требования по контракту резиденту";
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_4 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "уступкой резидентом требования по контракту нерезиденту";
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_5 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "исполнением (прекращением) обязательств по контракту по иным основаниям";
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_6 Тогда
		ОбластьШапка.Параметры.ПричинаЗакрытия = "прекращением (отсутствием) оснований, требующих оформления ПС";
	Иначе
		ОбластьШапка.Параметры.ПричинаЗакрытия = "истечением 180 календарных дней, следующих за указанной в ПС датой завершения исполнения обязательств по контракту (кредитному договору)";		
	КонецЕсли;
	
	ДатаДокумента = Формат(ДанныеДляПечати.Дата, "ДФ=dd.MM.yyyy; ДП='  .  .    '");
	Для счетчик = 1 По 10 Цикл
		Если Найти(".3.6.", "."+счетчик+".")>0 Тогда 
			Продолжить;
		КонецЕсли;
		ОбластьШапка.Параметры["ДатаДокумента_"+счетчик] = Сред(ДатаДокумента, счетчик ,1);
	КонецЦикла;
	
	//вывод данных об организации
	ОбластьШапка.Параметры.ОрганизацияНаименование = ДанныеДляПечати.ОрганизацияНаименование;
	//вывод ИНН
	ПечИНН = Лев(СокрЛП(ДанныеДляПечати.ИНН)+"            ",12);
	Для счетчик = 1 По 12 Цикл
		ОбластьШапка.Параметры["ИНН_"+счетчик] = Сред(ПечИНН, счетчик ,1);
	КонецЦикла;
	
	//вывод КПП
	ПечКПП = Лев(СокрЛП(ДанныеДляПечати.КПП)+"            ",9);
	Для счетчик = 1 По 9 Цикл
		ОбластьШапка.Параметры["КПП_"+счетчик] = Сред(ПечКПП, счетчик ,1);
	КонецЦикла;
	
	//вывод ОГРН
	ПечОГРН = ДанныеДляПечати.ОГРН;
	Для счетчик = 1 По 15 Цикл
		ОбластьШапка.Параметры["ОГРН_"+счетчик] = Сред(ПечОГРН, счетчик ,1);
	КонецЦикла;
	
	ПечДатаРегистрации = Формат(ДанныеДляПечати.ДатаРегистрации, "ДФ=dd.MM.yyyy");
	Если ПустаяСтрока(ПечДатаРегистрации) Тогда
		ПечДатаРегистрации = "  .  .    ";
	КонецЕсли;
	Для счетчик = 1 По 10 Цикл
		ОбластьШапка.Параметры["ДатаРегистрации_"+счетчик] = Сред(ПечДатаРегистрации, счетчик ,1);
	КонецЦикла;
	
	ОбластьШапка.Параметры.ОрганизацияПочтовыйАдрес	= ПолучитьФактАдресОрганизации();
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	Если ДанныеПаспортовСделки.Количество() = 0 Тогда
		ТабДокумент.Вывести(ОбластьСтрока);
	Иначе
		Пока ДанныеПаспортовСделки.Следующий() Цикл
			ОбластьСтрока.Параметры.НомерПаспортаСделки = ДанныеПаспортовСделки.НомерПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаПаспортаСделки = ДанныеПаспортовСделки.ДатаПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаДоговора = ДанныеПаспортовСделки.ДатаДоговора;
			ОбластьСтрока.Параметры.НомерДоговора = СформироватьНомерДоговора(ДанныеПаспортовСделки.НомерДоговора);
			ОбластьСтрока.Параметры.НомерСтроки = ДанныеПаспортовСделки.НомерСтроки;
			
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьОснования = Макет.ПолучитьОбласть("Основания");
	ОбластьДокументы = Макет.ПолучитьОбласть("Документы");
	ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
	ОбластьПодвал2 = Макет.ПолучитьОбласть("Подвал2");
	ОбластьПодвал3 = Макет.ПолучитьОбласть("Подвал3");

	Если ?(Дата >= Дата(2012,10,01), ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_1, ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_1) Тогда
		ОбластьОснования.Параметры.пункт_7_1_1 = "√";		
		ОбластьОснования.Параметры.БанкНовый = ДанныеДляПечати.БанкНовый;
	ИначеЕсли ?(Дата >= Дата(2012,10,01), ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_2, ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_2 И ВидИногоОснованияЗакрытия = 0) Тогда//(ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_2) и (ВидИногоОснованияЗакрытия = 0) Тогда
		ОбластьОснования.Параметры.пункт_7_1_2 = "√";		
	ИначеЕсли ?(Дата >= Дата(2012,10,01), ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_5, (ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_2) и (ВидИногоОснованияЗакрытия = 1)) Тогда  
		ОбластьОснования.Параметры.пункт_7_1_5 = "√";		
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_3 Тогда
		ОбластьОснования.Параметры.пункт_7_1_3 = "√";		
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_4 Тогда
		ОбластьОснования.Параметры.пункт_7_1_4 = "√";		
	ИначеЕсли ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_6 Тогда
		ОбластьОснования.Параметры.пункт_7_1_6 = "√";		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьОснования);
	
	Если ДанныеДокументыИныеОснования.Количество() = 0 Тогда
		ТабДокумент.Вывести(ОбластьДокументы);
	Иначе
		Пока ДанныеДокументыИныеОснования.Следующий() Цикл
			ОбластьДокументы.Параметры.НомерСтроки = ДанныеДокументыИныеОснования.НомерСтроки;
			ОбластьДокументы.Параметры.Документ = ДанныеДокументыИныеОснования.Документ;
			ТабДокумент.Вывести(ОбластьДокументы);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьПодвал1.Параметры.ФИОРуководителя = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.Руководитель, ДанныеДляПечати.Дата);
	ОбластьПодвал1.Параметры.ФИОБухгалтера   = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.ГлавныйБухгалтер, ДанныеДляПечати.Дата);
	ОбластьПодвал1.Параметры.УполномоченныйПС = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.УполномоченныйПС, ДанныеДляПечати.Дата);
	ОбластьПодвал1.Параметры.ТелефонУполномоченногоПС = ДанныеДляПечати.ТелефонУполномоченногоПС;
	
	Если ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_1 Тогда
		ОбластьПодвал1.Параметры.ТекстПаспортПереведен = "Паспорт сделки переведен в другой уполномоченный банк:";
		ОбластьПодвал2.Параметры.БанкНовый = ДанныеДляПечати.БанкНовый;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПодвал1);
	
	Если ДанныеДляПечати.ОснованиеЗакрытияПС = Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_1 Тогда
		ТабДокумент.Вывести(ОбластьПодвал2);
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПодвал3);
	
	Возврат ТабДокумент;
КонецФункции

Функция Печать2012_ЗаявлениеНаПредоставлениеВедомостиБанковскогоКонтроля() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеНаПредоставлениеВедомостиБанковскогоКонтроля";
	
	Макет = ПолучитьМакет("ЗаявлениеНаПредоставлениеВБК");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеНаПредоставлениеВБК.Номер,
	|	ЗаявлениеНаПредоставлениеВБК.Банк.Наименование КАК Банк,
	|	ЗаявлениеНаПредоставлениеВБК.Организация,
	|	ЗаявлениеНаПредоставлениеВБК.Дата,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЗаявлениеНаПредоставлениеВБК.Организация.НаименованиеПолное, 1, 1) = """"
	|			ТОГДА ЗаявлениеНаПредоставлениеВБК.Организация.Наименование
	|		ИНАЧЕ ЗаявлениеНаПредоставлениеВБК.Организация.НаименованиеПолное
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ЗаявлениеНаПредоставлениеВБК.Организация.ИНН КАК ИНН,
	|	ЗаявлениеНаПредоставлениеВБК.Организация.КПП КАК КПП,
	|	ЗаявлениеНаПредоставлениеВБК.Организация.ОГРН КАК ОГРН,
	|	ЗаявлениеНаПредоставлениеВБК.Организация.РЭЙ_ДатаВнесенияВГосРеестр КАК ДатаРегистрации,
	|	ЗаявлениеНаПредоставлениеВБК.ГлавныйБухгалтер,
	|	ЗаявлениеНаПредоставлениеВБК.Руководитель,
	|	ЗаявлениеНаПредоставлениеВБК.УполномоченныйПС,
	|	ЗаявлениеНаПредоставлениеВБК.ТелефонУполномоченногоПС
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС КАК ЗаявлениеНаПредоставлениеВБК
	|ГДЕ
	|	ЗаявлениеНаПредоставлениеВБК.Ссылка = &ТекущийДокумент";
	
	ДанныеДляПечати = Запрос.Выполнить().Выбрать();
	ДанныеДляПечати.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеНаПредоставлениеВБК.ПаспортСделки.НомерПаспортаСделки КАК НомерПаспортаСделки,
	|	ЗаявлениеНаПредоставлениеВБК.ПаспортСделки.Дата КАК ДатаПаспортаСделки,
	|	ЗаявлениеНаПредоставлениеВБК.ПаспортСделки.КонтрактВЭД.КонтрактНомер КАК НомерДоговора,
	|	ЗаявлениеНаПредоставлениеВБК.ПаспортСделки.КонтрактВЭД.КонтрактДатаПодписания КАК ДатаДоговора,
	|	ЗаявлениеНаПредоставлениеВБК.НомерСтроки
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК ЗаявлениеНаПредоставлениеВБК
	|ГДЕ
	|	ЗаявлениеНаПредоставлениеВБК.Ссылка = &ТекущийДокумент";
	
	ДанныеПаспортовСделки = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка.Параметры.Банк = ДанныеДляПечати.Банк;
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Номер, Истина, Истина);
	
	ДатаДокумента = Формат(ДанныеДляПечати.Дата, "ДФ=dd.MM.yyyy; ДП='  .  .    '");
	Для счетчик = 1 По 10 Цикл
		Если Найти(".3.6.", "."+счетчик+".")>0 Тогда 
			Продолжить;
		КонецЕсли;
		ОбластьШапка.Параметры["ДатаДокумента_"+счетчик] = Сред(ДатаДокумента, счетчик ,1);
	КонецЦикла;
	
	//вывод данных об организации
	ОбластьШапка.Параметры.ОрганизацияНаименование = ДанныеДляПечати.ОрганизацияНаименование;
	//вывод ИНН
	ПечИНН = Лев(СокрЛП(ДанныеДляПечати.ИНН)+"            ",12);
	Для счетчик = 1 По 12 Цикл
		ОбластьШапка.Параметры["ИНН_"+счетчик] = Сред(ПечИНН, счетчик ,1);
	КонецЦикла;
	
	//вывод КПП
	ПечКПП = Лев(СокрЛП(ДанныеДляПечати.КПП)+"            ",9);
	Для счетчик = 1 По 9 Цикл
		ОбластьШапка.Параметры["КПП_"+счетчик] = Сред(ПечКПП, счетчик ,1);
	КонецЦикла;
	
	//вывод ОГРН
	ПечОГРН = ДанныеДляПечати.ОГРН;
	Для счетчик = 1 По 15 Цикл
		ОбластьШапка.Параметры["ОГРН_"+счетчик] = Сред(ПечОГРН, счетчик ,1);
	КонецЦикла;
	
	ПечДатаРегистрации = Формат(ДанныеДляПечати.ДатаРегистрации, "ДФ=dd.MM.yyyy");
	Если ПустаяСтрока(ПечДатаРегистрации) Тогда
		ПечДатаРегистрации = "  .  .    ";
	КонецЕсли;
	Для счетчик = 1 По 10 Цикл
		ОбластьШапка.Параметры["ДатаРегистрации_"+счетчик] = Сред(ПечДатаРегистрации, счетчик ,1);
	КонецЦикла;
	
	ОбластьШапка.Параметры.ОрганизацияПочтовыйАдрес	= ПолучитьФактАдресОрганизации();
	ТабДокумент.Вывести(ОбластьШапка);
	
	Если ДанныеПаспортовСделки.Количество() = 0 Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДокумент.Вывести(ОбластьСтрока);
	Иначе
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Пока ДанныеПаспортовСделки.Следующий() Цикл
			ОбластьСтрока.Параметры.НомерПаспортаСделки = ДанныеПаспортовСделки.НомерПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаПаспортаСделки = ДанныеПаспортовСделки.ДатаПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаДоговора = ДанныеПаспортовСделки.ДатаДоговора;
			ОбластьСтрока.Параметры.НомерДоговора = СформироватьНомерДоговора(ДанныеПаспортовСделки.НомерДоговора);
			ОбластьСтрока.Параметры.НомерСтроки = ДанныеПаспортовСделки.НомерСтроки;
			
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.ФИОРуководителя = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.Руководитель, ДанныеДляПечати.Дата);
	ОбластьПодвал.Параметры.ФИОБухгалтера   = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.ГлавныйБухгалтер, ДанныеДляПечати.Дата);
	ОбластьПодвал.Параметры.УполномоченныйПС = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.УполномоченныйПС, ДанныеДляПечати.Дата);
	ОбластьПодвал.Параметры.ТелефонУполномоченногоПС = ДанныеДляПечати.ТелефонУполномоченногоПС;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
КонецФункции

Функция Печать2012_ЗаявлениеОПереоформленииПС() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеОПереоформленииПС";
	
	Макет = ПолучитьМакет("ЗаявлениеОПереоформленииПС");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеОПереоформленииПС.Номер,
	|	ЗаявлениеОПереоформленииПС.Банк.Наименование КАК Банк,
	|	ЗаявлениеОПереоформленииПС.ОснованиеПереоформленияПС,
	|	ЗаявлениеОПереоформленииПС.Организация,
	|	ЗаявлениеОПереоформленииПС.Дата,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЗаявлениеОПереоформленииПС.Организация.НаименованиеПолное, 1, 1) = """"
	|			ТОГДА ЗаявлениеОПереоформленииПС.Организация.Наименование
	|		ИНАЧЕ ЗаявлениеОПереоформленииПС.Организация.НаименованиеПолное
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ЗаявлениеОПереоформленииПС.Организация.ИНН КАК ИНН,
	|	ЗаявлениеОПереоформленииПС.Организация.КПП КАК КПП,
	|	ЗаявлениеОПереоформленииПС.Организация.ОГРН КАК ОГРН,
	|	ЗаявлениеОПереоформленииПС.Организация.РЭЙ_ДатаВнесенияВГосРеестр КАК ДатаРегистрации,
	|	ЗаявлениеОПереоформленииПС.ГлавныйБухгалтер,
	|	ЗаявлениеОПереоформленииПС.Руководитель,
	|	ЗаявлениеОПереоформленииПС.УполномоченныйПС,
	|	ЗаявлениеОПереоформленииПС.ТелефонУполномоченногоПС
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС КАК ЗаявлениеОПереоформленииПС
	|ГДЕ
	|	ЗаявлениеОПереоформленииПС.Ссылка = &ТекущийДокумент";
	
	ДанныеДляПечати = Запрос.Выполнить().Выбрать();
	ДанныеДляПечати.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.НомерПаспортаСделки КАК НомерПаспортаСделки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.Дата КАК ДатаПаспортаСделки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.КонтрактВЭД.КонтрактНомер КАК НомерДоговора,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки.КонтрактВЭД.КонтрактДатаПодписания КАК ДатаДоговора,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.НомерСтроки,
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.ПаспортСделки
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК РЭЙ_ЗаявлениеВБанкПСПаспортСделки
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортСделки.Ссылка = &ТекущийДокумент";
	
	ДанныеПаспортовСделки = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.НомерСтроки,
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.Документ
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ДокументыИныеОснования КАК РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСДокументыИныеОснования.Ссылка = &ТекущийДокумент";
	
	ДанныеДокументыИныеОснования = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка.Параметры.Банк = ДанныеДляПечати.Банк;	
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Номер, Истина, Истина);
	
	Если ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт_7_10 Тогда
		ОбластьШапка.Параметры.ПричинаПереоформления = "изменением суммы либо продлением срока контракта (кредитного договора) после даты закрытия ПС";		
	ИначеЕсли ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт_8_4 Тогда
		ОбластьШапка.Параметры.ПричинаПереоформления = "изменением сведений об организации в ЕГРЮЛ/ЕГРИП/иных реестрах";		
	Иначе
		ОбластьШапка.Параметры.ПричинаПереоформления = "пролонгацией контракта (кредитного договора) без подписания дополнений и изменений";		
	КонецЕсли;
	
	ДатаДокумента = Формат(ДанныеДляПечати.Дата, "ДФ=dd.MM.yyyy; ДП='  .  .    '");
	Для счетчик = 1 По 10 Цикл
		Если Найти(".3.6.", "."+счетчик+".")>0 Тогда 
			Продолжить;
		КонецЕсли;
		ОбластьШапка.Параметры["ДатаДокумента_"+счетчик] = Сред(ДатаДокумента, счетчик ,1);
	КонецЦикла;
	
	//вывод данных об организации
	ОбластьШапка.Параметры.ОрганизацияНаименование = ДанныеДляПечати.ОрганизацияНаименование;
	//вывод ИНН
	ПечИНН = Лев(СокрЛП(ДанныеДляПечати.ИНН)+"            ",12);
	Для счетчик = 1 По 12 Цикл
		ОбластьШапка.Параметры["ИНН_"+счетчик] = Сред(ПечИНН, счетчик ,1);
	КонецЦикла;
	
	//вывод КПП
	ПечКПП = Лев(СокрЛП(ДанныеДляПечати.КПП)+"            ",9);
	Для счетчик = 1 По 9 Цикл
		ОбластьШапка.Параметры["КПП_"+счетчик] = Сред(ПечКПП, счетчик ,1);
	КонецЦикла;
	
	//вывод ОГРН
	ПечОГРН = ДанныеДляПечати.ОГРН;
	Для счетчик = 1 По 15 Цикл
		ОбластьШапка.Параметры["ОГРН_"+счетчик] = Сред(ПечОГРН, счетчик ,1);
	КонецЦикла;
	
	ПечДатаРегистрации = Формат(ДанныеДляПечати.ДатаРегистрации, "ДФ=dd.MM.yyyy");
	Если ПустаяСтрока(ПечДатаРегистрации) Тогда
		ПечДатаРегистрации = "  .  .    ";
	КонецЕсли;
	Для счетчик = 1 По 10 Цикл
		ОбластьШапка.Параметры["ДатаРегистрации_"+счетчик] = Сред(ПечДатаРегистрации, счетчик ,1);
	КонецЦикла;
	
	ОбластьШапка.Параметры.ОрганизацияПочтовыйАдрес	= ПолучитьФактАдресОрганизации();
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	Если ДанныеПаспортовСделки.Количество() = 0 Тогда
		ТабДокумент.Вывести(ОбластьСтрока);
	Иначе
		Пока ДанныеПаспортовСделки.Следующий() Цикл
			ОбластьСтрока.Параметры.НомерПаспортаСделки = ДанныеПаспортовСделки.НомерПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаПаспортаСделки = ДанныеПаспортовСделки.ДатаПаспортаСделки;
			ОбластьСтрока.Параметры.ДатаДоговора = ДанныеПаспортовСделки.ДатаДоговора;
			ОбластьСтрока.Параметры.НомерДоговора = СформироватьНомерДоговора(ДанныеПаспортовСделки.НомерДоговора);
			ОбластьСтрока.Параметры.НомерСтроки = ДанныеПаспортовСделки.НомерСтроки;
			
			ТабДокумент.Вывести(ОбластьСтрока);
			
			Если ЗначениеЗаполнено(ДанныеПаспортовСделки.ПаспортСделки) Тогда
				Если Банк.РЭЙ_ВидПредоставленияДокументовПоСделке = 1 Тогда
					РЭЙ_ЗадачиСервер.УстановитьСтатусЗадачиВЭД(ДанныеПаспортовСделки.ПаспортСделки, "Распечатана");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьОснования = Макет.ПолучитьОбласть("Основания");
	ОбластьДокументы = Макет.ПолучитьОбласть("Документы");
	ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
	ОбластьПодвал3 = Макет.ПолучитьОбласть("Подвал3");
	
	Если ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт_7_10 Тогда
		ОбластьОснования.Параметры.пункт_7_10 = "√";		
	ИначеЕсли (ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт_8_4) Тогда
		ОбластьОснования.Параметры.пункт_8_4 = "√";		
	ИначеЕсли (ДанныеДляПечати.ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт_8_8) Тогда
		ОбластьОснования.Параметры.пункт_8_8 = "√";		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьОснования);
	
	Если (ДанныеДляПечати.ОснованиеПереоформленияПС <> Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт_8_8) и (ДанныеДокументыИныеОснования.Количество() > 0)Тогда
		Пока ДанныеДокументыИныеОснования.Следующий() Цикл
			ОбластьДокументы.Параметры.НомерСтроки = ДанныеДокументыИныеОснования.НомерСтроки;
			ОбластьДокументы.Параметры.Документ = ДанныеДокументыИныеОснования.Документ;
			ТабДокумент.Вывести(ОбластьДокументы);
		КонецЦикла;
	Иначе
		ТабДокумент.Вывести(ОбластьДокументы);
	КонецЕсли;
	
	ОбластьПодвал1.Параметры.ФИОРуководителя = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.Руководитель, ДанныеДляПечати.Дата);
	ОбластьПодвал1.Параметры.ФИОБухгалтера   = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.ГлавныйБухгалтер, ДанныеДляПечати.Дата);
	ОбластьПодвал1.Параметры.УполномоченныйПС = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечати.УполномоченныйПС, ДанныеДляПечати.Дата);
	ОбластьПодвал1.Параметры.ТелефонУполномоченногоПС = ДанныеДляПечати.ТелефонУполномоченногоПС;
	
	ТабДокумент.Вывести(ОбластьПодвал1);
	ТабДокумент.Вывести(ОбластьПодвал3);
	
	Возврат ТабДокумент;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыЗакрытияПаспортаСделки(ПризнакПроведения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_ПаспортСделки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтарыеДанные
	|ИЗ
	|	Документ.РЭЙ_ПаспортСделки КАК РЭЙ_ПаспортСделки
	|ГДЕ
	|	РЭЙ_ПаспортСделки.ДокументЗакрытияПС = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.ПаспортСделки КАК Ссылка
	|ПОМЕСТИТЬ НовыеДанные
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК РЭЙ_ЗаявлениеВБанкПСПаспортаСделок
	|ГДЕ
	|	(РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗакрытиеПаспортаСделки)
	|			ИЛИ РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_6_1_СнятиеСУчетаКонтракта))
	|	И РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ДатаЗакрытияПС <> ДАТАВРЕМЯ(1, 1, 1)
	|	И РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка = &Ссылка
	|	И НЕ(РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ОснованиеЗакрытияПС = ЗНАЧЕНИЕ(Перечисление.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_1)
	|				ИЛИ РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ОснованиеЗакрытияПС = ЗНАЧЕНИЕ(Перечисление.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_1))
	|	И &ПризнакПроведения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеДанные.Ссылка КАК СсылкаНовая,
	|	СтарыеДанные.Ссылка КАК СсылкаСтарая
	|ИЗ
	|	СтарыеДанные КАК СтарыеДанные
	|		ПОЛНОЕ СОЕДИНЕНИЕ НовыеДанные КАК НовыеДанные
	|		ПО СтарыеДанные.Ссылка = НовыеДанные.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПризнакПроведения", ПризнакПроведения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СсылкаНовая = NULL Тогда
			ДокументОбъект = Выборка.СсылкаСтарая.ПолучитьОбъект();
			ДокументОбъект.ДокументЗакрытияПС = Неопределено;
			ДокументОбъект.ДатаЗакрытияПС = Неопределено;
			ДокументОбъект.ОснованиеЗакрытияПС = Неопределено;
			ДокументОбъект.Записать();
		Иначе
			ДокументОбъект = Выборка.СсылкаНовая.ПолучитьОбъект();
			ДокументОбъект.ДокументЗакрытияПС = Ссылка;
			ДокументОбъект.ДатаЗакрытияПС = ДатаЗакрытияПС;
			
			Если ЗначениеЗаполнено(ОснованиеЗакрытияПС) Тогда
				текНомерПункта = Перечисления.РЭЙ_ОснованияЗакрытияПС.ПолучитьНомерПункта(ОснованиеЗакрытияПС);
				Если Дата >= Дата(2018,03,01) Тогда
					ДокументОбъект.ОснованиеЗакрытияПС = "п." + текНомерПункта + " Инструкции ЦБР №181-И от 16.08.2017";
				Иначе
					ДокументОбъект.ОснованиеЗакрытияПС = "п." + текНомерПункта + " Инструкции ЦБР №138-И от 04.06.2012";
				КонецЕсли;
			Иначе
				ДокументОбъект.ОснованиеЗакрытияПС = "";
			КонецЕсли;

			ДокументОбъект.Записать();           
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПереводВДругойБанк(ПризнакПроведения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_ПаспортСделки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтарыеДанные
	|ИЗ
	|	Документ.РЭЙ_ПаспортСделки.ПереводВДругойБанк КАК РЭЙ_ПаспортСделки
	|ГДЕ
	|	РЭЙ_ПаспортСделки.Заявление = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.ПаспортСделки КАК Ссылка
	|ПОМЕСТИТЬ НовыеДанные
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК РЭЙ_ЗаявлениеВБанкПСПаспортаСделок
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗакрытиеПаспортаСделки)
	|	И РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ДатаЗакрытияПС <> ДАТАВРЕМЯ(1, 1, 1)
	|	И РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка = &Ссылка
	|	И (РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ОснованиеЗакрытияПС = ЗНАЧЕНИЕ(Перечисление.РЭЙ_ОснованияЗакрытияПС.пункт_7_1_1)
	|			ИЛИ РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ОснованиеЗакрытияПС = ЗНАЧЕНИЕ(Перечисление.РЭЙ_ОснованияЗакрытияПС.пункт_3_18_1))
	|	И &ПризнакПроведения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеДанные.Ссылка КАК СсылкаНовая,
	|	СтарыеДанные.Ссылка КАК СсылкаСтарая
	|ИЗ
	|	СтарыеДанные КАК СтарыеДанные
	|		ПОЛНОЕ СОЕДИНЕНИЕ НовыеДанные КАК НовыеДанные
	|		ПО СтарыеДанные.Ссылка = НовыеДанные.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПризнакПроведения", ПризнакПроведения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СсылкаНовая = NULL Тогда
			ДокументОбъект = Выборка.СсылкаСтарая.ПолучитьОбъект();
			СтрокиТЧ = ДокументОбъект.ПереводВДругойБанк.НайтиСтроки(Новый Структура("Заявление", Ссылка));
			Если СтрокиТЧ.Количество() > 0 Тогда
				ДокументОбъект.ПереводВДругойБанк.Удалить(СтрокиТЧ[0]);
			КонецЕсли;
			ДокументОбъект.Записать();
		Иначе
			ДокументОбъект = Выборка.СсылкаНовая.ПолучитьОбъект();
			
			СтрокиТЧ = ДокументОбъект.ПереводВДругойБанк.НайтиСтроки(Новый Структура("Заявление", Ссылка));
			Если СтрокиТЧ.Количество() > 0 Тогда
				СтрокаТЧ = СтрокиТЧ[0];
			Иначе
				СтрокаТЧ = ДокументОбъект.ПереводВДругойБанк.Добавить();
			КонецЕсли;
			
			СтрокаТЧ.ДатаПринятияБанком = ДатаПринятияПС;
			СтрокаТЧ.Банк = БанкНовый;
			СтрокаТЧ.Заявление = Ссылка;

			ДокументОбъект.ПереводВДругойБанк.Сортировать("Заявление");
			ДокументОбъект.Записать();           
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПереоформленияПаспортаСделки(ПризнакПроведения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_ПаспортСделки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтарыеДанные
	|ИЗ
	|	Документ.РЭЙ_ПаспортСделки.ПереоформлениеПС КАК РЭЙ_ПаспортСделки
	|ГДЕ
	|	РЭЙ_ПаспортСделки.ДокументОснование = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.ПаспортСделки КАК Ссылка
	|ПОМЕСТИТЬ НовыеДанные
	|ИЗ
	|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК РЭЙ_ЗаявлениеВБанкПСПаспортаСделок
	|ГДЕ
	|	РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.РЭЙ_ВидыОперацийЗаявлениеВБанк.ПереоформлениеПаспортаСделки)
	|	И РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ДатаПереоформленияПС <> ДАТАВРЕМЯ(1, 1, 1)
	|	И РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка = &Ссылка
	|	И &ПризнакПроведения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеДанные.Ссылка КАК СсылкаНовая,
	|	СтарыеДанные.Ссылка КАК СсылкаСтарая
	|ИЗ
	|	СтарыеДанные КАК СтарыеДанные
	|		ПОЛНОЕ СОЕДИНЕНИЕ НовыеДанные КАК НовыеДанные
	|		ПО СтарыеДанные.Ссылка = НовыеДанные.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПризнакПроведения", ПризнакПроведения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СсылкаНовая = NULL Тогда
			ДокументОбъект = Выборка.СсылкаСтарая.ПолучитьОбъект();
			СтрокиТЧ = ДокументОбъект.ПереоформлениеПС.НайтиСтроки(Новый Структура("ДокументОснование", Ссылка));
			Для т = 0 По СтрокиТЧ.Количество() - 1 Цикл
				ДокументОбъект.ПереоформлениеПС.Удалить(СтрокиТЧ[т]);
			КонецЦикла;
			ДокументОбъект.Записать();
		Иначе
			ДокументОбъект = Выборка.СсылкаНовая.ПолучитьОбъект();
			СтрокиТЧ = ДокументОбъект.ПереоформлениеПС.НайтиСтроки(Новый Структура("ДокументОснование", Ссылка));
			Если СтрокиТЧ.Количество() > 0 Тогда
				СтрокаТЧ = СтрокиТЧ[0];
			Иначе
				СтрокаТЧ = ДокументОбъект.ПереоформлениеПС.Добавить();
			КонецЕсли;
			СтрокаТЧ.Дата = ДатаПереоформленияПС;
			СтрокаТЧ.ОснованиеНомер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Ссылка.Номер, Истина, Истина);
			СтрокаТЧ.ОснованиеДата = Дата;
			СтрокаТЧ.ДокументОснование = Ссылка;
			
			Для т = 1 По СтрокиТЧ.Количество() - 1 Цикл
				ДокументОбъект.ПереоформлениеПС.Удалить(СтрокиТЧ[т]);
			КонецЦикла;
			
			ДокументОбъект.Записать();           
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьДляПереоформления(СсылкаНаЗадачу) Экспорт
	текПаспортСделки = СсылкаНаЗадачу.ОбъектЗадачи;
	Дата = ТекущаяДата();
	ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ПереоформлениеПаспортаСделки;
	Организация = текПаспортСделки.Организация;
	Банк = текПаспортСделки.Банк;
	ОснованиеПереоформленияПС = Перечисления.РЭЙ_ОснованияПереоформленияПС.пункт_7_10;
	
	Если СсылкаНаЗадачу.ВидЗадачи = Справочники.РЭЙ_ВидыЗадачПользователей.ПаспортСделкиПереоформлениеСумма Тогда
		ИзменениеСуммыКонтракта = Истина;
	Иначе
		ПродлениеСрокаКонтракта = Истина;
		Если текПаспортСделки.КонтрактВЭД.РамочныйКонтракт Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РЭЙ_ДопСоглашения.Договор,
			|	МАКСИМУМ(РЭЙ_ДопСоглашения.ДатаОкончанияКонтракта) КАК ДатаОкончанияКонтракта
			|ИЗ
			|	РегистрСведений.РЭЙ_ДопСоглашения КАК РЭЙ_ДопСоглашения
			|ГДЕ
			|	РЭЙ_ДопСоглашения.Договор = &Договор
			|
			|СГРУППИРОВАТЬ ПО
			|	РЭЙ_ДопСоглашения.Договор";
			
			Запрос.УстановитьПараметр("Договор", текПаспортСделки.КонтрактВЭД);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.ДатаОкончанияКонтракта > текПаспортСделки.КонтрактВЭД.КонтрактДатаОкончания Тогда
					КонтрактДатаОкончанияНовая = Выборка.ДатаОкончанияКонтракта;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	Руководители = РЭЙ_Универсализация.ПолучитьРуководителей(Организация, Дата);
	Руководитель = Руководители.Руководитель;
	ГлавныйБухгалтер = Руководители.ГлавныйБухгалтер;
	УполномоченныйПС = РЭЙ_СлужебныйСервер.ФизЛицоПользователя(Ответственный);
	ТелефонУполномоченногоПС = РЭЙ_СлужебныйСервер.ПолучитьСлужебныйТелефонФизЛица(УполномоченныйПС);
	
	НоваяСтрока = ПаспортаСделок.Добавить();
	НоваяСтрока.ПаспортСделки = текПаспортСделки;
КонецПроцедуры

Процедура ЗаполнитьПунктИнструкцииЦБР()
	Если ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_6_1_СнятиеСУчетаКонтракта Тогда
		ПунктИнструкцииЦБР = Перечисления.РЭЙ_ОснованияЗакрытияПС.ПолучитьНомерПункта(ОснованиеЗакрытияПС);
	ИначеЕсли ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_7_1_ВнесениеИзмененийВРаздел1ВБК Тогда
		ПунктИнструкцииЦБР = Перечисления.РЭЙ_ОснованияПереоформленияПС.ПолучитьНомерПункта(ОснованиеПереоформленияПС);
	ИначеЕсли ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗакрытиеПаспортаСделки Тогда
		ПунктИнструкцииЦБР = Перечисления.РЭЙ_ОснованияЗакрытияПС.ПолучитьНомерПункта(ОснованиеЗакрытияПС);
	ИначеЕсли ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ПереоформлениеПаспортаСделки Тогда
		ПунктИнструкцииЦБР = Перечисления.РЭЙ_ОснованияПереоформленияПС.ПолучитьНомерПункта(ОснованиеПереоформленияПС);
	Иначе
		ПунктИнструкцииЦБР = "";
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьФактАдресОрганизации()
	СтрокиКИ = Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации));
	Если СтрокиКИ.Количество() = 0 Тогда
		Возврат "";
	Иначе
		Возврат СтрокиКИ[0].Представление;
	КонецЕсли;
КонецФункции

Функция СформироватьНомерДоговора(Знач ТекущийНомерДоговора)
	Если ПустаяСтрока(ТекущийНомерДоговора) Тогда
		Если Дата >= '20121001' Тогда
			ТекущийНомерДоговора = "БН";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийНомерДоговора;
КонецФункции

Процедура ВывестиЗначениеВКлетки(Область, ИмяПараметра, Значение)
	стрЗначение = Строка(Значение);
	Для Счетчик = 1 По СтрДлина(стрЗначение) Цикл
		Область.Параметры[ИмяПараметра + Счетчик] = Сред(стрЗначение, Счетчик, 1);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
