
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом.Сторона
	|ИЗ
	|	РегистрСведений.РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом КАК РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом
	|ГДЕ
	|	РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом.Контрагент = &Контрагент
	|	И РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом.Сторона <> &Сторона";
	
	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект.Контрагент);
	Запрос.УстановитьПараметр("Сторона", ТекущийОбъект.Сторона);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщить(СтрШаблон("Для контрагента %1 соответствие элементу справочника %2: %3", ТекущийОбъект.Контрагент.Наименование, Выборка.Сторона.Метаданные().Имя, Выборка.Сторона.Наименование));
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
