
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	CRM_СкрытьВАРМ = Ложь;
	
	Пользователь 					= ПараметрыСеанса.ТекущийПользователь;	
	Автор 							= Пользователь;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЭлектроннаяПочта = ДанныеЗаполнения.ОтправительАдрес;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(Контакт) Тогда
			Если ЗначениеЗаполнено(Телефон) Тогда
				Контакты = CRM_КлиентыСервер.НайтиПартнераПоКИ(Телефон, 1, Истина);
				Если Контакты.Количество()>0 Тогда
					Контакт = Контакты[0];
				КонецЕсли;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Контакт) И ЗначениеЗаполнено(ЭлектроннаяПочта) Тогда
				Контакты = CRM_КлиентыСервер.НайтиПартнераПоКИ(ЭлектроннаяПочта, 2, Истина);
				Если Контакты.Количество()>0 Тогда
					Контакт = Контакты[0];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Автор) Тогда
			Автор = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти