
#Область ОбработчикиСобытий

&НаКлиенте
// Процедура - обработчик выполнения команды.
//
// Параметры:
//	ПараметрКоманды				- Произвольный	- Параметр команды.
//	ПараметрыВыполненияКоманды	- Структура		- Параметры выполнения команды.
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОткрытьФорму("ОбщаяФорма.сфпОбщиеНастройки", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти

