#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	// Обзвон клиетов (для телемаркетинга).
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ОбзвонКлиентов.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 1;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Используется для обзвона списка клиентов по маркетинговой кампании';en='Used to call the list of customers for a marketing campaign'");
	Попытка
		СправочникОбъект.Записать();
	Исключение		 
	КонецПопытки;
	
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ПотеряОбращения.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 0;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	СправочникОбъект.Описание			= Нстр("ru='Потеря обращения';en='Loss of circulation'");
	Попытка
		СправочникОбъект.Записать();
	Исключение		 
	КонецПопытки;	
	
	НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	НовыйСправочник.Баллы				= 18;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru='Личная встреча';en='Personal meeting'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru='Личная встреча';en='Personal meeting'");
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru='Телефонный звонок клиенту';en='Phone call to customer'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru='Телефонный звонок клиенту';en='Phone call to customer'");
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru='Электронное письмо клиенту';en='Email to customer'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru='Электронное письмо клиенту';en='Email to customer'");
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	//НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	//НовыйСправочник.Баллы				= 0;	
	//НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	//НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	//НовыйСправочник.Наименование		= Нстр("ru='Личная встреча';en='Personal meeting'");
	//НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	//НовыйСправочник.Описание            = Нстр("ru='Личная встреча';en='Personal meeting'");
	//Попытка
	//	НовыйСправочник.Записать();
	//Исключение 
	//КонецПопытки;
	
	НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	НовыйСправочник.Баллы				= 0;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru='Входящий телефонный звонок';en='Incoming phone call'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	НовыйСправочник.Описание            = Нстр("ru='Входящий телефонный звонок';en='Incoming phone call'");
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	//НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	//НовыйСправочник.Баллы				= 0;	
	//НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	//НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	//НовыйСправочник.Наименование		= Нстр("ru='Входящее электронное письмо';en='The enter electronic letter'");
	//НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	//НовыйСправочник.Описание            = Нстр("ru='Входящее электронное письмо';en='The enter electronic letter'");
	//Попытка
	//	НовыйСправочник.Записать();
	//Исключение 
	//КонецПопытки;
		
	
КонецПроцедуры	

Функция ПолучитьАвтоСоздаваемыеПоСостояниюИнтереса(СостояниеИнтереса) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВидыВзаимодействий.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ВидыВзаимодействий КАК CRM_ВидыВзаимодействий
	                      |ГДЕ
	                      |	CRM_ВидыВзаимодействий.СостояниеИнтереса = &СостояниеИнтереса
	                      |	И CRM_ВидыВзаимодействий.ПланироватьАвтоматическиПриПереходеВСосотояние");
	Запрос.УстановитьПараметр("СостояниеИнтереса", СостояниеИнтереса);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли