
#Область ПрограммныйИнтерфейс

// Функция - Идентификатор текущего пользователя системы взаимодействия
// 
// Возвращаемое значение:
//  ИдентификаторПользователяСистемыВзаимодействия  - Идентифицирует пользователя системы взаимодействия.
// 
Функция ИдентификаторТекущегоПользователяСистемыВзаимодействия() Экспорт
	
	Возврат СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
	
КонецФункции

// функция возвращает подчиненные по иерерахии подразделения.
//
// Параметры:
//  ПодраздениеРодитель	 - СправочникСсылка	 - Подразделение
//  МассивПодразделений	 - Массив			 - формируемый рекурсивно массив.
// 
// Возвращаемое значение:
//  МассивПодразделений - Массив подразделений.
//
Функция ПолучитьПодчиненныеПодразделенияПользователя(ПодраздениеРодитель, МассивПодразделений) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Ссылка
	|ИЗ Справочник.СтруктураПредприятия
	|ГДЕ Родитель = &Родитель");
	Запрос.УстановитьПараметр("Родитель", ПодраздениеРодитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивПодразделений.Добавить(Выборка.Ссылка);
		ПолучитьПодчиненныеПодразделенияПользователя(Выборка.Ссылка, МассивПодразделений);
	КонецЦикла;
	
	Возврат МассивПодразделений; 
		
КонецФункции // ПолучитьПодчиненныеПодразделенияПользователя()

// функция возвращает массив подразделений, в которых пользователь - руководитель.
// 
// Параметры:
//	Пользователь	- СправочникСсылка	- Пользователь
//  ПодчиненныеПодразделения  - Булево - включаем подчиненные  по иерархии подразделения или нет.
//
// Возвращаемое значение:
//	МассивПодразделений	- Массив подразделений.
//
Функция ПолучитьПодразделенияВКоторыхРуководитель(Пользователь, ПодчиненныеПодразделения = Ложь) Экспорт
	
	МассивПодразделений = Новый Массив();
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Ссылка
	|ИЗ Справочник.СтруктураПредприятия
	|ГДЕ ТекущийРуководитель = &ТекущийРуководитель");
	Запрос.УстановитьПараметр("ТекущийРуководитель", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивПодразделений.Добавить(Выборка.Ссылка);
		Если ПодчиненныеПодразделения Тогда
			ПолучитьПодчиненныеПодразделенияПользователя(Выборка.Ссылка, МассивПодразделений);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПодразделений;
		
КонецФункции // ПолучитьПодразделенияВКоторыхРуководитель()

#КонецОбласти

