
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Представление "Дни"
	ТекстДни = "ВЫБОР";
	Для т = 1 По РЭЙ_СлужебныйСервер.ПолучитьСоответствиеПредставлениеДни().Количество() Цикл
		ТекстДни = ТекстДни + "
		|КОГДА Дни = " + т + "
		|	ТОГДА """ + РЭЙ_СлужебныйСервер.ПредставлениеДни(т) + """";
	КонецЦикла;
	ТекстДни = ТекстДни + "
	|ИНАЧЕ """"
	|КОНЕЦ КАК ПредставлениеДни";
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ПредставлениеДни", ТекстДни);
	
	//Представление "Дата старта таймера"
	ТекстДатаСтартаТаймера = "ВЫБОР";
	Для т = 1 По РЭЙ_СлужебныйСервер.ПолучитьСоответствиеПредставлениеДатаСтартаТаймера().Количество() Цикл
		ТекстДатаСтартаТаймера = ТекстДатаСтартаТаймера + "
		|КОГДА ДатаСтартаТаймера = " + т + "
		|	ТОГДА """ + РЭЙ_СлужебныйСервер.ПредставлениеДатаСтартаТаймера(т) + """";
	КонецЦикла;
	ТекстДатаСтартаТаймера = ТекстДатаСтартаТаймера + "
	|ИНАЧЕ """"
	|КОНЕЦ КАК ПредставлениеДатаСтартаТаймера";
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ПредставлениеДатаСтартаТаймера", ТекстДатаСтартаТаймера);
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ПоказатьПредупреждение(, "Из этой формы запрещено добавлять настройки сроков представления документов валютного контроля
				|Форма настройки сроков находится в меню ""Настройка - Сроки представления документов валютного контроля""!", 60);
				
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	ПоказатьПредупреждение(, "Из этой формы запрещено изменять настройку сроков представления документов валютного контроля
				|Форма настройки сроков находится в меню ""Настройка - Сроки представления документов валютного контроля""!", 60);
				
	Отказ = Истина;
КонецПроцедуры
