

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокСправочника" 
		И Параметр.Свойство("Отбор") И Параметр.Отбор.Свойство("Владелец")
		И ТипЗнч(Параметр.Отбор.Владелец) = Тип("СправочникСсылка.Партнеры") Тогда
		
			ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(
				ОбщегоНазначенияУТКлиентСервер.ПолучитьОтборДинамическогоСписка(Список), "Владелец");
			Если ЭлементыОтбора.Количество() > 0 
				И ЭлементыОтбора[0].ПравоеЗначение = Параметр.Отбор.Владелец Тогда
					Возврат;
			КонецЕсли;
		
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец",
			                         Параметр.Отбор.Владелец, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// +СофтФон

&НаКлиенте
// Процедура - обработчик команды формы "Позвонить".
//
Процедура Позвонить(Команда)
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.Добавить(ТД.Ссылка);
	сфпСофтФонПроКлиент.сфпПозвонитьВыбравТелефон(СписокОбъектов);
КонецПроцедуры // Позвонить()

// -СофтФон

#КонецОбласти
