#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура добавляет дополнительные команды печати. 
//
// Параметры:
//  КомандыПечати	 - ТаблицаЗначений - Таблица с описанием команд печати 
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Получает контакты для документов взаимодействий согласно списку 
//   участников маркетингового мероприятия
//
// Параметры:
//  Ссылка  - СправочникСсылка.МаргетинговыеМероприятие - мероприятие по которому получаются контакты
//
// Возвращаемое значение:
//   Массив   - массив, содержащий контакты
//
Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Результат = Новый Массив;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли