Функция ПолучитьДанныеДляПечати(КонтрактВЭД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_ГрафикПогашения.Период КАК Дата,
	|	РЭЙ_ГрафикПогашения.Сумма КАК Сумма,
	|	РЭЙ_ГрафикПогашения.ОсобоеУсловие КАК ОсобоеУсловие
	|ПОМЕСТИТЬ Тело
	|ИЗ
	|	РегистрСведений.РЭЙ_ГрафикПогашения КАК РЭЙ_ГрафикПогашения
	|ГДЕ
	|	РЭЙ_ГрафикПогашения.Договор = &КонтрактВЭД
	|	И РЭЙ_ГрафикПогашения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.РЭЙ_КредитыЗаймы.Тело)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РЭЙ_ГрафикПогашения.Период КАК Дата,
	|	РЭЙ_ГрафикПогашения.Сумма КАК Сумма,
	|	РЭЙ_ГрафикПогашения.ОсобоеУсловие КАК ОсобоеУсловие
	|ПОМЕСТИТЬ Проценты
	|ИЗ
	|	РегистрСведений.РЭЙ_ГрафикПогашения КАК РЭЙ_ГрафикПогашения
	|ГДЕ
	|	РЭЙ_ГрафикПогашения.Договор = &КонтрактВЭД
	|	И РЭЙ_ГрафикПогашения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.РЭЙ_КредитыЗаймы.Проценты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Тело.Дата, Проценты.Дата) КАК Период,
	|	ЕСТЬNULL(Тело.ОсобоеУсловие, Проценты.ОсобоеУсловие) КАК ОсобоеУсловие,
	|	Тело.Дата КАК ТелоДата,
	|	Тело.Сумма КАК ТелоСумма,
	|	Проценты.Дата КАК ПроцентыДата,
	|	Проценты.Сумма КАК ПроцентыСумма
	|ИЗ
	|	Тело КАК Тело
	|		ПОЛНОЕ СОЕДИНЕНИЕ Проценты КАК Проценты
	|		ПО Тело.Дата = Проценты.Дата
	|			И Тело.ОсобоеУсловие = Проценты.ОсобоеУсловие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("КонтрактВЭД", КонтрактВЭД);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("НомерСтроки");
	Таблица.Колонки.Добавить("ВалютаКод");
	Таблица.Колонки.Добавить("ВалютаНаименование");
	текНомерСтроки = 0;
	Для Каждого СтрокаТЧ Из Таблица Цикл
		текНомерСтроки = текНомерСтроки + 1;
		СтрокаТЧ.НомерСтроки = текНомерСтроки;
		СтрокаТЧ.ВалютаКод = КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов.Код;
		СтрокаТЧ.ВалютаНаименование = КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов.Наименование;
	КонецЦикла;
	
	Возврат Таблица;
КонецФункции
