
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму(ПолучитьимяФормы(), ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьимяФормы()
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ИспользоватьСтарыйИнтерфейс() Тогда
		Возврат "Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНовая";
	Иначе	
		Возврат "Обработка.CRM_МастерРегистрацииОбращения.Форма.Форма";
	КонецЕсли;	
КонецФункции	


#КонецОбласти
