
&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	ОткрытьФорму("Документ.АГ_ЗаявкаНаСозданиеИзменениеНовогоЭлементаНоменклатуры.ФормаОбъекта", Новый Структура("СоздаватьНоменклатуру, СоздаватьХарактеристику", Истина, Истина), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьХарактеристику(Команда)
	ОткрытьФорму("Документ.АГ_ЗаявкаНаСозданиеИзменениеНовогоЭлементаНоменклатуры.ФормаОбъекта", Новый Структура("СоздаватьНоменклатуру, СоздаватьХарактеристику", Ложь, Истина), ЭтаФорма);
КонецПроцедуры
