////////////////////////////////////////////////////////////////////////////////
// Лицензирование сервер (повт. исп)
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Функция создает и инициализирует защищенную обработку. В дальнейшем, в течении
//  сеанса, значение будет закешировано, и вызов будет возвращать тот же
//  экземпляр обработки
//  ИмяОбработки - строка с именем защищенной обработки
//  параметра лицензирования будет совпадать или превышать переданную в этом параметре
//  ОписаниеОшибки - возвращаемый параметр, содержит описание результата операции
//
// Параметры:
//  ВыводитьОшибки	 - Булево - Выводить ошибки.
// 
// Возвращаемое значение:
//  ВнешняяОбработка - Созданная обработка.
//
Функция ПолучитьЗащищеннуюОбработку(ВыводитьОшибки = Истина) Экспорт
	
	Возврат CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработкуКеш(ВыводитьОшибки);
	
КонецФункции // ПолучитьЗащищеннуюОбработку

#КонецОбласти

