#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	CRM_ОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	ЭтотОбъект.Статус				= Перечисления.CRM_СтатусыПланов.НаСогласование;
	ЭтотОбъект.ВариантПланирования	= Перечисления.CRM_ВариантыПланированияВоронки.Эталон;
	// ЭтотОбъект.УдалитьДатаНачалаДействия	= CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	ЭтотОбъект.ОбъектПланирования	= Перечисления.CRM_ОбъектыПланированияВоронкиПродаж.Менеджер;
	ЭтотОбъект.Менеджер				= ЭтотОбъект.Автор;
	ЭтотОбъект.Подразделение		= Справочники.СтруктураПредприятия.ПустаяСсылка();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Инициализация дополнительных свойств для проведения документа.
	CRM_ОбщегоНазначенияСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.CRM_ПланированиеВоронкиПродаж.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	CRM_ОбщегоНазначенияСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	CRM_ОбщегоНазначенияСервер.ОтразитьПланированиеВоронкиПродаж(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	CRM_ОбщегоНазначенияСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбъектПланирования = Перечисления.CRM_ОбъектыПланированияВоронкиПродаж.Менеджер Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Менеджер"));
	КонецЕсли;
	
	Если НЕ ОбъектПланирования = Перечисления.CRM_ОбъектыПланированияВоронкиПродаж.Подразделение Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Подразделение"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли