
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ПоказатьПредупреждение(, "Из этой формы запрещено добавлять настройки сроков представления документов валютного контроля
				|Форма настройки сроков находится в меню ""Настройка - Сроки представления документов валютного контроля""!");
				
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	ПоказатьПредупреждение(, "Из этой формы запрещено добавлять настройки сроков представления документов валютного контроля
				|Форма настройки сроков находится в меню ""Настройка - Сроки представления документов валютного контроля""!");
				
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для т = 1 по 8 Цикл
		ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Использование = Истина;
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Использование = Истина;
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДатаСтартаТаймера");
		Отбор = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаСтартаТаймера");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = т;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", РЭЙ_СлужебныйСервер.ПредставлениеДатаСтартаТаймера(т));
	КонецЦикла;
	
	Для т = 1 по 2 Цикл
		ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Использование = Истина;
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Использование = Истина;
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Дни");
		Отбор = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дни");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = т;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", РЭЙ_СлужебныйСервер.ПредставлениеДни(т));
	КонецЦикла;
КонецПроцедуры
