
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СвязаннаяГруппаПользователей") Тогда
		Запись.СвязаннаяГруппаПользователей = Параметры.СвязаннаяГруппаПользователей;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязаннаяГруппаПользователейПриИзменении(Элемент)
	Если Запись.СвязаннаяГруппаПользователей = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ВсеПользователи") Тогда
		Запись.СвязаннаяГруппаПользователей = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ПустаяСсылка");
		Сообщить("Данная группа пользователей не может быть выбрана!");
	КонецЕсли;	
КонецПроцедуры
