
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена	= Ложь;
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса 				= Ложь;
	
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки	= Ложь;
	
КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
// 
// Параметры:
//  ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                       см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                       описание возвращаемого значения.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	//ОписаниеВарианта.ПутьКФайлуКомплектаПравилНаПользовательскомСайте	= "https://users.v8.1c.ru/distribution/project/EnterpriseERP20";
	//ОписаниеВарианта.ПутьКФайлуКомплектаПравилВКаталогеШаблонов			= "\1c\enterprise";
	//ОписаниеВарианта.ИмяФайлаНастроекДляПриемника						= НСтр("ru='Синхронизация данных через универсальный формат';en='Data synchronization via universal format'");
	//ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными			= ИспользоватьПомощникСозданияОбменаДанными();
	//ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена				= ИспользуемыеТранспортыСообщенийОбмена();
	//ОписаниеВарианта.КраткаяИнформацияПоОбмену							= КраткаяИнформацияПоОбмену(ИдентификаторНастройки);
	//ОписаниеВарианта.ПодробнаяИнформацияПоОбмену						= ПодробнаяИнформацияПоОбмену(ИдентификаторНастройки);
	//ОписаниеВарианта.ЗначенияПоУмолчанию								= ЗначенияПоУмолчаниюНаУзле(ИдентификаторНастройки);
	//ОписаниеВарианта.ЗначенияПоУмолчаниюКорреспондента					= ЗначенияПоУмолчаниюНаУзлеБазыКорреспондента(ИдентификаторНастройки);
	//ОписаниеВарианта.Отборы												= НастройкаОтборовНаУзле(ИдентификаторНастройки);
	//ОписаниеВарианта.ОтборыКорреспондента           					= НастройкаОтборовНаУзлеБазыКорреспондента(ИдентификаторНастройки);
	//
	//Если ИдентификаторНастройки = "ОбменУниверсальный" Тогда
	//	
	//	ОписаниеВарианта.Вставить("ЗаголовокКомандыДляСозданияНовогоОбменаДанными", НСтр("ru='Другая программа';en='Another application'"));
	//	ОписаниеВарианта.Вставить("ЗаголовокПомощникаСозданияОбмена",               НСтр("ru='Настройка синхронизации данных через универсальный формат';en='Set up data synchronization using a universal format'"));
	//	ОписаниеВарианта.Вставить("ЗаголовокУзлаПланаОбмена",                       НСтр("ru='Синхронизация данных через универсальный формат';en='Data synchronization via universal format'"));
	//	ОписаниеВарианта.Вставить("НаименованиеКонфигурацииКорреспондента",         НСтр("ru='Другая программа';en='Another application'"));
	//	
	//Иначе
	//	
	//	ОписаниеВарианта.Вставить("НаименованиеКонфигурацииКорреспондента",         НСтр("ru='Через универсальный формат обмена';en='Via universal exchange format'"));
	//	
	//КонецЕсли;

КонецПроцедуры

	