#Область СлужебныеПроцедурыИФункции

Функция ИмяФормыНастройкиРасчетаРезервовОтпусков() Экспорт

	Возврат "ОбщаяФорма.ОрганизацияНастройкиРасчетаРезервовОтпусков";

КонецФункции

Процедура СправкаПоОтпускам(Форма, МассивСотрудников) Экспорт
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.НачислениеОценочныхОбязательствПоОтпускам",
		"ПФ_MXL_СправкаПоОтпускамСотрудника",
		МассивСотрудников,
		Форма,
		Новый Структура("ПериодРегистрации", Форма.Объект.ПериодРегистрации));
	
КонецПроцедуры

Функция ОткрытьФормуВводаСреднегоЗаработкаОбщий(Форма, Сотрудник, ПериодРасчетаСреднегоЗаработкаНачало, ПериодРасчетаСреднегоЗаработкаОкончание) Экспорт

	ОписаниеОбъекта = Новый Структура;
	ОписаниеОбъекта.Вставить("Ссылка",            Форма.Объект.Ссылка);
	ОписаниеОбъекта.Вставить("Организация",       Форма.Объект.Организация);
	ОписаниеОбъекта.Вставить("ПериодРегистрации", Форма.Объект.ПериодРегистрации);
	ОписаниеОбъекта.Вставить("Сотрудник",         Сотрудник);
	ОписаниеОбъекта.Вставить("ДатаНачала",        ПериодРасчетаСреднегоЗаработкаНачало);
	ОписаниеОбъекта.Вставить("ДатаОкончания",     ПериодРасчетаСреднегоЗаработкаОкончание);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьСреднийЗаработокЗавершение", Форма);

	ПараметрыРедактирования = РезервОтпусковРасширенныйВызовСервера.ПараметрыРедактированияСреднегоЗаработка(ОписаниеОбъекта);
	УчетСреднегоЗаработкаКлиент.ОткрытьФормуВводаСреднегоЗаработкаОбщий(ПараметрыРедактирования, Форма, Оповещение);

КонецФункции

#КонецОбласти
