
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) И Параметры.ТекущаяСтрока.НеДействует Тогда
		ОтборПоСостояниюДокумента = "Все";
	Иначе
		ОтборПоСостояниюДокумента = "Действующие";
	КонецЕсли;
	ОтборПоСостояниюДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСостояниюДокументаПриИзменении(Элемент)
	ОтборПоСостояниюДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПоСостояниюДокументаПриИзмененииНаСервере()
	Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = ОтборПоСостояниюДокумента Тогда
			ЭлементОтбора.Использование = Истина;
		Иначе
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
