
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
#Если ВебКлиент Тогда
	ТекстПредложения = НСтр("ru='Для открытия анкеты необходимо установить расширение для работы с файлами в Веб-клиенте.';en='Open the questionnaire, you must install an extension to work with files in the Web customer.'");
	Результат = ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(Неопределено, ТекстПредложения);
	
	Если Результат = "НеПодключено" Тогда
			ТекстСообщения = НСтр("ru='Действие недоступно, так как не подключено расширение работы с файлами в Веб-клиенте.';en='Action are inaccessible, as the extension of operation with files in the Web customer are not connected.'")
	ИначеЕсли Результат = "НеподдерживаемыйВебКлиент" Тогда
		ТекстСообщения = НСтр("ru='Действие недоступно в используемом Веб-клиенте, так как для него не может быть подключено расширение работы с файлами.';en='Action are inaccessible in an used Web customer as for it the extension of operation with files could not be connected.'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
	Если Результат <> "Подключено" Тогда
		Возврат;
	КонецЕсли;
#КонецЕсли

	АдресХранилища = ПолучитьАдресМакетаНаСервере();
    ИмяФайла = "Заявка на получение модуля CRM.xls";
	ПолучитьФайл(АдресХранилища, ИмяФайла, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьАдресМакетаНаСервере()
	Макет = ПолучитьОбщийМакет("CRM_ЗаявкаНаПолучениеМодуляCRM");
	Возврат ПоместитьВоВременноеХранилище(Макет);
КонецФункции

#КонецОбласти

