
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ШаблонОповещения = Ложь;
	Для каждого ЭлементОтбора из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ШаблонОповещения") Тогда
			ШаблонОповещения = ЭлементОтбора.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	ЭтотОбъект.Заголовок = ?(ШаблонОповещения,НСтр("ru='Шаблоны e-mail рассылки (Для оповещений)';en='Newsletter Templates (for alerts)'"),НСтр("ru='Шаблоны e-mail рассылки (Для рассылок)';en='Newsletter Templates (For newsletters)'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И НЕ Группа Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ШаблонОповещения",ШаблонОповещения);
		ОткрытьФорму("Справочник.CRM_ШаблоныРассылки.ФормаОбъекта",ПараметрыФормы,Элементы.Список);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

