////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	Если Параметры.Свойство("ИзменитьВидОперации") Тогда
		ИзменитьВидОперации = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	СтрокаТаблицы = Элементы.СписокВидовОпераций.ТекущиеДанные;
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		
		ОткрытьДокументВида(СтрокаТаблицы.Значение);
		
	КонецЕсли; 
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;
	Основание = Параметры.Основание;
	
	Параметры.ЗначениеКопирования	= Неопределено;
	Параметры.ЗначенияЗаполнения	= Неопределено;
	Параметры.Основание				= Неопределено;
	
	//ФормыДокумента   = Новый ФиксированноеСоответствие(
	//	Документы.РеализацияТоваровУслуг.ПолучитьСоответствиеВидовОперацийФормам());
		
	ВидыОпераций = ПолучитьСписокВидовОпераций();
	Для Каждого ВидОперации Из ВидыОпераций Цикл
		НоваяОперация = СписокВидовОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяОперация, ВидОперации);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		ВыделенныйЭлементСписка = СписокВидовОпераций.НайтиПоЗначению(Объект.ВидОперации);
		Если ВыделенныйЭлементСписка <> Неопределено Тогда
			Элементы.СписокВидовОпераций.ТекущаяСтрока = ВыделенныйЭлементСписка.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВидовОпераций()
	СписокВидовОпераций = Новый СписокЗначений;
	
	СписокВидовОпераций.Добавить(Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_7_1_ВнесениеИзмененийВРаздел1ВБК, Метаданные.Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗначенияПеречисления.пункт181_7_1_ВнесениеИзмененийВРаздел1ВБК.Синоним);
	СписокВидовОпераций.Добавить(Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_2_25_ИзменениеКодовВидовОпераций, Метаданные.Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗначенияПеречисления.пункт181_2_25_ИзменениеКодовВидовОпераций.Синоним);
	СписокВидовОпераций.Добавить(Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_17_4_ПредоставлениеВБК, Метаданные.Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗначенияПеречисления.пункт181_17_4_ПредоставлениеВБК.Синоним);
	СписокВидовОпераций.Добавить(Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_6_1_СнятиеСУчетаКонтракта, Метаданные.Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗначенияПеречисления.пункт181_6_1_СнятиеСУчетаКонтракта.Синоним);
	
	Возврат СписокВидовОпераций;
КонецФункции

&НаКлиенте
Процедура СписокВидовОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = СписокВидовОпераций.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОткрытьДокументВида(СтрокаТаблицы.Значение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументВида(ВыбранныйВидОперации)
	
	ЗначенияЗаполнения.Вставить("ВидОперации",			ВыбранныйВидОперации);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ",                Параметры.Ключ);
	СтруктураПараметров.Вставить("ЗначениеКопирования", ЗначениеКопирования);
	СтруктураПараметров.Вставить("ЗначенияЗаполнения",  ЗначенияЗаполнения);
	СтруктураПараметров.Вставить("Основание",           Основание);
	Если ИзменитьВидОперации И ВыбранныйВидОперации <> Объект.ВидОперации Тогда
		СтруктураПараметров.Вставить("ИзменитьВидОперации", ИзменитьВидОперации);
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть();
	
	ОткрытьФорму("Документ.РЭЙ_ЗаявлениеВБанкПС.Форма.ФормаДокумента", СтруктураПараметров, ВладелецФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Параметры.Ключ.Пустая() Тогда 
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Ключ",   Параметры.Ключ);
		
		ОткрытьФорму("Документ.РЭЙ_ЗаявлениеВБанкПС.Форма.ФормаДокумента", СтруктураПараметров, ВладелецФормы);
		
		Отказ = Истина;
		
	КонецЕсли;	
	
	Если ЗначенияЗаполнения.Количество() > 0 Тогда 
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗначенияЗаполнения",   ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.РЭЙ_ЗаявлениеВБанкПС.Форма.ФормаДокумента", СтруктураПараметров, ВладелецФормы);
		
		Отказ = Истина;

	КонецЕсли;	
	
КонецПроцедуры
