Функция ПолучитьНомерПункта(текЭлемент) Экспорт
	Результат = "";
	Если ЗначениеЗаполнено(текЭлемент) Тогда
		Если ТипЗнч(текЭлемент) = Тип("ПеречислениеСсылка.РЭЙ_ОснованияЗакрытияПС") Тогда
			Результат = текЭлемент.Метаданные().ЗначенияПеречисления.Получить(Перечисления.РЭЙ_ОснованияЗакрытияПС.Индекс(текЭлемент)).Имя;
			Результат = СтрЗаменить(Результат, "пункт_", "");
			Результат = СтрЗаменить(Результат, "пункт181_", "");
			Результат = СтрЗаменить(Результат, "_", ".");
		ИначеЕсли ТипЗнч(текЭлемент) = Тип("Строка") Тогда
			ПозицияПробела = Найти(текЭлемент, " ");
			Результат = Сред(текЭлемент, 1, ПозицияПробела - 1);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
