#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

Процедура СоздатьЭлементыПоУмолчанию() Экспорт
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Бухгалтер'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Генеральный директор'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Главный бухгалтер'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Директор'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Коммерческий директор'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Менеджер по закупкам'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Менеджер по продажам'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Руководитель отдела продаж'");
	НовыйЭлемент.Записать();
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли