Процедура ПриЗаписи(Отказ, Замещение)
	Если Отбор.Найти("Договор") <> Неопределено Тогда
		КонтрактВЭД = Отбор.Договор.Значение;
		
		Если Не КонтрактВЭД.КонтрактБезСуммы Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РЭЙ_ДопСоглашения.Договор,
			|	СУММА(РЭЙ_ДопСоглашения.Сумма) КАК Сумма
			|ИЗ
			|	РегистрСведений.РЭЙ_ДопСоглашения КАК РЭЙ_ДопСоглашения
			|ГДЕ
			|	РЭЙ_ДопСоглашения.Договор = &Договор
			|
			|СГРУППИРОВАТЬ ПО
			|	РЭЙ_ДопСоглашения.Договор";
			
			Запрос.УстановитьПараметр("Договор", КонтрактВЭД);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Сумма > КонтрактВЭД.КонтрактСумма Тогда
					текДатаОтсчета = ТекущаяДата();
					текСумма = Выборка.Сумма;
					
					РЭЙ_ЗадачиСервер.СоздатьЗадачуЗаявлениеВБанкПС_ПревышениеСуммы(КонтрактВЭД, текДатаОтсчета, текСумма);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РЭЙ_ДопСоглашения.Договор,
		|	МАКСИМУМ(РЭЙ_ДопСоглашения.ДатаОкончанияКонтракта) КАК ДатаОкончанияКонтракта
		|ИЗ
		|	РегистрСведений.РЭЙ_ДопСоглашения КАК РЭЙ_ДопСоглашения
		|ГДЕ
		|	РЭЙ_ДопСоглашения.Договор = &Договор
		|
		|СГРУППИРОВАТЬ ПО
		|	РЭЙ_ДопСоглашения.Договор";
		
		Запрос.УстановитьПараметр("Договор", КонтрактВЭД);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ДатаОкончанияКонтракта > КонтрактВЭД.КонтрактДатаОкончания Тогда
				РЭЙ_ЗадачиСервер.СоздатьЗадачуЗаявлениеВБанкПС_ПревышениеСрока(КонтрактВЭД);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
