#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыОбновлениянформационнойБазы

Процедура ЗаполнитьПараметрыДоступаПриОбновлении() Экспорт
	Выборка = Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектУчетнойЗаписи = Выборка.ПолучитьОбъект();
		ОбъектУчетнойЗаписи.ТипМессенджера = "ВКонтакте";
		ПараметрыДоступа = Новый Структура;
		ПараметрыДоступа.Вставить("Токен", ОбъектУчетнойЗаписи.УдалитьТокен);
		ПараметрыДоступа.Вставить("ТокенГруппы", ОбъектУчетнойЗаписи.УдалитьТокенГруппы);
		ПараметрыДоступа.Вставить("IDГруппы", ОбъектУчетнойЗаписи.УдалитьIDГруппы);
		ОбъектУчетнойЗаписи.ХранилищеПараметровДоступа = Новый ХранилищеЗначения(ПараметрыДоступа);
		ОбъектУчетнойЗаписи.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
