#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СписокЗаданий = Новый Массив;
	Если ЗначениеЗаполнено(УникальныйИдентификаторЗадания) Тогда
		СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(Новый Структура("Ключ", УникальныйИдентификаторЗадания));
	КонецЕсли;
	Если Не ПометкаУдаления Тогда
		Если СписокЗаданий.Количество() = 0 Тогда
			ПараметрыЗадания = Новый Структура("Использование", Истина);
			ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.CRM_ОжиданиеСобытийМессенджера);
			УникальныйИдентификаторЗадания = Строка(Новый УникальныйИдентификатор);
			ПараметрыЗадания.Вставить("Ключ", УникальныйИдентификаторЗадания);
			ПараметрыЗадания.Вставить("Наименование", "Ожидание событий: "+ТипМессенджера+" "+Наименование);
			ПараметрыВыполненияЗадания = Новый Массив;
			ПараметрыВыполненияЗадания.Добавить(УникальныйИдентификаторЗадания);
			ПараметрыВыполненияЗадания.Добавить(ТипМессенджера);
			ПараметрыЗадания.Вставить("Параметры", ПараметрыВыполненияЗадания);
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ПериодПовтораДней = 1;
			Расписание.ПериодПовтораВТечениеДня = 60;
			ПараметрыЗадания.Вставить("Расписание", Расписание);
			РегламентноеЗадание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		Иначе	
			Для Каждого Задание Из СписокЗаданий Цикл
				ПараметрыЗадания = Новый Структура("Использование", НЕ ПометкаУдаления);
				ПараметрыВыполненияЗадания = Новый Массив;
				ПараметрыВыполненияЗадания.Добавить(УникальныйИдентификаторЗадания);
				ПараметрыВыполненияЗадания.Добавить(ТипМессенджера);
				ПараметрыЗадания.Вставить("Параметры", ПараметрыВыполненияЗадания);
				РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если СписокЗаданий.Количество() > 0 Тогда
			РегламентныеЗаданияСервер.УдалитьЗадание(СписокЗаданий[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	УникальныйИдентификаторЗадания = "";
КонецПроцедуры

#КонецОбласти


#КонецЕсли
