
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Запись.ИмяРеквизита = "CRM_ОсновнаяОтрасль" или
		Запись.ИмяРеквизита = "CRM_СегментРынка" или
		Запись.ИмяРеквизита = "CRM_Важность" или
		Запись.ИмяРеквизита = "CRM_ЧисленностьСотрудников" или
		Запись.ИмяРеквизита = "CRM_СтатусРаботы" или
		Запись.ИмяРеквизита = "CRM_ЧисленностьРабочихМест" Тогда
		Элементы.ИмяРеквизита.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти
