&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕстьСправочникПодразделения = Метаданные.Справочники.Найти("ПодразделенияОрганизаций") <> Неопределено;
	Элементы.ПодразделениеОрганизации.ТолькоПросмотр = Не ЕстьСправочникПодразделения;

	УстановитьДоступность();
КонецПроцедуры 

&НаКлиенте
Процедура ПодразделениеОрганизацииПриИзменении(Элемент)
	ПодразделениеОрганизацииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеОрганизацииПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
		Объект.КПП = Объект.ПодразделениеОрганизации.КПП;
	Иначе
		Объект.КодПоОКАТО = "";
		Объект.КПП = "";
	КонецЕсли;
	
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	Если ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
		Элементы.КодПоОКАТО.ТолькоПросмотр = Истина;
		Элементы.КПП.ТолькоПросмотр = Истина;
	Иначе
		Элементы.КодПоОКАТО.ТолькоПросмотр = Ложь;
		Элементы.КПП.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры



