
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДоговорКонтрагента") Тогда
		КонтрактВЭД = РЭЙ_СлужебныйСервер.ПолучитьКонтрактВЭДПоДоговоруКонтрагента(Параметры.ДоговорКонтрагента);
		РамочныйДоговор = КонтрактВЭД.ДоговорКонтрагента;
		ПаспортСделки = РЭЙ_СлужебныйСервер.ПолучитьПаспортСделкиПоКонтрактуВЭД(КонтрактВЭД);
		
		Элементы.ДекорацияРамочныйДоговор.Заголовок = РамочныйДоговор;
		Элементы.ДекорацияКонтрактВЭД.Заголовок = КонтрактВЭД;
		Если ЗначениеЗаполнено(ПаспортСделки) Тогда
			Элементы.ДекорацияПаспортСделки.Заголовок = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(ПаспортСделки);
		Иначе
			Элементы.ДекорацияПаспортСделки.Видимость = Ложь;
			Элементы.ДекорацияТекст4.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРамочныйДоговорНажатие(Элемент)
	ПоказатьЗначение(, РамочныйДоговор);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКонтрактВЭДНажатие(Элемент)
	ПоказатьЗначение(, КонтрактВЭД);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПаспортСделкиНажатие(Элемент)
	ПоказатьЗначение(, ПаспортСделки);
КонецПроцедуры
