
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьПараметрыПодключения(Команда)
	серверСохранитьПараметрыПодключения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура серверСохранитьПараметрыПодключения()
	сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпФорматСообщений", Объект.ФорматОбмена);
	сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпТипИспользуемогоКоннектораESB", Объект.ТипКоннектора);
	Если Объект.ТипКоннектора = Перечисления.сшпТипыКоннекторовESB.SOAP тогда 
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпАдресАдаптераESB", "http://" + Объект.СерверАдаптеров + "/adapters/" + Объект.ИмяАдаптера + "/send");
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпИмяСервисаESB", "IngoingService1C");
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпИмяТочкиПодключенияESB", "BasicHttpBinding_IIngoingService1C");
	ИначеЕсли Объект.ТипКоннектора = Перечисления.сшпТипыКоннекторовESB.REST тогда
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпАдресАдаптераESB", Объект.СерверАдаптеров + "/adapters/");
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпИмяСервисаESB", Объект.ИмяАдаптера + "/in");
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпИмяТочкиПодключенияESB", "/send");
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти
