
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕстьЗаписи	= Параметры.ЕстьЗаписи;
КонецПроцедуры

#Область ОбработчикиКомандИРеквизитовФормы

&НаКлиенте
Процедура ОК(Команда)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Сегмент",						Сегмент);
	СтруктураВозврата.Вставить("ВидКонтактнойИнформации",		ВидКонтактнойИнформации);
	СтруктураВозврата.Вставить("НеЗаполнятьСПустымиАдресами",	НеЗаполнятьСПустымиАдресами);
	СтруктураВозврата.Вставить("ТолькоОсновныеКонтактныеЛица",	ТолькоОсновныеКонтактныеЛица);
	СтруктураВозврата.Вставить("ОчищатьТЧ",						Ложь);
	Если ЕстьЗаписи Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОКЗавершение", ЭтотОбъект, СтруктураВозврата);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Табличная часть уже содержит записи. 
								|Очистить табличную часть?'"), РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура ОКЗавершение(Ответ, СтруктураВозврата) Экспорт
	Если Ответ <> КодВозвратаДиалога.Отмена Тогда
		СтруктураВозврата.ОчищатьТЧ = (Ответ = КодВозвратаДиалога.Да);
		Закрыть(СтруктураВозврата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#КонецОбласти
