
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьТаблицу();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицу()
	
	Результат.Очистить();
	
	ТабДок = Результат;
	
	Запрос = Новый Запрос;
	
	Если ТипОтчета = "Внутр" Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Склад КАК Склад,
		|	СУММА(ВложенныйЗапрос.ОстатокНаСкладе) КАК НаСкладе,
		|	СУММА(ВложенныйЗапрос.ОстатокВПути) КАК ВПути,
		|	ВложенныйЗапрос.ОстатокНаСкладе + ВложенныйЗапрос.ОстатокВПути КАК Всего
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|		СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ОстатокНаСкладе,
		|		ТоварыНаСкладахОстатки.Склад КАК Склад,
		|		0 КАК ОстатокВПути
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				Номенклатура = &СписокНоменклатур
		|					И Склад В
		|						(ВЫБРАТЬ
		|							СкладыУправленияЗапасамиТаблицаСкладов.Ссылка КАК Склад
		|						ИЗ
		|							Справочник.Склады КАК СкладыУправленияЗапасамиТаблицаСкладов
		|						ГДЕ
		|							НЕ СкладыУправленияЗапасамиТаблицаСкладов.ПометкаУдаления
		|							И СкладыУправленияЗапасамиТаблицаСкладов.Подразделение = &Металлоцентр)) КАК ТоварыНаСкладахОстатки
		|	ГДЕ
		|		НЕ ТоварыНаСкладахОстатки.ВНаличииОстаток = 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТоварыНаСкладахОстатки.Номенклатура,
		|		ТоварыНаСкладахОстатки.Склад
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыПоставщикамОстатки.Номенклатура,
		|		0,
		|		ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад,
		|		СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток)
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
		|				,
		|				Номенклатура = &СписокНоменклатур
		|					И ЗаказПоставщику.Склад В
		|						(ВЫБРАТЬ
		|							СкладыУправленияЗапасамиТаблицаСкладов.Ссылка КАК Склад
		|						ИЗ
		|							Справочник.Склады КАК СкладыУправленияЗапасамиТаблицаСкладов
		|						ГДЕ
		|							НЕ СкладыУправленияЗапасамиТаблицаСкладов.ПометкаУдаления
		|							И СкладыУправленияЗапасамиТаблицаСкладов.Подразделение = &Металлоцентр)) КАК ЗаказыПоставщикамОстатки
		|	ГДЕ
		|		ЗаказыПоставщикамОстатки.ЗаказаноОстаток <> 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказыПоставщикамОстатки.Номенклатура,
		|		ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Склад,
		|	ВложенныйЗапрос.ОстатокНаСкладе + ВложенныйЗапрос.ОстатокВПути
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Склад.Наименование,
		|	ВложенныйЗапрос.Номенклатура.Наименование
		|ИТОГИ
		|	СУММА(НаСкладе),
		|	СУММА(ВПути),
		|	СУММА(Всего)
		|ПО
		|	Склад";
		
		Запрос.УстановитьПараметр("типЦенВнутр", ТипЦенВнутр);
		Запрос.УстановитьПараметр("ТипЦенМин", ТипЦенМин);
		Запрос.УстановитьПараметр("ТипЦенМРЦ", ТипЦенМРЦ);
		Запрос.УстановитьПараметр("Металлоцентр", Металлоцентр);
		Запрос.УстановитьПараметр("СписокНоменклатур", СписНоменклатуры);
		
	ИначеЕсли ТипОтчета = "Внеш" Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Склад КАК Склад,
		|	СУММА(ВложенныйЗапрос.ОстатокНаСкладе) КАК НаСкладе,
		|	СУММА(ВложенныйЗапрос.ОстатокВПути) КАК ВПути,
		|	ВложенныйЗапрос.ОстатокНаСкладе + ВложенныйЗапрос.ОстатокВПути КАК Всего
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|		СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ОстатокНаСкладе,
		|		ТоварыНаСкладахОстатки.Склад КАК Склад,
		|		0 КАК ОстатокВПути
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				Номенклатура = &СписокНоменклатур
		|					И Склад В
		|						(ВЫБРАТЬ
		|							СкладыУправленияЗапасамиТаблицаСкладов.Ссылка КАК Склад
		|						ИЗ
		|							Справочник.Склады КАК СкладыУправленияЗапасамиТаблицаСкладов
		|						ГДЕ
		|							НЕ СкладыУправленияЗапасамиТаблицаСкладов.Ссылка.ПометкаУдаления
		|							И СкладыУправленияЗапасамиТаблицаСкладов.Подразделение = &Металлоцентр)) КАК ТоварыНаСкладахОстатки
		|	ГДЕ
		|		НЕ ТоварыНаСкладахОстатки.ВНаличииОстаток = 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТоварыНаСкладахОстатки.Номенклатура,
		|		ТоварыНаСкладахОстатки.Склад
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыПоставщикамОстатки.Номенклатура,
		|		0,
		|		ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад,
		|		СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток)
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
		|				,
		|				Номенклатура = &СписокНоменклатур
		|					И ЗаказПоставщику.Склад В
		|						(ВЫБРАТЬ
		|							СкладыУправленияЗапасамиТаблицаСкладов.Ссылка КАК Склад
		|						ИЗ
		|							Справочник.Склады КАК СкладыУправленияЗапасамиТаблицаСкладов
		|						ГДЕ
		|							НЕ СкладыУправленияЗапасамиТаблицаСкладов.Ссылка.ПометкаУдаления
		|							И СкладыУправленияЗапасамиТаблицаСкладов.Подразделение = &Металлоцентр)) КАК ЗаказыПоставщикамОстатки
		|	ГДЕ
		|		ЗаказыПоставщикамОстатки.ЗаказаноОстаток <> 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказыПоставщикамОстатки.Номенклатура,
		|		ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Склад,
		|	ВложенныйЗапрос.ОстатокНаСкладе + ВложенныйЗапрос.ОстатокВПути
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Склад.Наименование,
		|	ВложенныйЗапрос.Номенклатура.Наименование
		|ИТОГИ
		|	СУММА(НаСкладе),
		|	СУММА(ВПути),
		|	СУММА(Всего)
		|ПО
		|	Склад";
		
		Запрос.УстановитьПараметр("ТипЦенВнеш", ТипЦенВнеш);
		Запрос.УстановитьПараметр("СписокНоменклатур", СписНоменклатуры);
		Запрос.УстановитьПараметр("Металлоцентр", Металлоцентр);
		
	ИначеЕсли ТипОтчета = "ФормВнешЦенПоСкладам" Тогда	
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Склад КАК Склад,
		|	СУММА(ВложенныйЗапрос.ОстатокНаСкладе) КАК НаСкладе,
		|	СУММА(ВложенныйЗапрос.ОстатокВПути) КАК ВПути,
		|	ВложенныйЗапрос.ОстатокНаСкладе + ВложенныйЗапрос.ОстатокВПути КАК Всего
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|		СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ОстатокНаСкладе,
		|		ТоварыНаСкладахОстатки.Склад КАК Склад,
		|		0 КАК ОстатокВПути
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				Номенклатура = &СписокНоменклатур
		|					И Характеристика = &Характеристика
		|					И Склад В
		|						(ВЫБРАТЬ
		|							СкладыУправленияЗапасамиТаблицаСкладов.Ссылка КАК Склад
		|						ИЗ
		|							Справочник.Склады КАК СкладыУправленияЗапасамиТаблицаСкладов
		|						ГДЕ
		|							НЕ СкладыУправленияЗапасамиТаблицаСкладов.Ссылка.ПометкаУдаления
		|							И СкладыУправленияЗапасамиТаблицаСкладов.Подразделение = &Металлоцентр)) КАК ТоварыНаСкладахОстатки
		|	ГДЕ
		|		НЕ ТоварыНаСкладахОстатки.ВНаличииОстаток = 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТоварыНаСкладахОстатки.Номенклатура,
		|		ТоварыНаСкладахОстатки.Склад
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыПоставщикамОстатки.Номенклатура,
		|		0,
		|		ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад,
		|		СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток)
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
		|				,
		|				Номенклатура = &СписокНоменклатур
		|					И Характеристика = &Характеристика
		|					И ЗаказПоставщику.Склад В
		|						(ВЫБРАТЬ
		|							СкладыУправленияЗапасамиТаблицаСкладов.Ссылка КАК Склад
		|						ИЗ
		|							Справочник.Склады КАК СкладыУправленияЗапасамиТаблицаСкладов
		|						ГДЕ
		|							НЕ СкладыУправленияЗапасамиТаблицаСкладов.Ссылка.ПометкаУдаления
		|							И СкладыУправленияЗапасамиТаблицаСкладов.Подразделение = &Металлоцентр)) КАК ЗаказыПоставщикамОстатки
		|	ГДЕ
		|		ЗаказыПоставщикамОстатки.ЗаказаноОстаток <> 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказыПоставщикамОстатки.Номенклатура,
		|		ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Склад,
		|	ВложенныйЗапрос.ОстатокНаСкладе + ВложенныйЗапрос.ОстатокВПути
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Склад.Наименование,
		|	ВложенныйЗапрос.Номенклатура.Наименование
		|ИТОГИ
		|	СУММА(НаСкладе),
		|	СУММА(ВПути),
		|	СУММА(Всего)
		|ПО
		|	Склад";
		
		Запрос.УстановитьПараметр("СписокНоменклатур", СписНоменклатуры);
		Запрос.УстановитьПараметр("Металлоцентр", Металлоцентр);
		Запрос.УстановитьПараметр("Характеристика", текХарактеристика);
		
		
	ИначеЕсли ТипОтчета = "ФормВнешЦен" Тогда
		
		ЭтаФорма.Заголовок = "Состав номенклатуры";
		ЗаполнитьРасшифровкуВнешнихЦен();
		Возврат;
		
	ИначеЕсли ТипОтчета = "РасшифровкаКалькуляции" Тогда
		
		ЭтаФорма.Заголовок = "Порядок расчета внешней цены";
		ЗаполнитьРасшифровкуКалькуляции();
		Возврат;
		
	ИначеЕсли ТипОтчета = "РасшифровкаЦеныСУчетомФакторов" Тогда
		
		ЭтаФорма.Заголовок = "Порядок расчета скидки (наценки) по отклонению от нормативных остатков и скорости продаж";
		ЗаполнитьРасшифровкуКалькуляции();
		Возврат;	
	Конецесли;
	
	РезультатаЗапроса = Запрос.Выполнить();
	Если РезультатаЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ДокОбъект.ПолучитьМакет("МакетНулевыеЦены");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластЬМакета.Параметры.Номенклатура = Строка(СписНоменклатуры) + " (" + Строка(текХарактеристика) + "):";
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьМакета);
	
	ВыборкаСклад = РезультатаЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВПути = 0;
	НаСкладе = 0;
	Всего = 0;
	
	Пока ВыборкаСклад.Следующий() Цикл
		Областьмакета = Макет.ПолучитьОбласть("СтрокаСклад");
		ОбластьМакета.Параметры.Заполнить(ВыборкаСклад);
		
		ТабДок.Вывести(ОбластьМакета);
		
		ВПути = ВПути + ВыборкаСклад.ВПути;
		НаСкладе = НаСкладе + ВыборкаСклад.НаСкладе;
		Всего = Всего + ВыборкаСклад.Всего;
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ВПути = ВПути;
	ОбластьМакета.параметры.НаСкладе = НаСкладе;
	ОбластьМакета.Параметры.Всего = Всего;
	
	ТабДок.Вывести(ОбластьМакета);
	
	Если ТипОтчета = "ФормВнешЦен" Тогда
		
		Областьмакета = макет.ПолучитьОбласть("Приписка");
		ТабДок.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ТабДок.МасштабПечати = 80;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуВнешнихЦен()
	
	ТабДок = Результат;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ДокОбъект.ПолучитьМакет("МакетРасшифровкаВнешнихЦен");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластЬМакета.Параметры.Номенклатура = СписНоменклатуры;
	ТабДок.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос.ОстатокНаСкладе) КАК НаСкладе,
	|	СУММА(ВложенныйЗапрос.ОстатокВПути) КАК ВПути,
	|	ВложенныйЗапрос.ОстатокНаСкладе + ВложенныйЗапрос.ОстатокВПути КАК Остаток,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК ЦеноваяКатегория,
	|	АГ_ПараметрыЦенообразования.ЦеновойКоридор КАК Наценка,
	|	АГ_ПараметрыЦенообразования.ИзмерениеНаценки КАК ИзмерениеНаценки,
	|	АГ_ПараметрыЦенообразования.УценочнаяСкидка КАК УценочнаяСкидка,
	|	АГ_ПараметрыЦенообразования.ИзмерениеСкидки КАК ИзмерениеСкидки,
	|	АГ_ПараметрыЦенообразования.ОбязательнаяСкидка КАК ОбязательнаяСкидка,
	|	АГ_ПараметрыЦенообразования.ИзмерениеОС КАК ИзмерениеОС,
	|	АГ_ПараметрыЦенообразования.ПлановаяНаценка КАК ПлановаяНаценка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|		СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ОстатокНаСкладе,
	|		0 КАК ОстатокВПути,
	|		ТоварыНаСкладахОстатки.Характеристика КАК Характеристика
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				Номенклатура = &СписокНоменклатур
	|					И Склад В
	|						(ВЫБРАТЬ
	|							СкладыУправленияЗапасамиТаблицаСкладов.Ссылка КАК Склад
	|						ИЗ
	|							Справочник.Склады КАК СкладыУправленияЗапасамиТаблицаСкладов
	|						ГДЕ
	|							НЕ СкладыУправленияЗапасамиТаблицаСкладов.Ссылка.ПометкаУдаления
	|							И СкладыУправленияЗапасамиТаблицаСкладов.Подразделение = &Металлоцентр)) КАК ТоварыНаСкладахОстатки
	|	ГДЕ
	|		НЕ ТоварыНаСкладахОстатки.ВНаличииОстаток = 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Номенклатура,
	|		ТоварыНаСкладахОстатки.Характеристика
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказыПоставщикамОстатки.Номенклатура,
	|		0,
	|		СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток),
	|		ЗаказыПоставщикамОстатки.Характеристика
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				,
	|				Номенклатура = &СписокНоменклатур
	|					И ЗаказПоставщику.Склад В
	|						(ВЫБРАТЬ
	|							СкладыУправленияЗапасамиТаблицаСкладов.Ссылка КАК Склад
	|						ИЗ
	|							Справочник.Склады КАК СкладыУправленияЗапасамиТаблицаСкладов
	|						ГДЕ
	|							НЕ СкладыУправленияЗапасамиТаблицаСкладов.Ссылка.ПометкаУдаления
	|							И СкладыУправленияЗапасамиТаблицаСкладов.Подразделение = &Металлоцентр)) КАК ЗаказыПоставщикамОстатки
	|	ГДЕ
	|		ЗаказыПоставщикамОстатки.ЗаказаноОстаток <> 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказыПоставщикамОстатки.Номенклатура,
	|		ЗаказыПоставщикамОстатки.Характеристика) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ПО ВложенныйЗапрос.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	|			И (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок = ""Ценовая категория"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АГ_ПараметрыЦенообразования КАК АГ_ПараметрыЦенообразования
	|		ПО ВложенныйЗапрос.Номенклатура.ВидНоменклатуры = АГ_ПараметрыЦенообразования.НоменклатурнаяГруппа
	|			И (АГ_ПараметрыЦенообразования.Регион = &Металлоцентр)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ОстатокНаСкладе + ВложенныйЗапрос.ОстатокВПути,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	|	АГ_ПараметрыЦенообразования.ЦеновойКоридор,
	|	АГ_ПараметрыЦенообразования.ИзмерениеНаценки,
	|	АГ_ПараметрыЦенообразования.УценочнаяСкидка,
	|	АГ_ПараметрыЦенообразования.ИзмерениеСкидки,
	|	АГ_ПараметрыЦенообразования.ОбязательнаяСкидка,
	|	АГ_ПараметрыЦенообразования.ИзмерениеОС,
	|	АГ_ПараметрыЦенообразования.ПлановаяНаценка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Характеристика.Наименование";
	
	Запрос.УстановитьПараметр("СписокНоменклатур", СписНоменклатуры);
	Запрос.УстановитьПараметр("Металлоцентр", Металлоцентр);
	Запрос.УстановитьПараметр("ВидЦеныВнутр", ТипЦенВнутр);
	
	РезультатаЗапроса = Запрос.Выполнить();
	Если РезультатаЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатаЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.Валюта = Валюта;
		ОбластьМакета.Параметры.БазоваяЦена = ТекЦена;
		
		РасшифровкаОстаток = Новый Структура;
		РасшифровкаОстаток.Вставить("Характеристика", Выборка.Характеристика);
		РасшифровкаОстаток.Вставить("Тип", "Остаток");
		
		ОбластьМакета.Параметры.РасшифровкаОстаток = РасшифровкаОстаток;
		
		Если Выборка.ЦеноваяКатегория.Наименование = "Премиум" Тогда
			ОбластьМакета.Параметры.Процент = Строка(Выборка.Наценка) + ?(Выборка.ИзмерениеНаценки = Перечисления.АГ_ИзмеренияПараметровЦенообразования.Валюта, " " + Строка(Валюта), " %");
			ЗначениеПроцента = Выборка.Наценка;
			ИзмерениеПроцента = Выборка.ИзмерениеНаценки; 
		ИначеЕсли Выборка.ЦеноваяКатегория.Наименование = "Уценка" Тогда
			ОбластьМакета.Параметры.Процент = Строка(-Выборка.УценочнаяСкидка) + ?(Выборка.ИзмерениеСкидки = Перечисления.АГ_ИзмеренияПараметровЦенообразования.Валюта, " " + Строка(Валюта), " %");
			ЗначениеПроцента = -Выборка.УценочнаяСкидка;
			ИзмерениеПроцента = Выборка.ИзмерениеНаценки;
		Иначе
			ОбластьМакета.Параметры.Процент = "0 %";
			ЗначениеПроцента = 0;
			ИзмерениеПроцента = Перечисления.АГ_ИзмеренияПараметровЦенообразования.Процент;
		КонецЕсли;
		
		
		Если ИзмерениеПроцента = Перечисления.АГ_ИзмеренияПараметровЦенообразования.Процент Тогда
			ВнешняяЦена = Окр(ТекЦена + (ЗначениеПроцента * ТекЦена / 100), 2);
		Иначе
			ВнешняяЦена = ТекЦена + ЗначениеПроцента;
		КонецЕсли;
		
		ОбластьМакета.Параметры.ВнешняяЦена = Формат(ВнешняяЦена, "ЧДЦ=2; ЧН=0");
		
		ОбластьМакета.Параметры.ОбязательнаяСкидка = Строка(Выборка.ОбязательнаяСкидка) + ?(Выборка.ИзмерениеОС = Перечисления.АГ_ИзмеренияПараметровЦенообразования.Валюта, " " + Строка(Валюта), " %");
		
		
		Если Выборка.ИзмерениеОС = Перечисления.АГ_ИзмеренияПараметровЦенообразования.Процент Тогда
			
			ВнутренняяЦена = Окр(ВнешняяЦена - (Выборка.ОбязательнаяСкидка * ВнешняяЦена / 100), 2)
			
		Иначе
			
			ВнутренняяЦена = ВнешняяЦена - Выборка.ОбязательнаяСкидка;
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.ВнутренняяЦена = Формат(ВнутренняяЦена, "ЧДЦ=2; ЧН=0");
		
		Если ДиапазонСкидок = 0 Тогда
			ЗаполнитьМатрицуМаржинальностиИзРегистра(Выборка.ПлановаяНаценка);
		КонецЕсли;
		
		ОбластьМакета.Параметры.ДиапазонСкидок = Формат(ДиапазонСкидок, "ЧДЦ=2; ЧН=0") + " %";
		ОбластьМакета.Параметры.Рентабельность = Формат(Выборка.ПлановаяНаценка, "ЧДЦ=2; ЧН=0") + " %";
		
		
		ТрансфертнаяЦена = ОКР(ВнутренняяЦена - (ВнутренняяЦена * Выборка.ПлановаяНаценка / 100), 2);
		ОбластьМакета.Параметры.ТрансфертнаяЦена = Формат(ТрансфертнаяЦена, "ЧДЦ=2; ЧН=0");
		
		
		ОбластьМакета.Параметры.МинимальнаяЦена = Формат(ВнутренняяЦена - ((ВнутренняяЦена - ТрансфертнаяЦена) * ДиапазонСкидок / 100), "ЧДЦ=2; ЧН=0"); 
		
		
		ОбластьОформления = ТабДок.Вывести(ОбластьМакета);
		
		Если ЗначениеПроцента < 0 Тогда
			
			ТабДок.Область(ОбластьОформления.Верх, 8, ОбластьОформления.Низ, 8).ЦветТекста = Новый Цвет(255,0,0);
			
		ИначеЕсли ЗначениеПроцента = 0 Тогда
			
			ТабДок.Область(ОбластьОформления.Верх, 8, ОбластьОформления.Низ, 8).ЦветТекста = Новый Цвет(0,0,0);
			
		Иначе
			
			ТабДок.Область(ОбластьОформления.Верх, 8, ОбластьОформления.Низ, 8).ЦветТекста = Новый Цвет(0,176,80);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ТабДок.МасштабПечати = 80;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатрицуМаржинальностиИзРегистра(ПлановаяНаценка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	ВложенныйЗапрос.Металлоцентр КАК Металлоцентр,
	               |	МИНИМУМ(ВложенныйЗапрос.Поле1) КАК ПолеСортировки
	               |ПОМЕСТИТЬ Таб1
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		АГ_ФакторыОтпускнойЦены.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |		АГ_ФакторыОтпускнойЦены.Металлоцентр КАК Металлоцентр,
	               |		1 КАК Поле1
	               |	ИЗ
	               |		РегистрСведений.АГ_ФакторыОтпускнойЦены КАК АГ_ФакторыОтпускнойЦены
	               |	ГДЕ
	               |		АГ_ФакторыОтпускнойЦены.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
	               |		И АГ_ФакторыОтпускнойЦены.Металлоцентр = &Металлоцентр
	               |		И АГ_ФакторыОтпускнойЦены.ТипПоказателя = &ТипПоказателя
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АГ_ФакторыОтпускнойЦены.НоменклатурнаяГруппа,
	               |		АГ_ФакторыОтпускнойЦены.Металлоцентр,
	               |		2
	               |	ИЗ
	               |		РегистрСведений.АГ_ФакторыОтпускнойЦены КАК АГ_ФакторыОтпускнойЦены
	               |	ГДЕ
	               |		АГ_ФакторыОтпускнойЦены.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
	               |		И АГ_ФакторыОтпускнойЦены.Металлоцентр = &ПустойМЦ
	               |		И АГ_ФакторыОтпускнойЦены.ТипПоказателя = &ТипПоказателя
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АГ_ФакторыОтпускнойЦены.НоменклатурнаяГруппа,
	               |		АГ_ФакторыОтпускнойЦены.Металлоцентр,
	               |		3
	               |	ИЗ
	               |		РегистрСведений.АГ_ФакторыОтпускнойЦены КАК АГ_ФакторыОтпускнойЦены
	               |	ГДЕ
	               |		АГ_ФакторыОтпускнойЦены.НоменклатурнаяГруппа = &ПустаяНГ
	               |		И АГ_ФакторыОтпускнойЦены.Металлоцентр = &Металлоцентр
	               |		И АГ_ФакторыОтпускнойЦены.ТипПоказателя = &ТипПоказателя
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АГ_ФакторыОтпускнойЦены.НоменклатурнаяГруппа,
	               |		АГ_ФакторыОтпускнойЦены.Металлоцентр,
	               |		4
	               |	ИЗ
	               |		РегистрСведений.АГ_ФакторыОтпускнойЦены КАК АГ_ФакторыОтпускнойЦены
	               |	ГДЕ
	               |		АГ_ФакторыОтпускнойЦены.НоменклатурнаяГруппа = &ПустаяНГ
	               |		И АГ_ФакторыОтпускнойЦены.Металлоцентр = &ПустойМЦ
	               |		И АГ_ФакторыОтпускнойЦены.ТипПоказателя = &ТипПоказателя) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.НоменклатурнаяГруппа,
	               |	ВложенныйЗапрос.Металлоцентр
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб1.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	Таб1.Металлоцентр КАК Металлоцентр,
	               |	АГ_ФакторыОтпускнойЦены.Ранжирование КАК Рентабельность,
	               |	АГ_ФакторыОтпускнойЦены.ЗначениеТрансформации КАК ДиапазонСкидки,
	               |	АГ_ФакторыОтпускнойЦены.ИндексСтроки КАК ИндексСтроки,
	               |	АГ_ФакторыОтпускнойЦены.ИзмерениеТрансформации КАК Измерение
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МИНИМУМ(Таб1.ПолеСортировки) КАК ПолеСортировки
	               |	ИЗ
	               |		Таб1 КАК Таб1) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Таб1 КАК Таб1
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АГ_ФакторыОтпускнойЦены КАК АГ_ФакторыОтпускнойЦены
	               |			ПО Таб1.НоменклатурнаяГруппа = АГ_ФакторыОтпускнойЦены.НоменклатурнаяГруппа
	               |				И Таб1.Металлоцентр = АГ_ФакторыОтпускнойЦены.Металлоцентр
	               |				И (АГ_ФакторыОтпускнойЦены.ТипПоказателя = &ТипПоказателя)
	               |		ПО ВложенныйЗапрос.ПолеСортировки = Таб1.ПолеСортировки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИндексСтроки";
	
	Запрос.УстановитьПараметр("ТипПоказателя", Перечисления.АГ_ТипыПоказателейФакторовОтпускнойЦены.Маржинальность);
	Запрос.УстановитьПараметр("Металлоцентр", Металлоцентр);
	Запрос.УстановитьПараметр("ПустойМЦ", Справочники.СтруктураПредприятия.ПустаяСсылка());
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", СписНоменклатуры.ВидНоменклатуры);
	Запрос.УстановитьПараметр("ПустаяНГ", Справочники.ВидыНоменклатуры.ПустаяСсылка());
	
	МатрицаМаржинальности = Запрос.Выполнить().Выгрузить();
	
	ВсегоСкидок = МатрицаМаржинальности.Количество();
	Если ВсегоСкидок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДиапазонСкидок = 0;
	ЕстьТекущий = Ложь;
	
	ТабМатрицаМаржинальности = МатрицаМаржинальности.Скопировать();
	ТабМатрицаМаржинальности.Сортировать("Рентабельность УБЫВ");
	
	Для Каждого текСтрока Из ТабМатрицаМаржинальности Цикл
		
		Если ПлановаяНаценка >= ТекСтрока.Рентабельность и НЕ ЕстьТекущий Тогда
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Рентабельность", ТекСтрока.Рентабельность); 
			НайденныеСтроки = МатрицаМаржинальности.НайтиСтроки(ПараметрыОтбора);
			
			Если Не НайденныеСтроки.Количество() = 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
				ЕстьТекущий = Истина;
				ДиапазонСкидок = НайденнаяСтрока.ДиапазонСкидки;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗНЧ(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка=Ложь;
		
		Если Расшифровка.Тип = "Остаток" Тогда
			ПолучитьРасшифровкуПроцент(Расшифровка.Характеристика);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРасшифровкуПроцент(Характеристика)
	
	Форма = ПолучитьФорму("Обработка.АГ_РаботаСЦенообразованием.Форма.ФормаРасшифровкиНулевыхЦен",,, УникальныйИдентификатор);
	Форма.ТипЦенВнеш = ТипЦенВнеш;
	Форма.ТипЦенВнутр = ТипЦенВнутр;
	Форма.типЦенМин = ТипЦенМин;
	Форма.ТипЦенМРЦ = ТипЦенМРЦ;
	Форма.ТипОтчета = "ФормВнешЦенПоСкладам";
	Форма.Металлоцентр = Металлоцентр;
	Форма.СписНоменклатуры = СписНоменклатуры;
	Форма.Валюта = Валюта;
	Форма.ТекХарактеристика = Характеристика;
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуКалькуляции()
	
	Результат.Очистить();    
    Результат.Вывести(ТекТабДок);
	Результат.МасштабПечати = 80;
	
КонецПроцедуры



