#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтрТаблицаПериодыЗаменить = "ВЫБРАТЬ ДАТАВРЕМЯ(1,1,1) КАК Период, 0 КАК КоличествоНедельВМесяце ПОМЕСТИТЬ ТаблицаПериоды //ТЕКСТ ДЛЯ ПРОГРАММНОЙ ЗАМЕНЫ, НЕ РЕДАКТИРОВАТЬ!";
	
	ДатаНачала = Неопределено;
	ДатаОкончания = Неопределено;
	ТекДата = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	
	Для Каждого Элемент Из ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Элемент.Использование И Элемент.Параметр = Новый ПараметрКомпоновкиДанных("Период") Тогда
				Попытка ДатаНачала = Элемент.Значение.ДатаНачала;
				Исключение КонецПопытки;
				Попытка ДатаОкончания = Элемент.Значение.ДатаОкончания;
				Исключение КонецПопытки;				
			КонецЕсли;				
			Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ДатаНачала = Неопределено Или Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоГода(НачалоГода(ТекДата) - 1); // начало прошлого года
	КонецЕсли;
	Если ДатаОкончания = Неопределено Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецГода(ТекДата);
	КонецЕсли;
	ДатаНачала = НачалоДня(ДатаНачала);
	ДатаОкончания = НачалоДня(ДатаОкончания);
	Если ДатаНачала > ДатаОкончания Тогда
		ДатаНачала = НачалоМесяца(ДатаОкончания);
	КонецЕсли;
	
	СекундВНеделе = 7 * 24 * 60 * 60;
	
	нДата = НачалоНедели(ДатаНачала);
	ТекстЗапрос = "";
	Пока Истина Цикл
		Если Не ЗначениеЗаполнено(ТекстЗапрос) Тогда
			ТекстЗапрос = ТекстЗапрос + "
			|ВЫБРАТЬ
			|	НАЧАЛОПЕРИОДА(ДАТАВРЕМЯ(" + ТекстДатаВремя(нДата) + "), НЕДЕЛЯ) КАК Период,
			|	" + Формат(ПолучитьКоличествоНедельВМесяце(нДата), "ЧН=0; ЧГ=") + " КАК КоличествоНедельВМесяце
			|ПОМЕСТИТЬ
			|	ТаблицаПериоды
			|";
		Иначе
			ТекстЗапрос = ТекстЗапрос + "
			|ОБЪЕДИНИТЬ ВСЕ
			|	
			|ВЫБРАТЬ
			|	НАЧАЛОПЕРИОДА(ДАТАВРЕМЯ(" + ТекстДатаВремя(нДата) + "), НЕДЕЛЯ),
			|	" + Формат(ПолучитьКоличествоНедельВМесяце(нДата), "ЧН=0; ЧГ=") + "
			|";
		КонецЕсли;
		
		нДата = нДата + СекундВНеделе;
		Если нДата > ДатаОкончания Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(
		ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос,СтрТаблицаПериодыЗаменить, ТекстЗапрос);
	//
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстДатаВремя(нДата)
	Возврат Формат(Год(нДата), "ЧН=0; ЧГ=") + "," + Формат(Месяц(нДата), "ЧН=0; ЧГ=") + "," + Формат(День(нДата), "ЧН=0; ЧГ=");
КонецФункции

Функция ПолучитьКоличествоНедельВМесяце(нДата)
	КоличествоНедель = 0;
	НачМесяца = НачалоМесяца(нДата);
	ТекМесяц = Месяц(НачМесяца);
	СекундВНеделе = 7 * 24 * 60 * 60;
	
	Пока Истина Цикл
		Если ТекМесяц <> Месяц(НачМесяца) Тогда
			Прервать;
		КонецЕсли;
		
		КоличествоНедель = КоличествоНедель + 1;
		НачМесяца = НачМесяца + СекундВНеделе;
	КонецЦикла;
	
	Возврат КоличествоНедель;
	
КонецФункции

#КонецОбласти

#КонецЕсли