////////////////////////////////////////////////////////////////////////////////
// CRM трудозатраты сервер
//  
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПредставлениеВремени(ВремяСек) Экспорт
	Если НЕ ЗначениеЗаполнено(ВремяСек) Тогда
		Возврат "";
	КонецЕсли;	
	СтрокаПредставления = "";
	ВремяДень = 24*60*60;
	ВремяЧас = 60*60;
	ВремяМинута = 60;
	тмпДней = Цел(ВремяСек/ВремяДень);
	Если тмпДней > 0 Тогда
		СтрокаПредставления = Формат(тмпДней, "ЧГ=")+" д. ";	
		ВремяСек = ВремяСек - тмпДней * ВремяДень;
	КонецЕсли;	
	тмпЧасов = Цел(ВремяСек/ВремяЧас);
	Если тмпЧасов > 0 Тогда
		СтрокаПредставления = СтрокаПредставления + Формат(тмпЧасов, "ЧГ=")+" ч. ";	
		ВремяСек = ВремяСек - тмпЧасов * ВремяЧас;
	КонецЕсли;
	
	тмпМинут = Цел(ВремяСек/ВремяМинута);
	Если тмпМинут > 0 Тогда
		СтрокаПредставления = СтрокаПредставления + Формат(тмпМинут, "ЧГ=")+" мин. ";	
	КонецЕсли;
	
	Возврат СтрокаПредставления;
	
КонецФункции	

Функция ПолучитьВремяИзСекунд(ВремяСек) Экспорт
	ДатаНачала = Дата('00010101');
	Возврат ДатаНачала+ВремяСек;
КонецФункции

#КонецОбласти