Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления Или Ссылка.ПометкаУдаления Тогда
		Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
			Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Контрагенты") Или ТипЗнч(Владелец) = Тип("СправочникСсылка.Организации") Тогда
				Если Не ДополнительныеСвойства.Свойство("УстановкаСнятиеПометкиУдаленияХозяина") Тогда
					Сообщить("Необходимо устанавливать/снимать пометку удаления у элементов справочника ""Банковские счета"".");
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СокрЛП(ВалютаДенежныхСредств.Код) = "978" Тогда
		Если Не ЗначениеЗаполнено(Банк.РЭЙ_СвифтБИК) И Банк.РЭЙ_НеЯвляетсяРезидентом Тогда
			Сообщить("Для платежей в зоне Евро у банка-нерезидента должен быть заполнен реквизит ""BIC (SWIFT)""");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
