
#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСписокВыбораВремени(ПолеВводаФормы, Интервал = 3600) Экспорт
	Взаимодействия.ЗаполнитьСписокВыбораВремени(ПолеВводаФормы, Интервал = 3600);
КонецПроцедуры

// Получает обычный текст из текста HTML.
//
// Параметры:
//  ТекстHTML  - Строка - текст HTML.
//
// Возвращаемое значение:
//   Строка   - обычный текст
//
Функция ПолучитьОбычныйТекстИзHTML(ТекстHTML) Экспорт
	
	Возврат Взаимодействия.ПолучитьОбычныйТекстИзHTML(ТекстHTML);
	
КонецФункции

Функция ЕстьДокументыВзаимодействия(Взаимодействие) Экспорт
	
	Возврат CRM_ВзаимодействияСервер.ЕстьДокументыВзаимодействия(Взаимодействие);
	
КонецФункции

#КонецОбласти
