
&НаКлиенте
Процедура ТипРазрешенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элементы.РазрезКонтроля.ОграничениеТипа = ТипРазрешенияОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	Запись.РазрезКонтроля = Элементы.РазрезКонтроля.ОграничениеТипа.ПривестиЗначение(Элементы.РазрезКонтроля);
	Если ТипЗнч(Запись.РазрезКонтроля) = Тип("Булево") Тогда
		Запись.РазрезКонтроля = РазрезКонтроля;
		Элементы.РазрезКонтроля.Видимость = Ложь;
		Элементы.РазрезКонтроляНаФорме.Видимость = Истина;
	Иначе
		Элементы.РазрезКонтроля.ФорматРедактирования = "ЧЦ=15; ЧДЦ=2";
		Элементы.РазрезКонтроля.Видимость = Истина;
		Элементы.РазрезКонтроляНаФорме.Видимость = Ложь;
	КонецЕсли;
	
	//Запись.Установил = ПользовательНаСервере();
	//Запись.ДатаУстановки  = ТекущаяДата();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипРазрешенияОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АГ_ТипРазрешенийСверхАкцепта.Ссылка КАК Ссылка,
	|	АГ_ТипРазрешенийСверхАкцепта.ТипРазрешений КАК ТипРазрешений,
	|	АГ_ТипРазрешенийСверхАкцепта.ТипБулево КАК ТипБулево,
	|	АГ_ТипРазрешенийСверхАкцепта.ТипЧисло КАК ТипЧисло
	|ИЗ
	|	Справочник.АГ_ТипРазрешенийСверхАкцепта КАК АГ_ТипРазрешенийСверхАкцепта
	|ГДЕ
	|	АГ_ТипРазрешенийСверхАкцепта.ТипРазрешений = &ТипРазрешения";
	
	Запрос.УстановитьПараметр("ТипРазрешения", ВыбранноеЗначение);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.ТипБулево Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("Булево"));
			Возврат Новый ОписаниеТипов(МассивТипов);
		ИначеЕсли Выборка.ТипЧисло Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип(Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2))));
			Возврат Новый ОписаниеТипов(МассивТипов);
		КонецЕсли;
	КонецЕсли;
	
	//<--АГ:[][14.07.2019 15:07:51][Фирсанов О.И.]
	Если ВыбранноеЗначение=Перечисления.АГ_ТипРазрешенийСверхАкцепта.РазрешениеОтгрузкиПриПревышенииДЗ Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип(Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2))));
		Возврат Новый ОписаниеТипов(МассивТипов);	
		
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Булево"));
		Возврат Новый ОписаниеТипов(МассивТипов);	
		
	КонецЕсли;	
	
	//-->АГ:[]
	
КонецФункции

&НаСервереБезКонтекста
Функция ПользовательНаСервере()
	
	Возврат Пользователи.ТекущийПользователь();
	
КонецФункции	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Запись.РазрезКонтроля) = Тип("Булево") Тогда
	   РазрезКонтроля = Запись.РазрезКонтроля;
	   Элементы.РазрезКонтроля.Видимость = Ложь;
	   Элементы.РазрезКонтроляНаФорме.Видимость = Истина;
	   Иначе
	   Элементы.РазрезКонтроля.Видимость = Истина;
	   Элементы.РазрезКонтроляНаФорме.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры


&НаКлиенте
Процедура РазрезКонтроляНаФормеПриИзменении(Элемент)
	Запись.РазрезКонтроля = РазрезКонтроля;
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Установил = Пользователи.ТекущийПользователь();
	ТекущийОбъект.ДатаУстановки  = ТекущаяДата();
	
КонецПроцедуры



