
#Область ОписаниеПеременных

&НаКлиенте
Перем ВремяТемп;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("ДокументОснование", Объект.ДокументОснование) Тогда
		КонецЕсли;
		Объект.ПлановаяДата = ТекущаяДатаСеанса();
		Объект.ПлановаяДатаЗавершение = Объект.ПлановаяДата + 3600;
		Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
		Если Параметры.Свойство("ВидВзаимодействия", Объект.ВидВзаимодействия) Тогда
			ВидВзаимодействияПриИзмененииНаСервере();
		КонецЕсли;
		Объект.Автор			= Пользователи.АвторизованныйПользователь();
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный	= Объект.Автор;
		КонецЕсли;	
		Объект.Подразделение = Объект.Ответственный.Подразделение;
		Объект.Организация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
		Объект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Запланировано;
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда	
				CRM_ОбщегоНазначенияСервер.ОбработкаЗаполнения(Объект, Объект.ДокументОснование);
				Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
					Объект.ДокументОснование	= Объект.ДокументОснование.Ссылка;
					Объект.КонтактноеЛицо		= Объект.ДокументОснование.КонтактноеЛицо;
					Объект.ОжидаемаяВыручка		= Объект.ДокументОснование.ОжидаемаяВыручка;
					Объект.Ответственный		= Объект.ДокументОснование.Ответственный;
					Объект.Партнер				= Объект.ДокументОснование.Партнер;
					Объект.Подразделение		= Объект.ДокументОснование.Подразделение;
					Объект.ПотенциальныйКлиент	= Объект.ДокументОснование.ПотенциальныйКлиент;
					Объект.Организация			= Объект.ДокументОснование.Организация;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		ТекущийЭлемент = Элементы.ПлановаяДата;
		Элементы.Отменить.Видимость = Ложь;
	Иначе
		ТекущийЭлемент = Элементы.Результат;
		Входящее = (Объект.ВидВзаимодействия.Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Входящее);
		Элементы.Редактировать.Видимость = НЕ Входящее;
		Направление = Объект.ВидВзаимодействия.Направление;
	КонецЕсли;
	Если Параметры.Свойство("СостояниеИнтереса") Тогда
		Объект.СостояниеИнтереса = Параметры.СостояниеИнтереса;
	Иначе
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			Объект.СостояниеИнтереса = Объект.ДокументОснование.СостояниеИнтереса;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) И Параметры.Свойство("Партнер") Тогда
		Объект.Партнер = Параметры.Партнер;
		Параметры.Свойство("КонтактноеЛицо", Объект.КонтактноеЛицо); 
	КонецЕсли;
	СостоянияИнтереса = Новый Массив;
	СостоянияИнтереса.Добавить(Объект.СостояниеИнтереса);
	СостоянияИнтереса.Добавить(Справочники.CRM_СостоянияИнтересов.ПустаяСсылка());
	ПараметрыВыбораВида = Новый Массив;
	ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.Направление", Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее));
	ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.СостояниеИнтереса", Новый ФиксированныйМассив(СостоянияИнтереса)));
	ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес));
	Элементы.ВидВзаимодействия.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВида);
	ПлановаяДатаНачала = Объект.ПлановаяДата;
	Элементы.ПлановаяДатаВремя.Видимость			= (Не Объект.НаВесьДень);
	Элементы.ПлановаяДатаЗавершениеВремя.Видимость	= (Не Объект.НаВесьДень);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Элементы.Результат.ОбновлениеТекстаРедактирования = ОбновлениеТекстаРедактирования.НеИспользовать;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Отменить", "Видимость", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьПланировщик", Объект.ДокументОснование);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлановаяДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура();
	Если ЗначениеЗаполнено(Объект.ПлановаяДата) Тогда
		СтруктураПараметров.Вставить("ДатаПоУмолчанию", Объект.ПлановаяДата);
	КонецЕсли;
	ВремяТемп = Объект.ПлановаяДата-НачалоДня(Объект.ПлановаяДата);
	CRM_ВзаимодействияКлиент.ДатаВзаимодействияНачалоВыбора(Объект, Элемент, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров, РежимОткрытияОкна);
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаПриИзменении(Элемент)
	Если Объект.ПлановаяДата = НачалоДня(Объект.ПлановаяДата) И ЗначениеЗаполнено(ВремяТемп) Тогда
		Объект.ПлановаяДата = Объект.ПлановаяДата+ВремяТемп;
		ВремяТемп = Неопределено;
	КонецЕсли;
	Если НачалоДня(ПлановаяДатаНачала) = НачалоДня(Объект.ПлановаяДатаЗавершение) Тогда
		ВремяЗавершения = Объект.ПлановаяДатаЗавершение - НачалоДня(Объект.ПлановаяДатаЗавершение);
		Объект.ПлановаяДатаЗавершение = НачалоДня(Объект.ПлановаяДата) + ВремяЗавершения;
	КонецЕсли;		
	Если Объект.ПлановаяДата>Объект.ПлановаяДатаЗавершение Тогда
		Объект.ПлановаяДатаЗавершение = Объект.ПлановаяДата + 3600;
	КонецЕсли;
	ПлановаяДатаНачала = Объект.ПлановаяДата;
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаВремяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПлановаяДатаВремяНачалоВыбораЗавершение", ЭтотОбъект);
	CRM_ОбщегоНазначенияКлиентСервер.ВыбратьВремяИзСписка(ЭтотОбъект, Объект.ПлановаяДата,
		Элемент, Объект.ПлановаяДата,, ОписаниеОповещения, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаВремяНачалоВыбораЗавершение(ВыбранноеВремя, Элемент) Экспорт
	
	Если ВыбранноеВремя <> Неопределено Тогда
		Объект.ПлановаяДата = ВыбранноеВремя.Значение;
		ПлановаяДатаПриИзменении(Элементы.ПлановаяДата)
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаЗавершениеВремяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПлановаяДатаЗавершениеВремяНачалоВыбораЗавершение", ЭтотОбъект, Элемент);
	CRM_ОбщегоНазначенияКлиентСервер.ВыбратьВремяИзСписка(ЭтотОбъект, Объект.ПлановаяДатаЗавершение,
		Элемент, Объект.ПлановаяДата, Истина, ОписаниеОповещения, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаЗавершениеВремяНачалоВыбораЗавершение(ВыбранноеВремя, Элемент) Экспорт
	
	Если ВыбранноеВремя <> Неопределено Тогда
		Объект.ПлановаяДатаЗавершение = ВыбранноеВремя.Значение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура РезультатИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ДатаЗавершенияВзаимодействия) Тогда
		ВидимостьЗавершения = ЗначениеЗаполнено(Текст);
		Если Элементы.Завершить.Видимость<>ВидимостьЗавершения Тогда
			Элементы.Завершить.Видимость = ВидимостьЗавершения;
			Элементы.Завершить.КнопкаПоУмолчанию = ВидимостьЗавершения;
			Элементы.ЗаписатьИЗакрыть.КнопкаПоУмолчанию = НЕ ВидимостьЗавершения;
			#Если ВебКлиент Тогда
				Объект.Результат = Текст;
				Элемент.ВыделенныйТекст = "";
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидВзаимодействияПриИзменении(Элемент)
	ВидВзаимодействияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НаВесьДеньПриИзменении(Элемент)
	
	Элементы.ПлановаяДатаВремя.Видимость			= (Не Объект.НаВесьДень);
	Элементы.ПлановаяДатаЗавершениеВремя.Видимость	= (Не Объект.НаВесьДень);
	
	Если Объект.НаВесьДень Тогда
		ПараметрыДня = CRM_ЛентаСобытий.ПараметрыРабочегоДня(Объект.Ответственный);
		Объект.ПлановаяДата = НачалоДня(Объект.ПлановаяДата) + (ПараметрыДня.ВремяНачала - Дата('00010101'));
		Объект.ПлановаяДатаЗавершение = НачалоДня(Объект.ПлановаяДатаЗавершение) + (ПараметрыДня.ВремяОкончания - Дата('00010101'));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Редактировать(Команда)
	Если ПроверитьЗаполнение() Тогда
		Если Модифицированность или Объект.Ссылка.Пустая() Тогда
			Записать();
		КонецЕсли;	
		ОткрытьФорму("Документ.CRM_Взаимодействие.Форма.ФормаДокумента", Новый Структура("Ключ, ОткрыватьФорму", Объект.Ссылка, Истина), ВладелецФормы);
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	ЗавершитьНаСервере();
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ТекстВопроса = НСтр("ru = 'Взаимодействие будет отменено. Продолжить?'");
	ОповещениеЗавершения = Новый ОписаниеОповещения("ОтменитьЗавершение", ЭтотОбъект, Новый Структура);
	ПоказатьВопрос(ОповещениеЗавершения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Модифицированность = Ложь;
		Закрыть();
	Иначе
		Объект.СтатусВзаимодействия = ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Отменено");
		Записать();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидВзаимодействияПриИзмененииНаСервере()
	Объект.Тема = Объект.ВидВзаимодействия.Описание;
	Объект.Баллы = Объект.ВидВзаимодействия.Баллы;
	Если ЗначениеЗаполнено(Объект.ВидВзаимодействия.ПлановыйСрокДней) Тогда
		Объект.ПлановаяДата = ТекущаяДата() + Объект.ВидВзаимодействия.ПлановыйСрокДней*60*60*24;
		Объект.ПлановаяДатаЗавершение = Объект.ПлановаяДата + 3600;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗавершитьНаСервере()
	
	Объект.ДатаЗавершенияВзаимодействия = ТекущаяДатаСеанса();
	Объект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено;
	Объект.ЗавершившийПользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Объект.СостояниеИнтереса = Объект.ДокументОснование.СостояниеИнтереса;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если ЗначениеЗаполнено(Объект.ДатаЗавершенияВзаимодействия) Тогда
		Элементы.Завершить.Видимость = Ложь;
		Элементы.ЗаписатьИЗакрыть.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.Завершить.Видимость = ЗначениеЗаполнено(Объект.Результат);
		Элементы.Завершить.КнопкаПоУмолчанию = Элементы.Завершить.Видимость;
		Элементы.ЗаписатьИЗакрыть.КнопкаПоУмолчанию = НЕ Элементы.Завершить.КнопкаПоУмолчанию;
	КонецЕсли;
	Элементы.КонтактноеЛицо.Видимость = ЗначениеЗаполнено(Объект.Партнер);
	
КонецПроцедуры

#КонецОбласти




