
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если РежимОтладки Тогда
		Обработка = CRM_ТригерыСервер.ВернутьОбработкуДействия(Новый Структура("Действие", ЭтотОбъект));
	Иначе	
		ОбработкаПроверки = ОбработкаДействия.Получить();
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
		ОбработкаПроверки.Записать(ИмяВременногоФайла);
		
		ПараметрыЗащиты = Новый("ОписаниеЗащитыОтОпасныхДействий"+"");
		ПараметрыЗащиты.ПредупреждатьОбОпасныхДействиях = ЛОЖЬ;                                            
		
		Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресХранилища = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор());
		
		Обработка =  ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(АдресХранилища,,Ложь, ПараметрыЗащиты), Ложь);
	КонецЕсли;
	Если Обработка<>Неопределено И Обработка.Метаданные().Реквизиты.Найти("ОбъектДействия")<>Неопределено Тогда
		ОписаниеТипов = Новый ХранилищеЗначения(Обработка.Метаданные().Реквизиты.ОбъектДействия.Тип);
	Иначе
		ОписаниеТипов = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

