Функция ПроверитьНаДублированиеНоменклатуру(Наименование) Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Наименование = &Наименование
	                      |	И НЕ Номенклатура.ПометкаУдаления");
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьНаДублированиеХарактеристику(Наименование, Номенклатура) Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |ГДЕ
	                      |	ХарактеристикиНоменклатуры.Наименование = &Наименование
	                      |	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	                      |	И ХарактеристикиНоменклатуры.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Владелец", Номенклатура);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;

	
КонецФункции
