#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// Реквизиты - Массив - список имен реквизитов объекта.
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	// Исключаемые реквизиты
	Реквизиты.Добавить("БизнесНаправление");
	Реквизиты.Добавить("БизнесПроцесс");
	Реквизиты.Добавить("Важность");
	Реквизиты.Добавить("ВедущийЭтап");
	Реквизиты.Добавить("КартаМаршрута");
	Реквизиты.Добавить("Направление");
	Реквизиты.Добавить("Подразделение");
	Реквизиты.Добавить("МодельЭтапа");
	Реквизиты.Добавить("ЭтапПредок");
	Реквизиты.Добавить("БизнесРегион");
	Реквизиты.Добавить("ВведенВручную");
	
	//Иисключаемые табличные части
	Реквизиты.Добавить("ЧекЛист.*");
	Реквизиты.Добавить("ВариантыКонтекстаФайлов.*");
	Реквизиты.Добавить("Смещения.*");
	Реквизиты.Добавить("ПользователиKT.*");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти
	
#Область ОбновлениеИнформационнойБазы

Процедура ПереходНаНовыеРеквизитыДокумента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ЭтапКалендарногоПлана.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CRM_ЭтапКалендарногоПлана КАК CRM_ЭтапКалендарногоПлана";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ТипЭтапа 				= Перечисления.CRM_ТипыЭтапов.КонтрольнаяТочка;
		ДокументОбъект.ПлановаяДатаНачала 		= ДокументОбъект.Дата;
		ДокументОбъект.ПлановаяДатаОкончания 	= ДокументОбъект.Дата;
		ДокументОбъект.ФактическаяДатаОкончания = ДокументОбъект.ФактическаяДатаНачала;
		Если ЗначениеЗаполнено(ДокументОбъект.ФактическаяДатаНачала) Тогда
			ДокументОбъект.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Проверена;
		Иначе
			ДокументОбъект.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Запланирована;
		КонецЕсли;
		
		ДокументОбъект.ВведенВручную = Истина;
		
		ДокументОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти //ОбновлениеИнформационнойБазы

#КонецЕсли

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.Ссылка.Тема;
	
КонецПроцедуры


