
&НаСервереБезКонтекста
Функция РуководительПодразделения(Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ПО (Пользователи.ФизическоеЛицо = СтруктураПредприятия.ТекущийРуководитель
		|				И СтруктураПредприятия.ТекущийРуководитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
		|ГДЕ
		|	СтруктураПредприятия.Ссылка = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Руководитель	= РуководительПодразделения(Запись.Подразделение);
	Если ЗначениеЗаполнено(Руководитель) Тогда
		Запись.Пользователь	= Руководитель;	
	КонецЕсли;	
КонецПроцедуры
