
////////////////////////////////////////////////////////////////////////////////
// НА СЕРВЕРЕ

//******* СОБЫТИЯ НА СЕРВЕРЕ *******

//******* БИЗНЕС-ЛОГИКА НА СЕРВЕРЕ *******

&НаСервереБезКонтекста
Функция ПолучитьСтрануКонтрагента(Контрагент)
	
	Возврат Контрагент.Страна;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// НА КЛИЕНТЕ

//******* БИЗНЕС-ЛОГИКА НА КЛИЕНТЕ *******

//******* КОМАНДЫ *******

//******* СОБЫТИЯ НА КЛИЕНТЕ *******

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Контрагент) Тогда
		
		СтранаКонтрагента = ПолучитьСтрануКонтрагента(Запись.Контрагент);
		
		Запись.СтранаКонтрагента = СтранаКонтрагента;
		
	Иначе
		
		Запись.СтранаКонтрагента = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры
