
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачПериодТекущийДень", НачалоДня(ТекущаяДата()));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонПериодТекущийДень", КонецДня(ТекущаяДата())); 
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Календарь", Справочники.Календари.НайтиПоНаименованию("Российская Федерация")); 
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаРуб", Справочники.Валюты.НайтиПоНаименованию("RUB")); 
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ФинПравДепартамент", Справочники.СтруктураПредприятия.НайтиПоНаименованию("Финансовый департамент")); 
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДепартаментПродажи", Справочники.СтруктураПредприятия.НайтиПоНаименованию("Департмент продаж"));
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтатьяДДС_ВозвратДСОтПоставщика", Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Возврат ДС поставщиком"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПрочиеПоступленияДСПоОД", Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Прочие поступления ДС по операционной деятельности"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступлениНаличныхДСНаРС", Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Поступление наличных ДС на р/с"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтатьяДДС_ВозвратОбеспечительногоПлатежа", Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Возврат обеспечительного платежа"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтатьяДДС_ПроцентыПоДепозитам", Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Проценты  по депозитам"));
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДепартаментЗакупок", Справочники.СтруктураПредприятия.НайтиПоНаименованию("Департамент закупок и логистики"));
	
	ОплатаПоставщикуМеталл = Новый СписокЗначений;
	ОплатаПоставщикуМеталл.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Оплата поставщику (металл)"));
	ОплатаПоставщикуМеталл.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Оплата поставщику (перекуп металла)"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОплатаПоставщикуМеталл", ОплатаПоставщикуМеталл);

	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОрганизацияАГрупп", Справочники.Организации.НайтиПоНаименованию("А ГРУПП"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОрганизацияРегиональноеСнабжение", Справочники.Организации.НайтиПоНаименованию("Региональное снабжение"));
	
	СписокПрочихОрганизаций = Новый СписокЗначений;
	СписокПрочихОрганизаций.Добавить(Справочники.Организации.НайтиПоНаименованию("МТД Теплоснабжение"));
	СписокПрочихОрганизаций.Добавить(Справочники.Организации.НайтиПоНаименованию("А ГРУПП Логистик"));
	СписокПрочихОрганизаций.Добавить(Справочники.Организации.НайтиПоНаименованию("А ГРУПП Инжиниринг"));
	СписокПрочихОрганизаций.Добавить(Справочники.Организации.НайтиПоНаименованию("ВАШЕ ПРАВО"));
	СписокПрочихОрганизаций.Добавить(Справочники.Организации.НайтиПоНаименованию("Трубопром НПО"));
	СписокПрочихОрганизаций.Добавить(Справочники.Организации.НайтиПоНаименованию("А ГРУПП Нск")); 
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокПрочихОрганизация", СписокПрочихОрганизаций);
		
КонецПроцедуры
