Процедура Инициализировать() Экспорт
	Макет = Справочники.РЭЙ_ВидыВалютныхОпераций.ПолучитьМакет("КлассификаторВидовВалютныхОпераций");
	
	ТекущаяГруппа = Неопределено;
	Для т = 5 по Макет.ВысотаТаблицы Цикл
		Если Макет.Область(т, 1).Шрифт.Жирный Тогда
			текСсылка = Справочники.РЭЙ_ВидыВалютныхОпераций.НайтиПоКоду(Макет.Область(т, 2).Текст + "000");
			Если ЗначениеЗаполнено(текСсылка) Тогда
				текОбъект = текСсылка.ПолучитьОбъект();
			Иначе
				текОбъект = Справочники.РЭЙ_ВидыВалютныхОпераций.СоздатьГруппу();
			КонецЕсли;
			текОбъект.Код = Макет.Область(т, 2).Текст + "000";
			текОбъект.Наименование = Макет.Область(т, 3).Текст;
			текОбъект.НаименованиеПолное = Макет.Область(т, 3).Текст;
			текОбъект.Записать();
			ТекущаяГруппа = текОбъект.Ссылка;
		Иначе
			текСсылка = Справочники.РЭЙ_ВидыВалютныхОпераций.НайтиПоКоду(Макет.Область(т, 2).Текст);
			Если ЗначениеЗаполнено(текСсылка) Тогда
				текОбъект = текСсылка.ПолучитьОбъект();
			Иначе
				текОбъект = Справочники.РЭЙ_ВидыВалютныхОпераций.СоздатьЭлемент();
			КонецЕсли;
			текОбъект.Код = Макет.Область(т, 2).Текст;
			текОбъект.Родитель = ТекущаяГруппа;
			текОбъект.Наименование = Макет.Область(т, 3).Текст;
			текОбъект.НаименованиеПолное = Макет.Область(т, 3).Текст;
			текОбъект.ОжидаемыйСрок = Не ПустаяСтрока(Макет.Область(т, 4).Текст);
			текОбъект.СрокВозвратаАванса = Не ПустаяСтрока(Макет.Область(т, 5).Текст);
			текОбъект.Возврат = Не ПустаяСтрока(Макет.Область(т, 6).Текст);
			текОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
