
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПроверкаНаКорректировочнуюСправку(ПараметрКоманды) Тогда 
		
		ПоказатьПредупреждение(,
		"Корректировочные документы могут создаваться только на основе оригинальных документов. 
		|Выберите, пожалуйста, в качестве основания документ первичного заполнения.");
		
	Иначе
		
		ПараметрыОткрытия	= Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", ПараметрКоманды);
		ОткрытьФорму("Документ.РЭЙ_СправкаОВалютныхОперациях.ФормаОбъекта", ПараметрыОткрытия);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПроверкаНаКорректировочнуюСправку(Ссылка)
	
	Возврат Ссылка.Корректировка; 		
	
КонецФункции	
