
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Запись.Автор	= ПользователиКлиентСервер.ТекущийПользователь();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностью()
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностью()
	
	ДоступностьСтепеньНадежности	= (Запись.Надежность=ПредопределенноеЗначение("Перечисление.АГ_НадежностьПокупателя.Низкая"))
		ИЛИ (Запись.Надежность=ПредопределенноеЗначение("Перечисление.АГ_НадежностьПокупателя.Средняя"));
	
	Элементы.СтепеньНадежности.Доступность	= ДоступностьСтепеньНадежности;
	
	Если НЕ ДоступностьСтепеньНадежности И ЗначениеЗаполнено(Запись.СтепеньНадежности) Тогда
		Запись.СтепеньНадежности	= ПредопределенноеЗначение("Перечисление.АГ_НадежностьПокупателя.ПустаяСсылка");	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура НадежностьПриИзменении(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура СтепеньНадежностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	
	СписокВыбора	= Новый СписокЗначений; 
	СписокВыбора.Очистить();
	Если Запись.Надежность=ПредопределенноеЗначение("Перечисление.АГ_НадежностьПокупателя.Низкая") Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_СтепениНадежностиКонтрагентов.ВходитВСписокНенадежныхКонтрагентов"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_СтепениНадежностиКонтрагентов.ЗаблокированОФК"));	
	ИначеЕсли Запись.Надежность=ПредопределенноеЗначение("Перечисление.АГ_НадежностьПокупателя.Средняя") Тогда	
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_СтепениНадежностиКонтрагентов.Предоплата100Процентов"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_СтепениНадежностиКонтрагентов.Предоплата100ПроцентовИПерегруз"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_СтепениНадежностиКонтрагентов.ПодЛимитСобственнойОтветственности"));
	КонецЕсли;
	
	ДанныеВыбора	=  СписокВыбора;
	
КонецПроцедуры

