
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Состояние = Параметры.Состояние;
	Параметры.Свойство("Выручка", Выручка);
	Элементы.Выручка.ОтметкаНезаполненного = Состояние.УказаниеОжидаемойВыручки;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Состояние.УказаниеОжидаемойВыручки Тогда
		ПроверяемыеРеквизиты.Добавить("Выручка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	Если ПроверитьЗаполнение() Тогда
		Закрыть(Новый Структура("Результат, Выручка", Результат, Выручка));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

