Процедура УстановитьИнициализационныеНастройки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_ВидыЗадачПользователей.Ссылка
	|ИЗ
	|	Справочник.РЭЙ_ВидыЗадачПользователей КАК РЭЙ_ВидыЗадачПользователей
	|ГДЕ
	|	РЭЙ_ВидыЗадачПользователей.Использование = ЛОЖЬ
	|	И РЭЙ_ВидыЗадачПользователей.ИзмененВручную = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		текОбъект = Выборка.Ссылка.ПолучитьОбъект();
		текОбъект.Использование = Истина;
		текОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
