
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//СтруктураБыстрогоОтбора = Неопределено;
	//Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	//
	//ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, "ШаблонПроекта", ОтборШаблонПроекта, СтруктураБыстрогоОтбора);
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ОбновитьОтборыПриИзменении()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, 
	"ШаблонПроекта", 
	ОтборШаблонПроекта, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	ЗначениеЗаполнено(ОтборШаблонПроекта));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборШаблонПроектаПриИзменении(Элемент)
	ОбновитьОтборыПриИзменении();
КонецПроцедуры

#КонецОбласти
