
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьРезультат(Команда)
	СтруктураПараметры = СформироватьРезультатДляСохраненияСервер();
	Если ТипЗнч(СтруктураПараметры) = Тип("Структура") Тогда
		ОткрытьФорму("ОбщаяФорма.CRM_СохранениеЗагрузкаРезультатовОтчетов", СтруктураПараметры, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатВОтбор(Команда)
	СтруктураПараметры = Новый Структура("Режим", "");
	Если Не ЗначениеЗаполнено(Отчет.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки) Тогда
		СтруктураПараметры.Вставить("ИспользоватьПользовательскиеПоляОтбора");
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьРезультатВОтборЗавершение", ЭтотОбъект);
	Форма = ПолучитьФорму("ОбщаяФорма.CRM_ЗагрузкаРезультатовОтчетовВОтбор", СтруктураПараметры, ЭтотОбъект,,,);
	Форма.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Форма.КомпоновщикНастроек = Отчет.КомпоновщикНастроек;
	Форма.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьРезультатДляСохраненияСервер()
	
	Если НЕ CRM_ЛицензированиеСервер.ПодсистемаCRMИспользуется() Тогда
		Возврат НСтр("ru='Невозможно сохранить результат отчета. Подсистема 1С:CRM не используется! (см. Персональные настройки пользователя)';en='The result of report can not be saved. Subsystem 1C: CRM is not used! (see Personal settings of the user)'");
	КонецЕсли;
	
	Возврат CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().ОбщаяФорма_CRM_ОбщаяФормаОтчетов_СформироватьРезультатДляСохраненияСервер(ЭтотОбъект);
КонецФункции

&НаКлиенте
Процедура ЗагрузитьРезультатВОтборЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		CRM_ОбщегоНазначенияКлиент.УстановитьОтборПоСпискуРезультатаОтчета(
		РезультатЗакрытия.Наименование,
		РезультатЗакрытия.Поле,
		Отчет.КомпоновщикНастроек.Настройки,
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

