#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЪЕКТА

// Процедура - обработчик события "ПослеЗаписи"
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
	Если ЭтотОбъект.ЦветИндекс = Неопределено Или ЭтотОбъект.ЦветИндекс < 0 Тогда
		ЭтотОбъект.ЦветИндекс			= 10;
		ЭтотОбъект.ЦветПредставление 	= НСтр("ru='Стальной';en='The steel'");
		ЭтотОбъект.ЦветКрасный  		= 216;
		ЭтотОбъект.ЦветЗеленый  		= 218;
		ЭтотОбъект.ЦветСиний  			= 229;
	КонецЕсли;
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#КонецЕсли
