
////////////////////////////////////////////////////////////////////////////////
// CRM тригеры клиент
//  
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры) Экспорт
	
	СтруктураОбработки = CRM_ТригерыСервер.ПолучитьОбработкуДействийДляКлиента(Форма.Объект.Ссылка, ПредопределенноеЗначение("Перечисление.CRM_СобытияТриггеров.ВыполнитьПереопределяемуюКоманду"));
	
	Если НЕ СтруктураОбработки.ОбработкаДействий = Неопределено Тогда
		Попытка
			Если СтруктураОбработки.НастройкиДействий = Неопределено Тогда
				ФормаОбработки = ПолучитьФорму("ВнешняяОбработка." + СтруктураОбработки.ОбработкаДействий + ".Форма",,Форма);
			Иначе
				ФормаОбработки = ПолучитьФорму("ВнешняяОбработка." + СтруктураОбработки.ОбработкаДействий + ".Форма", Новый Структура("Настройки",СтруктураОбработки.НастройкиДействий), Форма);
			КонецЕсли;
			ФормаОбработки.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры) Экспорт
	
	СтруктураОбработки = CRM_ТригерыСервер.ПолучитьОбработкуДействийДляКлиента(Форма.Объект.Ссылка, ПредопределенноеЗначение("Перечисление.CRM_СобытияТриггеров.ОбработкаОповещения"));
	
	Если НЕ СтруктураОбработки.ОбработкаДействий = Неопределено Тогда
		Попытка
			Если СтруктураОбработки.НастройкиДействий = Неопределено Тогда
				ФормаОбработки = ПолучитьФорму("ВнешняяОбработка." + СтруктураОбработки.ОбработкаДействий + ".Форма",,Форма);
			Иначе
				ФормаОбработки = ПолучитьФорму("ВнешняяОбработка." + СтруктураОбработки.ОбработкаДействий + ".Форма", Новый Структура("Настройки",СтруктураОбработки.НастройкиДействий), Форма);
			КонецЕсли;
			ФормаОбработки.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти