
////////////////////////////////////////////////////////////////////////////////
// НА СЕРВЕРЕ

//******* СОБЫТИЯ НА СЕРВЕРЕ *******

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Владелец") И ТипЗнч(Параметры.Владелец) = Тип("СправочникСсылка.РЭЙ_КонтрактыВЭД") Тогда
		
		Если НЕ ЗначениеЗаполнено(Запись.Договор) Тогда
			
			Запись.Договор = Параметры.Владелец;
			
		КонецЕсли;
		
		Элементы.Договор.Доступность = Ложь;
		
		КонтрактыВЭДКонтрагент 		= Параметры.Контрагент;
		КонтрактыВЭДМногосторонний 	= Параметры.Многосторонний;
		КонтрактыВЭДОрганизация 	= Параметры.Организация;
		КонтрактыВЭДСписокКонтрагентов.ЗагрузитьЗначения(Параметры.СписокКонтрагентов);
		
		ЭтаФорма.Элементы.ДопСоглашение.УстановитьДействие("НачалоВыбора", "КонтрактыВЭДДопСоглашениеНачалоВыбора");
		ЭтаФорма.Элементы.ДопСоглашение.УстановитьДействие("ПриИзменении", "КонтрактыВЭДДопСоглашениеПриИзменении");
				
	КонецЕсли;
	
КонецПроцедуры

//******* БИЗНЕС-ЛОГИКА НА СЕРВЕРЕ *******

&НаСервереБезКонтекста
Функция ПолучитьВалютуВзаиморасчетовНаСервереБезКонтекста(Контрагент)
	
	Возврат Контрагент.ВалютаВзаиморасчетов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// НА КЛИЕНТЕ

//******* БИЗНЕС-ЛОГИКА НА КЛИЕНТЕ *******

&НаКлиенте
Процедура КонтрактыВЭДДопСоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Отбор = Новый Структура;
	
	Отбор.Вставить("Организация", КонтрактыВЭДОрганизация);
	
	Если НЕ КонтрактыВЭДМногосторонний Тогда
		
		Отбор.Вставить("Владелец", КонтрактыВЭДКонтрагент);
		
	Иначе
		
		Отбор.Вставить("Владелец", КонтрактыВЭДСписокКонтрагентов);
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ФормаВыбора = ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрактыВЭДДопСоглашениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДопСоглашение) Тогда
		
		Запись.Валюта = ПолучитьВалютуВзаиморасчетовНаСервереБезКонтекста(Запись.ДопСоглашение);
		
	Иначе
		
		Запись.Валюта = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

//******* КОМАНДЫ *******

//******* СОБЫТИЯ НА КЛИЕНТЕ *******
