
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Константы.ИспользоватьРазделениеПоОбластямДанных.Получить() Тогда
		УстановитьПривилегированныйРежим(Истина);
		Если Значение = Перечисления.CRM_СпособыОтправкиРассылок.SMTP Тогда
			Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.CRM_СтатусыEmailРассылок);
			Если Задание.Использование Тогда
				Задание.Использование = Ложь;
				Задание.Записать();
			КонецЕсли;
		ИначеЕсли Значение = Перечисления.CRM_СпособыОтправкиРассылок.UniSender Тогда
			Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.CRM_СтатусыEmailРассылок);
			Если НЕ Задание.Использование Тогда
				Задание.Использование = Истина;
				Задание.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
