
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.АвтоЗаголовок = Ложь;
	ЭтаФорма.Заголовок = "Задача по ВЭД "+Объект.Номер+" от "+Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	
	Элементы.НадписьПредупреждение.ЦветТекста = ПолучитьЦветТекстСообщенияИнформации();
	
	ОбновитьОписаниеСостоянияДокумента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦветТекстСообщенияИнформации() 
	
	ИмяЭлементаСтиля = "ТекстСообщенияИнформации";
	
	Если Метаданные.ЭлементыСтиля.Найти(ИмяЭлементаСтиля) <> Неопределено Тогда
		Возврат ЦветаСтиля[ИмяЭлементаСтиля];
	Иначе
		Возврат Новый Цвет(0, 128, 0);
	КонецЕсли;
	
КонецФункции

// Определяет флажки-описатели состояния документа, формирует и показывает строку-описание
//
&НаСервере
Процедура ОбновитьОписаниеСостоянияДокумента()

	ОписаниеСостоянияОбъекта = ПолучитьОписаниеОбъекта(Объект.Исполнитель, Объект.Роль, Объект.Организация, Объект.Выполнена);
	Элементы.ДекорацияНадписьПредупреждение.Заголовок = ОписаниеСостоянияОбъекта.ТекстСообщения;
	
	Если Объект.ОбъектЗадачи = Неопределено Тогда
		ОбъектЗадачиНаименование = "";
	ИначеЕсли ТипЗнч(Объект.ОбъектЗадачи) = Тип("СправочникСсылка.РЭЙ_КонтрактыВЭД") Тогда
		ОбъектЗадачиНаименование = Объект.ОбъектЗадачи.Наименование;
	Иначе		
		ОбъектЗадачиНаименование = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(Объект.ОбъектЗадачи);
	КонецЕсли;
	
	Если Объект.ПаспортСделки.Пустая() Тогда
		ПаспортСделкиНаименование = "";
	Иначе		
		ПаспортСделкиНаименование = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(Объект.ПаспортСделки);
	КонецеСли;

КонецПроцедуры

// По описателям состояния задачи (реквизитам адресации) формирует текст инфо-строки и важность сообщения
//
// Параметры
//	Исполнитель, Роль, Организация, Выполнена - реквизиты, влияющие на состояние задачи
//
// Возвращаемое значение:
//	Структура из двух строковых значений - ТекстСообщения и ВажностьСообщения
//   
&НаСервере
Функция ПолучитьОписаниеОбъекта(Исполнитель, Роль, Организация, Выполнена) Экспорт
	
	Если Выполнена Тогда
		ТекстСообщения = "Задача выполнена";
	Иначе
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			ТекстСообщения = "Задачу может выполнить только " + Исполнитель;
		Иначе
			ОписаниеРоли = "";
			Если ЗначениеЗаполнено(Роль) Тогда
				ОписаниеРоли = НРег(Строка(Роль));
			Иначе
				ОписаниеРоли = "бухгалтер или администратор";
			КонецЕсли;
			
			ОписаниеОрганизации = "";
			Если ЗначениеЗаполнено(Организация) Тогда
				ОписаниеОрганизации = " " + "организации" + " " + Строка(Организация);
			КонецЕсли;
			
			ТекстСообщения = "Задачу может выполнить любой " + ОписаниеРоли + ОписаниеОрганизации;
			
			РеквизитыАдресации = Новый Структура;
			Для Каждого Реквизит Из Объект.Ссылка.Метаданные().РеквизитыАдресации Цикл
				РеквизитыАдресации.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ВажностьСообщения = "";
	
	Возврат Новый Структура("ТекстСообщения,ВажностьСообщения", ТекстСообщения, ВажностьСообщения)

КонецФункции

&НаКлиенте
Процедура ОбъектЗадачиНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектЗадачи) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, Объект.ОбъектЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПаспортСделкиНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ПаспортСделки) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, Объект.ПаспортСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	Если Не Параметры.Ключ.Пустая() Тогда
		РЭЙ_СлужебныйКлиент.ВыполнитьЗадачу(Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ОбъектЗадачи) И (ТипЗнч(Объект.ОбъектЗадачи) = Тип("СправочникСсылка.РЭЙ_КонтрактыВЭД")) Тогда
		ОбъектЗадачиНаименование  = Объект.ОбъектЗадачи;
	Иначе
		ОбъектЗадачиНаименование  = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(Объект.ОбъектЗадачи);
	КонецЕсли;
	ПаспортСделкиНаименование = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(Объект.ПаспортСделки);
	КонтрагентНаименование    = ПолучитьНаименованиеКонтрагента();

КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеКонтрагента()

	Контрагент = Объект.КонтрактВЭД.Контрагент;
	
	Если Объект.КонтрактВЭД.Пустая() Тогда
	
		Возврат "";
		
	Иначе
		
		Возврат Объект.КонтрактВЭД.Контрагент.Наименование;
	
	КонецЕсли; 
	
КонецФункции // ()


&НаКлиенте
Процедура КонтрагентОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, Контрагент);
	
КонецПроцедуры
 