// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.

// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.

#Область ОпределениеФормОбъектов

Процедура ОбработкаПолученияФормОбъектов(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	#Область ПереопределениеФормыОтчетов
	
	Если ВидФормы = "Форма" Тогда
		
		ОсновнаяФормаОтчетаКонфигурации = Метаданные.ОсновнаяФормаОтчета;
		
		ИмяОтчета = СтрЗаменить(Строка(Источник), "ОтчетМенеджер.", "");
		
		МетаданныеОтчета = Метаданные.Отчеты.Найти(ИмяОтчета);
		
		Если Не МетаданныеОтчета = Неопределено Тогда
			
			ФормаОтчета = МетаданныеОтчета.ОсновнаяФорма;
			
			Если ФормаОтчета = Неопределено Или ФормаОтчета = ОсновнаяФормаОтчетаКонфигурации Тогда
				
				ВыбраннаяФорма = "ОбщаяФорма.CRM_ФормаОтчета";
				
				СтандартнаяОбработка = Ложь;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;	
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти // ОпределениеФормОбъектов
