
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Если ТипЗнч(ДанныеЗаполнения.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.Номенклатура КАК Номенклатура,
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.НоменклатураДляСертификации КАК НоменклатураДляСертификации,
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.ХарактеристикаНоменклатурыДляСертификации КАК ХарактеристикаНоменклатурыДляСертификации
			|ИЗ
			|	Документ.ЗаказПоставщику.АГ_ДобровольнаяСертификацияНоменклатура КАК ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура
			|ГДЕ
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.Ссылка = &Ссылка
			|	И ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.Ссылка.АГ_ДобровольнаяСертификация";
			
			Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Распоряжение);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			ДобровольнаяСертификация = Ложь;			
			Для каждого СтрокаТЧ из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Сертификация.Добавить();
				НоваяСтрока.НоменклатураИзЗаказаПоставщика = СтрокаТЧ.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТЧ.ХарактеристикаНоменклатуры;
				
				//СтруктураПоиск= Новый Структура("", ) 
				//НоваяСтрока.НоменклатураДляСертификации = РезультатЗапроса.НоменклатураДляСертификации;
				//НоваяСтрока.ХарактеристикаДляСертификации = РезультатЗапроса.ХарактеристикаНоменклатурыДляСертификации;
				//
				//СтрокаНоменклатуры = ДанныеЗаполнения.Товары.Найти(РезультатЗапроса.Номенклатура);
				//НоваяСтрока.ВесПоСертификату =
				//НоваяСтрока.СерияНоменклатуры = СтрокаНоменклатуры.Серия;
				//НоваяСтрока.ДокументОснование = ДанныеЗаполнения.Ссылка;
					
				ДобровольнаяСертификация = Истина;
			КонецЦикла;
			
			Если не ДобровольнаяСертификация Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный товар не подлежит сертификации");
			иначе
				Контрагент = ДанныеЗаполнения.АГ_Контрагент;
				Склад = ДанныеЗаполнения.Склад;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
