
// Открывает форму партнера со старым или новым интерфейсом
//
// Параметры:
//	Форма - УправляемаяФорма - форма, из которой вызывается обработчик.
//		Если вызывается вне формы, тогда значение Неопределено;
//	СтруктураПараметры - Структура - параметры;
//
Процедура ОткрытьФормуПартнераСоответствующуюИнтерфейсу(Форма, СтруктураПараметры) Экспорт
	
	Если CRM_ОбщегоНазначенияПовтИсп.ИспользоватьСтарыйИнтерфейс() Тогда
		ВыбраннаяФорма = "CRM_Модуль_ФормаЭлементаРеквизитыКонтрагента";
	Иначе
		ВыбраннаяФорма = "CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая";
	КонецЕсли;
	ОткрытьФорму("Справочник.Партнеры.Форма."+ВыбраннаяФорма, СтруктураПараметры, Форма);
	
КонецПроцедуры// ОткрытьФормуПартнераСоответствующуюИнтерфейсу(Форма, Результат) Экспорт
	