Процедура Инициализировать() Экспорт
	Макет = Справочники.РЭЙ_ВидыПодтверждающихДокументов.ПолучитьМакет("КлассификаторВидовПодтверждающихДокументов");
	
	Для т = 4 по Макет.ВысотаТаблицы Цикл
		текСсылка = Справочники.РЭЙ_ВидыПодтверждающихДокументов.НайтиПоКоду(Макет.Область(т, 1).Текст);
		Если ЗначениеЗаполнено(текСсылка) Тогда
			текОбъект = текСсылка.ПолучитьОбъект();
			текОбъект.НаименованиеПолное = Макет.Область(т, 2).Текст;
			текОбъект.Возврат = Не ПустаяСтрока(Макет.Область(т, 3).Текст);
			текОбъект.ПериодическиеФиксированныеПлатежи = Не ПустаяСтрока(Макет.Область(т, 4).Текст);
			текОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
