
#Область ПрограммныйИнтерфейс

// Обновить данные ПВХОбъекты журнала
//
Процедура ОбновитьДанныеПВХОбъектыЖурнала() Экспорт
	
	Выборка = ПланыВидовХарактеристик.CRM_ОбъектыЖурналаДокументов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗначения.Типы().Количество() = 1 И (Выборка.ТипЗначения.Типы()[0] = Тип("ДокументСсылка.удалитьCRM_Мероприятие")
			ИЛИ Выборка.ТипЗначения.Типы()[0] = Тип("ДокументСсылка.удалитьCRM_Планирование")
			ИЛИ Выборка.ТипЗначения.Типы()[0] = Тип("ДокументСсылка.УдалитьCRM_Сделка")
			ИЛИ Выборка.ТипЗначения.Типы()[0] = Тип("ДокументСсылка.УдалитьCRM_Событие")) Тогда
			
			ПВХОбъект = Выборка.ПолучитьОбъект();
			ПВХОбъект.Наименование = Метаданные.НайтиПоТипу(Выборка.ТипЗначения.Типы()[0]).Синоним;
			ПВХОбъект.Записать();
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
