Процедура Инициализировать() Экспорт
	Макет = Справочники.РЭЙ_Инкотермс.ПолучитьМакет("Инкотермс2010");
	
	Для т = 4 по Макет.ВысотаТаблицы Цикл
		текСсылка = Справочники.РЭЙ_Инкотермс.НайтиПоКоду(Макет.Область(т, 1).Текст);
		Если ЗначениеЗаполнено(текСсылка) Тогда
			текОбъект = текСсылка.ПолучитьОбъект();
			текОбъект.НаименованиеКраткое = Макет.Область(т, 2).Текст;
			текОбъект.НаименованиеПолное = Макет.Область(т, 3).Текст;
			текОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
