//////////////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОписание = Метаданные.ОбщиеМакеты.Найти("CRM_Модуль_ОписаниеДопНастроекПрав");
	Если ДокументОписание <> Неопределено Тогда
		ДокументОписание = ПолучитьОбщийМакет(ДокументОписание);
	Иначе	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОписаниеНастройкиПрав.Очистить();
	ОписаниеНастройкиПрав.Вывести(ДокументОписание);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОбновленийВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если (Область.Имя = "ПерейтиВРазделНастройкиПрав") Тогда 
		
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Администрирование/ОбщаяКоманда.РазделАдминистрированияНастройкиПользователейИПрав");
		
	ИначеЕсли (Область.Имя = "ПерейтиКНастройкеГруппДоступа") Тогда 
		// Группы доступа:
		ОткрытьФорму("Справочник.ГруппыДоступа.ФормаСписка");		
		
	ИначеЕсли (Область.Имя = "ПерейтиКНастройкеПрофилейГруппДоступа") Тогда 
		// Профили групп доступа:
		ОткрытьФорму("Справочник.ПрофилиГруппДоступа.ФормаСписка");		
		
	ИначеЕсли (Область.Имя = "ПерейтиКСпискуПользователей") Тогда 
		// Группы доступа:
		ОткрытьФорму("Справочник.Пользователи.ФормаСписка");		
	КонецЕсли;
	
КонецПроцедуры

