
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ПоказатьПредупреждение(, "Из этой формы запрещено добавлять настройки параметров валютного учета.
				|Форма настройки сроков находится в меню ""Настройка - Настройка параметров валютного контроля""!", 60);
				
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ПоказатьПредупреждение(, "Из этой формы запрещено изменять настройки параметров валютного учета.
				|Форма настройки сроков находится в меню ""Настройка - Настройка параметров валютного контроля""!", 60);
				
	Отказ = Истина;
	
КонецПроцедуры
