
////////////////////////////////////////////////////////////////////////////////////////////////
// КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОДСИСТЕМЫ "УПРАВЛЕНИЕ ПРОЕКТАМИ"

// Функция возвращает созданный шаблон проекта на основании проекта.
//
// Параметры:
//	Проект	- СправочникСсылка	- Проект, на основании которого создаем шаблон проекта.
//  Параметры - Структура
//
// Возвращаемое значение:
//	СправочникСсылка - созданный шаблон проекта.
//
Процедура СоздатьШаблонНаОснованииПроекта(Проект) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьШаблонНаОснованииПроектаПродолжение", ЭтотОбъект, Проект);
	ОткрытьФорму("Справочник.CRM_ШаблоныПроектов.Форма.ФормаВыбораПараметровСоздания",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

Процедура СоздатьШаблонНаОснованииПроектаПродолжение(Параметры, Проект) Экспорт

	Если Параметры<>Неопределено Тогда
		НовыйШаблон = CRM_УправлениеПроектамиВызовСервера.СоздатьШаблонНаОснованииПроекта(Проект, Параметры);
		Если ЗначениеЗаполнено(НовыйШаблон) Тогда
			ПоказатьЗначение(,НовыйШаблон);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
