Процедура ПередВыполнением()
	Если Исполнитель.Пустая() Тогда
		Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Ссылка.СтатусСправкиОВалютномКонтроле <> СтатусСправкиОВалютномКонтроле Тогда
		ДатаИзмененияСтатуса = ТекущаяДата();
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.РЭЙ_КонтрактыВЭД") Тогда
		КонтрактВЭД = ОбъектЗадачи;
	Иначе
		КонтрактВЭД = ПаспортСделки.КонтрактВЭД;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОбъектЗадачи) Тогда
		Если ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.РЭЙ_КонтрактыВЭД") Тогда
			ОбъектЗадачиПредставление = ОбъектЗадачи.Наименование;
		Иначе
			ОбъектЗадачиПредставление = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(ОбъектЗадачи);
		КонецЕсли
	Иначе
		ОбъектЗадачиПредставление = "";
	КонецЕсли; 
	
	Если СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСозданию Тогда
		ИндексКартинки = 0;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеЗавтра Тогда
		ИндексКартинки = 1;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеПослезавтра Тогда
		ИндексКартинки = 2;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеСегодня Тогда
		ИндексКартинки = 3;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПросрочена Тогда
		ИндексКартинки = 4;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаСоздана Тогда
		ИндексКартинки = 5;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаРаспечатана Тогда
		ИндексКартинки = 6;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаСозданаДокументПерезаписан Тогда
		ИндексКартинки = 7;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаРаспечатанаДокументПерезаписан Тогда
		ИндексКартинки = 8;
	КонецЕсли; 
КонецПроцедуры
